{
  "original_text": "FORM PENGAJUAN JUDUL\nNama : Muhammad Iqbal Manalu\nNIM : 201402011\nJudul diajukan oleh* : Dosen\n Mahasiswa\nBidang Ilmu (tulis dua bidang) : =\nData Science and Intelligent System\nUji Kelayakan Judul** : Diterima Ditolak\nHasil Uji Kelayakan Judul :\nCalon Dosen Pembimbing I: Rossy Nurhasanah S.Kom., M.Kom.\nParaf Calon Dosen Pembimbing I\n(Jika judul dari dosen maka dosen tersebut berhak menjadi pembimbing I)\nCalon Dosen Pembimbing II: Ivan Jaya S.Si., M.Kom.\nMedan, Februari 2024\nKa. Laboratorium Penelitian,\n* Centang salah satu atau keduanya (Fanindia Purnamasari S.TI., M.IT)\n** Pilih salah satu NIP. 198908172019032023\nRINGKASAN JUDUL YANG DIAJUKAN\n*Semua kolom di bawah ini diisi oleh mahasiswa yang sudah mendapat judul\nJudul / Topik Implementasi Model AlexNet Pada Arsitektur Convolutional Neural Network\nSkripsi untuk Klasifikasi Kadar Kolesterol Total Melalui Citra Iris Mata\nLatar Belakang Latar Belakang\ndan Penelitian Penyakit kordiovaskular merupakan salah satu penyakit sebagai penyebab\nTerdahulu\nangka kematian utama setiap tahunnya (Putri & Anita, 2020). Badan Kesehatan Dunia\n(WHO) mencatat angka kematian yang disebabkan oleh penyakit kordiovaskular\n(termasuk penyakit jantung koroner, hipertensi, dan stroke) mencapai 7,9% di seluruh\ndunia pada tahun 2022. Salah satu penyebab terjadinya penyakit kordiovaskular adalah\nkadar kolesterol berlebih yang berada di dalam darah (Siddik et al., 2019). Kolesterol\nmerupakan suatu lemak yang terdapat di dalam aliran darah yang diperlukan untuk\npembentukan hormon dan sel baru (Elisabet et al., 2020). Kadar kolesterol yang tinggi\ndalam darah melebihi normal (hiperkolesterolemia) dapat membentuk endapan pada\ndinding pembuluh darah sehingga menyebabkan penyempitan dan tersumbatnya\npembuluh darah (Putri & Anita, 2020).\nPada manusia terdapat tiga jenis kolesterol yaitu kolesterol total, HDL (High Density\nLipoprotein) atau kolesterol baik, dan LDL (Low Density Lipoprotein) atau kolesterol\njahat. Kolesterol total adalah kadar gabungan antara jumlah kolesterol baik, kolesterol\njahat, dan trigliserida dalam setiap desiliter darah. Kadar kolesterol total normal pada\nmanusia adalah < 200 mg/dL, dikategorikan ABA (Ambang Batas Atas) jika kadar\nkolesterol mencapai 200-239 mg/dL, dan dikategorikan tinggi jika kadar kolesterol >\n240 mg/dL (Susanti & Ikhwan, 2022). Dilansir dari pernyataan Kementerian Kesehatan\nDirektorat Jenderal Pelayanan Kesehatan pada 2022, penderita kolesterol di Indonesia\nmencapai 28% dari total jumlah penduduk. Untuk mencegah semakin tingginya\npresentase dari faktor tersebut maka diperlukan sebuah tindakan mengetahui kadar\nkolesterol sedini mungkin dan berkala dalam mencegah penyakit kardiovaskular\n(Waluya et al., 2019).\nPada umumnya, proses pengecekan kadar kolesterol masih dilakukan dengan teknik\nmengambil sampel darah pasien. Pada proses tersebut terdapat kekurangan yaitu\nmenyebabkan luka dan rasa nyeri pada bagian tubuh pasien yang tertusuk jarum\n(Nurhusni et al., 2021). Seiring dengan perkembangan zaman, dalam bidang kesehatan\nterdapat salah satu cara alternatif untuk mendeteksi kolesterol total yaitu dengan\nmengamati pola yang terbentuk pada iris mata atau yang dikenal dengan iridology.\nUntuk menghindari kesalahan diagnosa, dapat memanfaatkan pemrosesan citra pada iris\nmata menggunakan perangkat lunak untuk mendeteksi secara cepat, efisien, dan akurat\n(Saputra et al., 2017). Citra iris mata dapat diperoleh melalui pemotretan khusus pada\nmata. Citra hasil pemotretan kemudian diolah menggunakan teknik machine learning\nuntuk menghasilkan polanya (Hasanah, 2022). Salah satu algoritma yang populer untuk\nklasifikasi citra saat ini adalah Convolutional Neural Network (CNN). CNN memiliki\ntahapan untuk melakukan ekstraksi pada citra secara otomatis (Naufal et al., 2021).\nBeberapa penelitian sebelumnya telah menunjukkan bahwa berbagai algoritma\npembelajaran mesin dapat digunakan untuk mengklasifikasikan kadar kolesterol\nberdasarkan citra iris mata, dengan tingkat akurasi yang cukup baik. Bonowati et al.\n(2019) pernah menggunakan CNN untuk melakukan identifikasi kolesterol. Penelitian\nini menggunakan model terlatih Inception V3 dengan hasil akurasi penelitian tersebut\nadalah sebesar 97,45%. Namun penelitian tersebut hanya menunjukkan apakah memiliki\nkolesterol normal atau tinggi.\nDalam penelitian yang dilakukan oleh Daniel et al. (2020) mengusulkan sistem\ndeteksi kolesterol yang menggunakan pengolahan citra iris mata dengan menggunakan\nGray Level Co-Occurrence Matrix (GLCM) dan Support Vector Machine (SVM).\nGLCM berfungsi sebagai metode ekstraksi fitur pada gambar, sedangkan SVM berfungsi\nsebagai pengklasifikasi fitur. Penelitian ini menggunakan tiga kelas. Yang pertama\nadalah non kolestrol, risiko kolesterol, dan kolesterol tinggi. Dengan waktu komputasi\nrata-rata 0,0696 detik, diperoleh tingkat akurasi sebesar 94,67%.\nSiddik et al. (2019) merancang sistem yang dapat mendeteksi kadar kolesterol\nseseorang melalui gambar mata dengan menggunakan teknik iridologi dan pemrosesan\ngambar. Histogram of Oriented Gradients (HOG) dan Artificial Neural Network (ANN)\ndigunakan untuk klasifikasi dan metode ekstaksi ciri. Dengan akurasi 93% dan waktu\nkomputasi 0,0862 detik, sistem dapat mendeteksi kadar kolesterol dalam tiga kategori,\nyaitu normal, berisiko tinggi, dan kolesterol tinggi.\nElisabet et al. (2020) juga membangun sistem yang mampu mendeteksi kolesterol\nmelalui citra iris mata dan mengklasifikasikan kedalam tiga kelas. Jumlah citra iris mata\nyang digunakan sebanyak 120 citra dengan 60 data latih dan 60 data uji. Hasil yang\ndiperoleh yaitu tingkat akurasi tertinggi 91.66 % dan waktu komputasi rata-rata 0.3362\ns dengan parameter uji orde satu, radius (r) = 1, resize piksel 768 × 768, ROI = 64, epoch\n1000 dan hidden layer 10.\nPada tahun 2021, Hapsari et al. mengusulkan sistem untuk mengidentifikasi dua\nkelainan penyakit sekaligus dengan algoritma 3D-GLCM yang outputnya berupa\nidentifikasi deteksi dini pada salah satu dari empat kemungkinan cluster yaitu DM\n(Diabetes Mellitus), HC (hypercholesterolemia), DM dan HC, atau normal. Dan telah\ndilakukan identifikasi dengan 3D-GLCM dengan membandingkan tingkat keabuan 16,\n32, 64, dan 256. Hasil pengujian menunjukkan bahwa semakin banyak tingkat keabuan\nyang terdapat pada citra maka nilai sensitivitas dan akurasinya semakin tinggi. Penelitian\nini terbatas pada jumlah dataset yang tersedia. Salah satu kelemahan dari gambar iris\nmata yang diambil selama pengambilan data adalah bahwa kelopak mata responden\nmenutupi iris mata yang diambil jika bentuk mata responden kecil atau sipit.\nSalah satu model arsitektur CNN yang dapat digunakan untuk citra mata adalah\nAlexnet. Model tersebut pernah digunakan oleh Cahya et al. (2021) untuk klasifikasi\npenyakit mata yaitu katarak, glaukoma dan retina disease. Hasil penelitian klasifikasi\npenyakit mata yang menggunakan CNN adalah akurasi 98.37%.\nBalashanmugam et al. (2022) juga pernah menggunakan Alexnet untuk pengenalan\ndan klasifikasi iris mata. Penelitian yang diusulkan mengklasifikasikan iris dengan\nakurasi 99,1% dengan skor F1 0,995. Penelitian Amini & Ameri (2020) mengusulkan\npenggunaan arsitektur Alexnet untuk deteksi Arcus Senilis (AS) yang merupakan gejala\nkolesterol. Peneliti juga membandingkan dengan CNN dan VGG16. Hasilnya Alexnet\nunggul dengan akurasi 100%.\nAlaslani & Elrefaei (2018) juga melakukan penelitian menggunakan AlexNet dan\nmemadukan dengan SVM untuk mengenal citra iris mata, Peneliti melakukan uji coba\npada beberapa dataset public, seperti dataset IITD, data CASIA-Iris-V1, CASIA-Iris-\nthousand, dan CASIA-Iris-V3 Interval. Hasil uji coba penelitian ini menghasilkan rata-\nrata akurasi yang sangat baik, yaitu diatas 95%.\nPada tahun 2020, Omran et al. juga menggunakan AlexNet untuk pengenalan citra\niris mata. Tujuan penelitian tersebut adalah untuk membandingkan kemampuan tiga\nmodel deep learning, antara lain: AlexNet, VGG16, dan VGG19, dalam mengenalii cita\niris mata yang telah diberikan noise. Hasilnya menunjukkan AlexNet unggul dengan\nakurasi 100% dibandingkan VGG16 dan VGG19 yang masing-masing memperoleh\nakurasi 97,88% dan 97,5%.\nBerdasarkan penelitian terdahulu yang telah dibahas di atas, maka penulis\nmengangkat penelitian dengan judul Implementasi Model AlexNet Pada Arsitektur\nConvolutional Neural Network untuk Klasifikasi Kadar Kolesterol Total Melalui\nCitra Iris Mata. Perbedaan dengan penelitian terdahulu yang telah dibahas diatas, yaitu\npada penelitian ini akan menggunakan AlexNet yang akan di-tuning untuk melakukan\nklasifikasi. Berbeda dengan penelitian Ameni & Ameri (2020) yang hanya mendeteksi\nkolesterol, output penelitian ini akan menunjukkan kadar kolesterol total dengan 3 class\nklasifikasi, yaitu normal, beresiko kolesterol, dan kolesterol tinggi.\nPenelitian Terdahulu\nNo. Penulis Judul Tahun\n1 Melvin Daniel, Iris-based Image Processing for 2020\nJangkung Cholesterol Level Detection using Gray\nRaharjo, and Level Co-Occurrence Matrix and\nKoredianto Support Vector Machine\nUsman\n2 Citra Banowati, Cholesterol Level Detection Based on 2019\nAstri Novianty, Iris Recognition Using Convolutional\nCasi Setianingsih Neural Network Method\n3 Muhammad Deteksi Level Kolesterol melalui Citra 2019\nArsyad Siddik, Mata Berbasis HOG dan ANN\nLedya\nNovamizanti, I\nNyoman Apraz\nRamatryana\n4 Agata Elisabet, Deteksi Kolesterol Melalui Citra Iris 2020\nIr. Rita Mata Menggunakan Metode Local\nMagdalena, Dr. Binary Pattern Dan Klasifikasi Jaringan\nIr. Jangkung Syaraf Tiruan\nRaharjo\n5 Rinci Kembang Identification of Diabetes Mellitus and 2021\nHapsari, High Cholesterol Based on Iris Image\nMiswanto\nMiswanto , Riries\nRulaningtyas,\nHerry Suprajitno\n6 Fani Nurona Klasifikasi Penyakit Mata Menggunakan 2021\nCahya, Nila Convolutional Neural Network ( CNN)\nHardi, Dwiza\nRiana, Sri\nHadianti\n7 Thiyaneswaran An Effective Model For The Iris Regional 2022\nBalashanmugam, Characteristics And Classification Using\nKumarganesh Deep Learning Alex Network\nSengottaiyan,\nMartin Sagayam\nKulandairaj, Hien\nDang\n8 Amini, Ameri A Deep Learning Approach to Automatic 2020\nRecognition of Arcus Senilis\n9 Maram.G Alaslani Convolutional Neural Network Based 2018\n& Lamiaa A. Feature Extraction For Iris Recognition\nElrefaei\n10 Eman M. Omran, Noisy Iris Recognition Based on Deep 2020\nRanda F. Soliman, Neural Network\nMaryam Mostafa\nSalah, Sameh A.\nNapoleon, El-\nSayed M. El-\nRabaie, Mustafa\nM. AbdeElnaby,\nNabil A. Ismail,\nAyman A. Eisa, &\nFathi abd El-samie\nRumusan Masalah Presentase penderita kolesterol di Indonesia cukuplah besar sehingga diperlukan\ntindakan untuk mengetahui kadar kolesterol sedini mungkin agar dapat mencegah\nterserangnya penyakit kardiovaskular. Namun pemeriksaaan kolesterol saat ini masih\nbanyak dilakukan dengan pengambilan darah yang sehingga menyababkan rasa nyeri\ntertusuk jarum, serta membutuhkan waktu yang lama dan biaya yang cukup mahal. Oleh\nkarena itu, diperlukan sebuah sistem yang dapat mendeteksi kadar kolesterol dengan\ncepat dan akurat.\nMetodologi\n1. Input Dataset\nData mata penderita kolesterol dan non kolesterol akan dikumpulkan dalam\nformat gambar untuk diproses ke tahap selanjutnya.\n2. Split data\nData yang telah dikumpulkan sebelumnya akan dibagi menjadi data training,\nvalidation, test.\n3. Pra-pemrosesan Data\nGambar yang telah di split, selanjutnya diproses seperti, crop, labeling dan\naugmentasi seperti flip dan zoom.\n4. Pelatihan Model\nTahap ini merupakan tahap membangun arsitektur model menggunakan\nAlexNet dan melatih model dengan data training.\n5. Evaluasi Model\nModel yang telah dibuat akan dievaluasi menggunakan data validasi yang\nbelum pernah digunakan saat pelatihan.\n6. Deployment\nModel yang disimpan akan dikonversi menjadi TensorFlow Lite dan\ndiimplementasikan ke dalam aplikasi Mobile. Kemudian hasil akan diuji\nmenggunakan data testing\n7. Output\nHasil keluarnya adalah normal, beresiko kolesterol, dan kolesterol tinggi.\nReferensi Alaslani, M. G., & Elrefaei, L. A. (2018). Convolutional Neural Network Based\nFeature Extraction For Iris Recognition. International Journal of Computer\nScience & Information Technology (IJCSIT), 10(2), 65-78, doi:\n10.5121/ijcsit.2018.10206\nAmini N., & Ameri A., (2020) A Deep Learning Approach to Automatic\nRecognition of Arcus Senilis. Journal of Biomedical Physics and\nEngineering, 10(4), 507-512, doi:10.31661/jbpe.v0i0.2003-1080\nBalashanmugam, T., Sengottaiyan, K., Kulandairaj, M. S., & Dang, H. (2022).\nAn Effective Model For The Iris Regional Characteristics And\nClassification Using Deep Learning Alex Network. IET Image Processing,\n17(1), 227-238, https://doi.org/10.1049/ipr2.12630\nBanowati, C., Novianty, A., & Setianingsih, C. (2019). Cholesterol Level\nDetection Based on Iris Recognition Using Convolutional Neural Network\nMethod. 2019 IEEE Conference on Sustainable Utilization and\nDevelopment in Engineering and Technologies (CSUDET), 116-121,\nhttps://doi.org/10.1109/CSUDET47057.2019.9214690\nCahya, F. N., Hardi, N., Riana, D., & Hadianti, S. (2021). Klasifikasi Penyakit\nMata Menggunakan Convolutional Neural Network (CNN). SISTEMASI:\nJurnal Sistem Informasi, 10(3), 618-626, doi:10.32520/stmsi.v10i3.1248\nDaniel, M., Raharjo, J., & Usman, K. (2020). Iris-based Image Processing for\nCholesterol Level Detection using Gray Level Co-Occurrence Matrix and\nSupport Vector Machine. Eng. J., 24(5), 135-144,\nhttps://doi.org/10.4186/ej.2020.24.5.135\nElisabet, A., Magdalena, R., & Raharjo, J. (2020). Deteksi Kolesterol Melalui\nCitra Iris Mata Menggunakan Metode Local Binary Pattern dan Klasifikasi\nJaringan Syaraf Tiruan. e-Proceeding of Engineering, 7(2), 3548-3555.\nHapsari, R. K., Miswanto, M., Rulaningtyas, R., & Suprajitno, H. (2021).\nIdentification of Diabetes Mellitus and High Cholesterol Based on Iris\nImage. Journal of Hunan University Natural Sciences, 48(10), 151-160.\nHasanah, R. L. (2022). Deteksi Hiperkolesterolemia Melalui Iris Mata\nMenggunakan Image Processing dengan Metode K-Means Clustering dan\nGray Level CoOccurrence Matrix (GLCM). PRISMA FISIKA, 10(3), 332-\n337.\nNaufal, M. F., Huda, S., Budilaksono, A., Yustisia, W. A., Arius, A. A., Miranti,\nF. A., & Prayoga, F. A. T. (2021). Klasifikasi Citra Game Batu Kertas\nGunting Menggunakan Convolutional Neural Network. Techno.Com:\nJurnal Teknologi Informasi, 20(1), 166–174.\nhttps://doi.org/10.33633/tc.v20i1.4273.\nNurhusni, S. A., Adam, R. I., & Carudin. 2021. Klasifikasi Kadar Kolesterol\nMenggunakan Ekstraksi Ciri Moment Invariant dan Algoritma K-Nearest\nNeighbor (KNN). ournal of Applied Informatics and Computing (JAIC),\n5(02), 169-175.\nOmran, E. M., Soliman, R. F., Salah, M. M., Napoleon, S. A., El-Rabaie, E. M.,\nAbdeElnaby, M. M., Ismail, N. A., Eisa, A. A., & El-samie, F. A. (2020).\nNoisy Iris Recognition Based on Deep Neural Network. Menoufia J. of\nElectronic Engineering Research (MJEER), 29(2), 64-69.\nPutri, M. S., & Anita, D. C. (2020). Literature Review Kadar Kolesterol dan\nKadar Gula Darah dengan Kejadian Penyakit Jantung Koroner. Universitas\n‘Aisyiyah.\nSiddik, M. A., Novamizanti, L., & Ramatryana, I. N. A. (2019). Deteksi Level\nKolesterol melalui Citra Mata Berbasis HOG dan ANN. ELKOMIKA, 7(2),\n284-296.\nSusanti, N., & Ikhwan (2022). Deteksi Dini Kadar Gula Darah Sewaktu,\nKolesterol Total dan Asam Urat pada Masyarakat Kecamatan Deli Tua.\nShihatuna: Jurnal Pengabdian Kesehatan Masyarakat, 2(1), 12-22.\nWaluya, D. P., Suhartono, E., & Safitri, I. (2019). Deteksi Kolesterol\nMenggunakan Citra Mata Berbasis Local Binary Pattern (LBP) Dan\nSupport Vector Machine (SVM). e-Proceeding of Engineering, 6(2), 3814-\n3821.\nMedan, Februari 2024\nMahasiswa yang mengajukan,\n(Muhammad Iqbal Manalu)\nNIM. 201402011",
  "similar_tokens": [
    "development",
    "applied",
    "evaluasi",
    "nila",
    "computer",
    "putri",
    "tinggi",
    "as",
    "an",
    "s",
    "risiko",
    "biaya",
    "ciri",
    "ekstraksi",
    "alir",
    "and",
    "bidang",
    "nama",
    "angka",
    "fungsi",
    "who",
    "literature",
    "hindar",
    "hardi",
    "utama",
    "ambil",
    "coba",
    "endap",
    "arsitektur",
    "deli",
    "usul",
    "otomatis",
    "terima",
    "ringkas",
    "serang",
    "sakit",
    "judul",
    "alternatif",
    "skripsi",
    "h",
    "bas",
    "aju",
    "f",
    "university",
    "conference",
    "atas",
    "beda",
    "angkat",
    "parameter",
    "komputasi",
    "tiru",
    "hak",
    "amat",
    "layan",
    "isi",
    "skom",
    "skor",
    "v",
    "mampu",
    "in",
    "capai",
    "using",
    "informatics",
    "cegah",
    "sedia",
    "rinci",
    "tutup",
    "manfaat",
    "mahasiswa",
    "hasil",
    "i",
    "al",
    "review",
    "faktor",
    "raharjo",
    "kelas",
    "iring",
    "aplikasi",
    "gambar",
    "ssi",
    "kala",
    "sampel",
    "tahap",
    "jadi",
    "identifikasi",
    "to",
    "form",
    "bagi",
    "l",
    "rumus",
    "referensi",
    "dr",
    "uji",
    "pilih",
    "a",
    "bentuk",
    "tahun",
    "unggul",
    "j",
    "radius",
    "based",
    "kenal",
    "universitas",
    "responden",
    "badan",
    "dasar",
    "oleh",
    "lunak",
    "tuju",
    "tulis",
    "oriented",
    "presentase",
    "calon",
    "guna",
    "cepat",
    "kategori",
    "keluar",
    "non",
    "milik",
    "gejala",
    "k",
    "detik",
    "mobile",
    "nim",
    "banding",
    "akurat",
    "natural",
    "bangun",
    "topik",
    "resiko",
    "martin",
    "layak",
    "nip",
    "laboratorium",
    "medan",
    "et",
    "w",
    "lebih",
    "method",
    "kumpul",
    "kurang",
    "iqbal",
    "konversi",
    "jenis",
    "r",
    "technology",
    "muhammad",
    "pola",
    "manusia",
    "kece",
    "for",
    "efisien",
    "sri",
    "sciences",
    "derita",
    "pasien",
    "camat",
    "no",
    "lemah",
    "jurnal",
    "ilmu",
    "c",
    "perangkat",
    "sempit",
    "technologies",
    "sehat",
    "rancang",
    "normal",
    "research",
    "deteksi",
    "kembang",
    "interval",
    "m",
    "g",
    "latar",
    "olah",
    "international",
    "bimbing",
    "bahas",
    "kolom",
    "engineering",
    "tua",
    "informasi",
    "sebab",
    "intelligent",
    "ir",
    "teknik",
    "e",
    "citra",
    "nilai",
    "el",
    "dalam",
    "urat",
    "t",
    "batu",
    "duduk",
    "the",
    "indonesia",
    "gabung",
    "level",
    "information",
    "implementasi",
    "teliti",
    "nyata",
    "dunia",
    "khusus",
    "p",
    "tingkat",
    "journal",
    "amin",
    "tindak",
    "setianingsih",
    "nali",
    "centang",
    "batas",
    "regional",
    "total",
    "salah",
    "diagnosa",
    "n",
    "simpan",
    "ka",
    "d",
    "on",
    "test",
    "latih",
    "cas",
    "lite",
    "ambang",
    "masyarakat",
    "abdi",
    "science",
    "metodologi",
    "dosen",
    "high",
    "ii",
    "mkom",
    "proses",
    "format",
    "sumbat",
    "butuh",
    "populer"
  ],
  "filename": "1751857095_Exum_201402011.pdf",
  "user_id": 17
}