{
  "original_text": "Universitas Sumatera Utara Alamat\nJalan Universitas No. 9 Email: fasilkomti@usu.ac.id\nFAKULTAS ILMU KOMPUTER DAN TEKNOLOGI INFORMASI\nKampus USU, Medan Telepon: (061) 8213793\nPROGRAM STUDI S-1 TEKNOLOGI INFORMASI 20155\nRINGKASAN JUDUL YANG DIAJUKAN\n*Semua kolom di bawah ini diisi oleh mahasiswa yang sudah mendapat judul\nJudul / Topik Segmentasi dan Klasifikasi Tahapan Diferensiasi Kanker Kolorektal Menggunakan\nSkripsi Segment Anything Model (SAM) dan ConvNeXtV2 pada Citra Histopatologi\nLatar Belakang Latar Belakang\ndan Penelitian\nTerdahulu Kanker kolorektal merupakan salah satu jenis kanker yang paling umum dan mematikan\ndi dunia. Berdasarkan data World Health Organization (WHO) tahun 2020, tercatat lebih dari\n1,9 juta kasus baru dan sekitar 930.000 kematian akibat kanker kolorektal di seluruh dunia.\nAngka tersebut menempatkan kanker kolorektal sebagai penyebab kematian tertinggi kedua\nakibat kanker, setelah kanker paru-paru(WHO, 2020). Berdasarkan data Global Cancer\nObservatory (Globocan) tahun 2022, kanker kolorektal di Indonesia menempati peringkat\nkeempat tertinggi dalam jumlah kasus kanker. Tren kasus menunjukkan peningkatan setiap\ntahun, dengan 35.676 kasus baru dan 19.255 kematian tercatat pada tahun 2022 (Globocan,\n2022). Data global maupun nasional tersebut menunjukkan bahwa kanker kolorektal masih\nmenjadi permasalahan kesehatan yang serius dan memerlukan upaya penanganan lebih lanjut,\nbaik dari sisi pencegahan, diagnosis dini, maupun strategi pengobatan yang lebih efektif.\nDalam praktik diagnostik, analisis histopatologi tetap menjadi standar emas untuk\ndeteksi kanker (Nagtegaal et al., 2019). Selama ini, proses menganalisis citra histopatologi untuk\nmendiagnosis kanker kolorektal membutuhkan ketelitian tinggi, waktu yang lama, serta\npemahaman yang mendalam. Meski demikian, analisis ini sangat penting dalam menentukan\npenanganan yang tepat bagi pasien kanker kolorektal. Namun, tingginya beban kerja para ahli\npatologi di fasilitas kesehatan dapat menyebabkan kesalahan diagnosis yang tidak disadari saat\nmelakukan analisis gambar setiap harinya (Wang et al., 2021).\nPerkembangan deep learning dalam klasifikasi kanker kolorektal telah menunjukkan\nkemajuan signifikan dalam beberapa tahun terakhir. Penelitian oleh Sarwindah et al. (2021)\nmengimplementasikan arsitektur ResNet-18 dan ResNet-50 untuk membedakan jaringan kolon\njinak dan ganas. Hasil penelitian menunjukkan bahwa ResNet-50 mencapai akurasi di atas 80%\ndengan sensitivitas 87% dan spesifisitas 83% pada pembagian data uji 20-25%, mengungguli\nResNet-18. Temuan ini membuktikan bahwa model CNN yang lebih dalam dapat meningkatkan\nreliabilitas diagnosis histopatologis.\nStudi lain yang dilakukan oleh Merabet et al. (2024) melakukan analisis komparatif\nmenggunakan dataset LC25000 yang terdiri dari 5 kelas, termasuk jaringan kolon\nUniversitas Sumatera Utara Alamat\nJalan Universitas No. 9 Email: fasilkomti@usu.ac.id\nFAKULTAS ILMU KOMPUTER DAN TEKNOLOGI INFORMASI\nKampus USU, Medan Telepon: (061) 8213793\nPROGRAM STUDI S-1 TEKNOLOGI INFORMASI 20155\nadenokarsinoma dan jaringan normal. Penelitian ini membandingkan performa CNN,\nInceptionV3, dan ResNet50, serta mengusulkan integrasi InceptionV3-ResNet50 yang berhasil\nmencapai akurasi 99.2% dengan recall sempurna. Hasil ini menunjukkan bahwa kombinasi\narsitektur deep learning dapat menghasilkan klasifikasi yang lebih robust dibandingkan model\ntunggal.\nShi et al. (2023) memperkenalkan dataset spesialis EBHI-Seg yang berisi 4.456 citra\nhispatologis dengan anotasi lengkap untuk enam tahap diferensiasi tumor, mulai dari jaringan\nnormal hingga adenokarsinoma. Penelitian mereka juga menguji dataset ini dengan berbagai\npendekatan segmentasi, termasuk U-Net dan Medical Transformer (MedT), di mana hasilnya\nmenunjukkan keunggulan metode deep learning dibandingkan teknik klasik seperti K-Means\nClustering dengan peningkatan rata-rata Dice Score mencapai 25%. Ketersediaan dataset\nteranotasi semacam ini, sebagaimana ditegaskan oleh Shi et al. (2023), menjadi fondasi kritis\nbagi pengembangan model yang lebih akurat di masa depan.\nBerdasarkan Mazurowski et al. (2023), Segment Anything Model (SAM) dirancang\nuntuk melakukan segmentasi objek dalam sebuah gambar berdasarkan prompt yang diberikan\noleh pengguna, seperti titik tunggal, sekumpulan titik, kotak pembatas, atau bahkan teks. Dengan\nfleksibilitas jenis prompt tersebut, SAM menunjukkan potensi besar untuk diterapkan dalam\nberbagai tugas segmentasi, termasuk dalam citra medis yang kompleks. Studi oleh Roy et al.\n(2023) juga menunjukkan bahwa SAM mampu melakukan segmentasi organ pada citra CT\nabdomen secara zero-shot, menjadikannya alat yang menjanjikan untuk segmentasi semi-\notomatis dalam aplikasi klinis. Meski demikian, untuk mencapai performa optimal di ranah\nmedis, masih diperlukan penyesuaian terhadap karakteristik spesifik dari data medis itu sendiri.\nBerdassarkan Liu et al. (2023), ConvNeXtV2 adalah arsitektur jaringan saraf\nkonvolusional yang dirancang untuk mengoptimalkan efisiensi dan kemampuan generalisasi.\nModel ini menggabungkan konsep-konsep dari model Transformer dengan peningkatan\narsitektur CNN tradisional, yang memungkinkan performa yang lebih baik dalam berbagai tugas\npengenalan citra. ConvNeXtV2 telah diuji pada dataset seperti ImageNet dan COCO, dan\nhasilnya menunjukkan keunggulan signifikan dalam hal akurasi dan kecepatan dibandingkan\ndengan arsitektur konvolusional lainnya. Model ini menjadikannya pilihan yang sangat baik\nuntuk aplikasi dalam citra medis, termasuk klasifikasi dan analisis citra histopatologi.\nBerdasarkan urgensi permasalahan di atas dan perkembangan teknologi yang ada, maka\npenelitian ini mengangkat judul \" Segmentasi dan Klasifikasi Tahapan Diferensiasi Kanker\nKolorektal Menggunakan Segment Anything Model (SAM) dan ConvNeXtV2 pada Citra\nUniversitas Sumatera Utara Alamat\nJalan Universitas No. 9 Email: fasilkomti@usu.ac.id\nFAKULTAS ILMU KOMPUTER DAN TEKNOLOGI INFORMASI\nKampus USU, Medan Telepon: (061) 8213793\nPROGRAM STUDI S-1 TEKNOLOGI INFORMASI 20155\nHistopatologi \". Penelitian ini mengusulkan pendekatan hybrid yang mengintegrasikan\nSegment Anything Model (SAM) untuk segmentasi wilayah tumor dan ConvNeXtV2 untuk\nklasifikasi enam tahap diferensiasi pada citra histopatologi. Integrasi segmentasi dan klasifikasi\ndalam penelitian ini bertujuan untuk memberikan informasi yang lebih komprehensif kepada\nahli patologi. Fokus utama penelitian adalah membangun sistem diagnostik otomatis yang\nmampu meningkatkan akurasi dan efisiensi analisis dibandingkan metode konvensional.\nImplementasi SAM diharapkan dapat mengatasi tantangan segmentasi pada variasi morfologi\ntumor yang kompleks, sementara ConvNeXtV2 akan memanfaatkan fitur hierarkis untuk\nklasifikasi tahapan diferensiasi yang lebih presisi. Evaluasi performa akan dilakukan\nmenggunakan dataset EBHI-Seg dengan parameter utama meliputi akurasi segmentasi (Dice\nScore), akurasi klasifikasi (F1-Score), serta waktu komputasi, sekaligus menganalisis potensi\npeningkatan signifikan dalam mendukung keputusan klinis melalui uji statistik komprehensif.\nPenelitian Terdahulu\nNo. Penulis Judul Tahun\nLiyu Shi, Xiaoyan\nLi, Weiming Hu,\nHaoyuan Chen, Jing\nChen, Zizhen Fan,\nMinghe Gao, Yujie\nJing, Guotao Lu, EBHI-Seg: A novel enteroscope biopsy\nDeguo Ma, Zhiyu histopathological hematoxylin and eosin\n1. 2023\nMa, Qingtao Meng, image dataset for image segmentation\nDechao Tang, tasks\nHongzan Sun,\nMarcin Grzegorzek,\nShouliang Qi,\nYueyang Teng, dan\nChen Li\nWeiming Hu, Chen\nLi, Md Mamunur\nRahaman, Haoyuan\nEBHI: A new Enteroscope Biopsy\nChen, Wanli Liu,\n2. Histopathological H&E Image Dataset 2023\nYudong Yao,\nfor image classification evaluation\nHongzan Sun,\nMarcin Grzegorzek,\nXiaoyan Li\nUniversitas Sumatera Utara Alamat\nJalan Universitas No. 9 Email: fasilkomti@usu.ac.id\nFAKULTAS ILMU KOMPUTER DAN TEKNOLOGI INFORMASI\nKampus USU, Medan Telepon: (061) 8213793\nPROGRAM STUDI S-1 TEKNOLOGI INFORMASI 20155\nDevvi Sarwinda,\nDeep Learning in Image Classification\nRadifa Hilya\nusing Residual Network (ResNet)\n3. Paradisa, Alhadi 2021\nVariants for Detection of Colorectal\nBustamam, dan\nCancer\nPinkie Anggia\nAsma Merabet,\nEnhancing Colon Cancer Prediction in\nAsma Saighi,\nHistopathology with Integrated Deep\n4. Mohamed 2024\nLearning Models: A Comparative Study\nAbderraouf Ferradji,\non the LC25000 Dataset\ndan Zakaria Laboudi\nAmgad Muneer,\nShakirah Mohd Taib,\nColorectal Cancer Recognition Using\nMohd Hilmi Hasan,\n5. Deep Learning on Histopathology 2023\ndan Alawi\nImages\nAlqushaibi\nUsama Zidan,\nMohamed Medhat SwinCup: Cascaded swin transformer\n6. Gaber, dan for histopathological structures 2023\nMohammed M. segmentation in colorectal cancer\nAbdelsamea\nM. Siva Naga Raju Classification of Colon Cancer through\n7. dan Dr. B. Srinivasa analysis of histopathology images using 2022\nRao Transfer Learning\nNaglaa F. Noaman,\nHybrid ResNet-ViT Model for Lung\nAhmad Al Smadi,\n8. Cancer Classification from 2024\nBassam M. Kanber,\nHistopathology Images\ndan Ahed Abugabah\nUniversitas Sumatera Utara Alamat\nJalan Universitas No. 9 Email: fasilkomti@usu.ac.id\nFAKULTAS ILMU KOMPUTER DAN TEKNOLOGI INFORMASI\nKampus USU, Medan Telepon: (061) 8213793\nPROGRAM STUDI S-1 TEKNOLOGI INFORMASI 20155\nChandrasekar\nVenkatachalam,\nPriyanka Shah,\nEnhanced Diagnostic Precision for Lung\nKarthikc Raghunath\n9. Cancer: A Hybrid Deep Learning Model 2024\nK M, Sincy John,\nCombining Xception and EfficientNetB3\nRenuka Devi P, dan\nShanmugavalli\nVenkatachalam\nLubna Abdelkareim\nGabralla, Ali\nMohamed Hussien,\nAbdulaziz\nAlMohimeed, Hager Automated Diagnosis for Colon Cancer\nSaleh, Deema Diseases Using Stacking Transformer\n10. 2023\nMohammed Models and Explainable Artificial\nAlsekait, Shaker El- Intelligence\nSappagh,\nAbdelmgeid A. Ali,\ndan Moatamad\nRefaat Hassan\nR. Sujatha,\nColorectal cancer prediction via\nMahalakshmi K, dan\n11. histopathology segmentation using DC- 2024\nMohamed Sirajudeen\nGAN and VAE-GAN\nYoosuf\nPembeda dengan penelitian terdahulu :\nBerbeda dengan penelitian-penelitian sebelumnya yang umumnya menggunakan dataset\nseperti LC25000 dengan fokus pada klasifikasi biner antara jaringan normal dan kanker pada\njaringan kolon maupun paru-paru, penelitian ini memanfaatkan dataset EBHI-Seg yang secara\nkhusus berisi citra histopatologi dari jaringan kolon dengan anotasi enam tahap diferensiasi\ntumor, termasuk tahap awal seperti polip. Keberadaan kelas polip dalam dataset ini menjadi\nkeunggulan tersendiri karena memungkinkan pendeteksian dini terhadap potensi kanker, yang\nkrusial untuk pencegahan maupun intervensi awal. Selain itu, meskipun beberapa arsitektur deep\nlearning seperti ResNet dan InceptionV3 telah banyak diteliti dalam konteks klasifikasi kanker\nkolorektal, penggunaan Segment Anything Model (SAM) untuk segmentasi akurat wilayah\ntumor dan ConvNeXtV2 untuk klasifikasi tahapan kanker yang lebih presisi belum banyak\ndieksplorasi. Dengan demikian, penelitian ini menawarkan kontribusi baru melalui kombinasi\nUniversitas Sumatera Utara Alamat\nJalan Universitas No. 9 Email: fasilkomti@usu.ac.id\nFAKULTAS ILMU KOMPUTER DAN TEKNOLOGI INFORMASI\nKampus USU, Medan Telepon: (061) 8213793\nPROGRAM STUDI S-1 TEKNOLOGI INFORMASI 20155\ndataset spesifik dan metode mutakhir yang belum banyak diterapkan pada studi sejenis, guna\nmeningkatkan akurasi dan efisiensi dalam segmentasi dan klasifikasi tahapan diferensiasi kanker\nkolorektal\nRumusan Masalah Berdasarkan latar belakang, penelitian ini mengidentifikasi tiga permasalahan utama.\nPertama, meskipun analisis histopatologi merupakan standar emas dalam diagnosis kanker\nkolorektal, proses identifikasinya masih bergantung pada observasi manual oleh ahli patologi,\nyang rentan terhadap subjektivitas, membutuhkan waktu lama, serta memiliki risiko kesalahan\ndiagnosis akibat beban kerja yang tinggi. Kedua, penelitian terdahulu umumnya menggunakan\ndataset terbatas dengan pendekatan klasifikasi biner antara normal dan ganas, sehingga belum\noptimal dalam mendukung diagnosis tahapan kanker yang lebih rinci. Ketiga, meskipun berbagai\narsitektur deep learning telah banyak diaplikasikan, pemanfaatan Segment Anything Model\n(SAM) untuk segmentasi akurat wilayah tumor dan ConvNeXtV2 untuk klasifikasi tahapan\nkanker yang lebih presisi belum banyak dieksplorasi untuk dataset multi kelas seperti EBHI-Seg\nyang mencakup anotasi lengkap tahapan diferensiasi tumor. Oleh karena itu, penelitian ini\nbertujuan untuk mengevaluasi performa SAM dan ConvNextV2 dalam segmentasi dan\nmengklasifikasikan enam tahap diferensiasi kanker kolorektal pada dataset EBHI-Seg serta\nmengukur potensinya dalam meningkatkan akurasi dan efisiensi diagnosis dibandingkan metode\nkonvensional.\nUniversitas Sumatera Utara Alamat\nJalan Universitas No. 9 Email: fasilkomti@usu.ac.id\nFAKULTAS ILMU KOMPUTER DAN TEKNOLOGI INFORMASI\nKampus USU, Medan Telepon: (061) 8213793\nPROGRAM STUDI S-1 TEKNOLOGI INFORMASI 20155\nMetodologi\nTahapan Penellitian :\nData Acquisition\nTahapan pertama dalam arsitektur ini adalah pengumpulan data atau data acquisition.\nPada tahap ini, data berupa gambar histopatologi dikumpulkan dan terdiri dari enam kelas\nyang mencerminkan tahapan diferensiasi kanker kolorektal, yaitu normal, polyp, low\ngrade-IN, high grade-IN, serrated adenoma, dan adenocarcinoma. Setiap gambar\nmewakili kondisi jaringan usus yang berbeda, dan digunakan sebagai dasar untuk\npelatihan model klasifikasi.\nSplit Data\nSetelah data terkumpul, langkah selanjutnya adalah membagi dataset menjadi tiga bagian,\nyaitu data training, validation, dan testing. Pembagian ini bertujuan agar proses pelatihan\nmodel dapat berlangsung dengan optimal. Data training digunakan untuk melatih model,\nUniversitas Sumatera Utara Alamat\nJalan Universitas No. 9 Email: fasilkomti@usu.ac.id\nFAKULTAS ILMU KOMPUTER DAN TEKNOLOGI INFORMASI\nKampus USU, Medan Telepon: (061) 8213793\nPROGRAM STUDI S-1 TEKNOLOGI INFORMASI 20155\ndata validation digunakan untuk menyetel parameter model agar tidak mengalami\noverfitting, dan data testing digunakan untuk mengukur kinerja akhir model terhadap data\nyang belum pernah dilihat sebelumnya.\nPre Processing\nData yang telah dibagi kemudian melewati tahap pre-processing atau pra-pemrosesan.\nPada tahap ini dilakukan beberapa proses penting seperti resizing untuk menyesuaikan\nukuran gambar agar seragam dan sesuai dengan kebutuhan model, labelling untuk\nmemberikan label kelas pada setiap gambar, serta augmentation untuk memperkaya data\ndengan variasi buatan seperti rotasi, pencerminan, atau pergeseran. Selain itu, dilakukan\njuga proses normalization untuk mengubah rentang nilai piksel gambar agar berada dalam\nskala tertentu (misalnya 0 hingga 1) sehingga memudahkan dan mempercepat proses\npelatihan model. Proses ini penting untuk meningkatkan kemampuan generalisasi model\nsaat berhadapan dengan data baru.\nProcessing Model\nData training yang telah diproses kemudian dimasukkan ke dalam tahap pemrosesan\nmenggunakan model deep learning. Pada tahap ini, pemrosesan dilakukan dalam dua\nlangkah utama. Pertama, citra histopatologi yang telah melalui tahap pre-processing\ndisegmentasi menggunakan Segment Anything Model (SAM) untuk mengekstraksi area-\narea penting dari jaringan yang relevan. Hasil segmentasi ini kemudian digunakan sebagai\ninput untuk langkah kedua, yaitu proses klasifikasi menggunakan ConvNeXtV2. Model\nConvNeXtV2 dipilih karena efisiensinya dalam penggunaan sumber daya komputasi serta\nperforma yang tinggi dalam mengenali pola visual. Melalui tahapan ini, model dilatih\nuntuk mengenali dan membedakan fitur-fitur spesifik dari setiap kelas tahapan diferensiasi\nkanker kolorektal.\nTrained Model dan Detection\nSetelah pelatihan selesai, model yang telah dilatih atau trained model akan digunakan\nuntuk melakukan proses detection. Data testing dimasukkan ke dalam model untuk\nmenguji seberapa baik model tersebut mampu mengenali dan mengklasifikasikan gambar\nbaru. Proses deteksi ini menghasilkan output berupa prediksi terhadap kelas dari gambar\ninput, yang merepresentasikan tahap diferensiasi kanker kolorektal.\nUniversitas Sumatera Utara Alamat\nJalan Universitas No. 9 Email: fasilkomti@usu.ac.id\nFAKULTAS ILMU KOMPUTER DAN TEKNOLOGI INFORMASI\nKampus USU, Medan Telepon: (061) 8213793\nPROGRAM STUDI S-1 TEKNOLOGI INFORMASI 20155\nOutput\nHasil dari deteksi yang dilakukan oleh model akan menampilkan identifikasi dari enam\ntahapan diferensiasi kanker, yaitu\n Normal: Kondisi jaringan usus yang sehat, tanpa perubahan sel abnormal.\n Polyp: Pertumbuhan jaringan abnormal yang menonjol di permukaan usus. Belum\ntentu ganas, tapi bisa berkembang menjadi kanker\n low grade-IN: Perubahan awal pada sel usus yang menunjukkan kelainan\npertumbuhan sel, namun masih terlokalisasi dan belum invasif\n High grade-IN: Sel-sel sudah menunjukkan ciri-ciri keganasan, tapi belum\nmenembus lapisan bawah (belum invasif). Ini adalah tahap pra-kanker\n Serrated adenoma: Jenis polip yang memiliki potensi tinggi berubah menjadi\nkanker\n Adenocarcinoma : Kanker ganas yang berasal dari sel epitel kelenjar di usus besar.\nSudah invasif, artinya sel kanker telah menyebar menembus lapisan usus dan bisa\nmenyebar ke organ lain.\nInformasi ini berguna dalam membantu proses diagnosis awal serta mendukung\npengambilan keputusan medis secara lebih cepat dan akurat dengan memanfaatkan deep\nlearning.\nReferensi\nBray, F., Laversanne, M., Sung, H., Ferlay, J., Siegel, R. L., Soerjomataram, I., & Jemal,\nA. (2024). Global cancer statistics 2022: GLOBOCAN estimates of incidence and\nmortality worldwide for 36 cancers in 185 countries. CA: A Cancer Journal for\nClinicians, 74(3), 229–263. https://doi.org/10.3322/caac.21834\nChen, H., Li, C., Li, X., Rahaman, M. M., Hu, W., Li, Y., Liu, W., Sun, C., Sun, H.,\nHuang, X., & Grzegorzek, M. (2022). IL-MCAM: An interactive learning and\nmulti-channel attention mechanism-based weakly supervised colorectal\nhistopathology image classification approach. Computers in Biology and Medicine,\n143, 105265. https://doi.org/10.1016/j.compbiomed.2022.105265\nGabralla, L. A., Hussien, A. M., AlMohimeed, A., Saleh, H., Alsekait, D. M., El-\nSappagh, S., Ali, A. A., & Refaat Hassan, M. (2023). Automated Diagnosis for\nColon Cancer Diseases Using Stacking Transformer Models and Explainable\nArtificial Intelligence. Diagnostics, 13(18), 2939.\nhttps://doi.org/10.3390/diagnostics13182939\nHu, W., Li, C., Rahaman, M. M., Chen, H., Liu, W., Yao, Y., Sun, H., Grzegorzek, M.,\n& Li, X. (2023). EBHI: A new Enteroscope Biopsy Histopathological H&amp;E\nUniversitas Sumatera Utara Alamat\nJalan Universitas No. 9 Email: fasilkomti@usu.ac.id\nFAKULTAS ILMU KOMPUTER DAN TEKNOLOGI INFORMASI\nKampus USU, Medan Telepon: (061) 8213793\nPROGRAM STUDI S-1 TEKNOLOGI INFORMASI 20155\nImage Dataset for image classification evaluation. Physica Medica, 107, 102534.\nhttps://doi.org/10.1016/j.ejmp.2023.102534\nIizuka, O., Kanavati, F., Kato, K., Rambeau, M., Arihiro, K., & Tsuneki, M. (2020).\nDeep Learning Models for Histopathological Classification of Gastric and Colonic\nEpithelial Tumours. Scientific Reports, 10(1), 1504.\nhttps://doi.org/10.1038/s41598-020-58467-9\nMazurowski, M. A., Dong, H., Gu, H., Yang, J., Konz, N., & Zhang, Y. (2023). Segment\nanything model for medical image analysis: An experimental study. Medical Image\nAnalysis, 89, 102918. https://doi.org/10.1016/j.media.2023.102918\nMerabet, A., Saighi, A., Ferradji, M. A., & Laboudi, Z. (2024). Enhancing Colon Cancer\nPrediction in Histopathology with Integrated Deep Learning Models: A\nComparative Study on the LC25000 Dataset. 2024 6th International Conference on\nPattern Analysis and Intelligent Systems (PAIS), 1–7.\nhttps://doi.org/10.1109/PAIS62114.2024.10541219\nMuneer, A., Taib, S. M., Hasan, M. H., & Alqushaibi, A. (2023). Colorectal Cancer\nRecognition Using Deep Learning on Histopathology Images. 2023 13th\nInternational Conference on Information Technology in Asia (CITA), 25–30.\nhttps://doi.org/10.1109/CITA58204.2023.10262551\nNaga Raju, M. S., & Srinivasa Rao, Dr. B. (2022). Classification of Colon Cancer\nthrough analysis of histopathology images using Transfer Learning. 2022 IEEE 2nd\nInternational Symposium on Sustainable Energy, Signal Processing and Cyber\nSecurity (ISSSC), 1–6. https://doi.org/10.1109/iSSSC56467.2022.10051631\nNagtegaal, I. D., Odze, R. D., Klimstra, D., Paradis, V., Rugge, M., Schirmacher, P.,\nWashington, K. M., Carneiro, F., & Cree, I. A. (2020). The 2019 WHO\nclassification of tumours of the digestive system. Histopathology, 76(2), 182–188.\nhttps://doi.org/10.1111/his.13975\nNoaman, N. F., Al Smadi, A., Kanber, B. M., & Abugabah, A. (2024). Hybrid ResNet-\nViT Model for Lung Cancer Classification from Histopathology Images. 2024 25th\nInternational Arab Conference on Information Technology (ACIT), 1–5.\nhttps://doi.org/10.1109/ACIT62805.2024.10877013\nRoy, S., Wald, T., Koehler, G., Rokuss, M. R., Disch, N., Holzschuh, J., Zimmerer, D.,\n& Maier-Hein, K. H. (2023). SAM.MD: Zero-shot medical image segmentation\ncapabilities of the Segment Anything Model. arXiv preprint.\nhttps://doi.org/10.48550/arXiv.2304.05396\nSarwinda, D., Paradisa, R. H., Bustamam, A., & Anggia, P. (2021). Deep Learning in\nImage Classification using Residual Network (ResNet) Variants for Detection of\nColorectal Cancer. Procedia Computer Science, 179, 423–431.\nhttps://doi.org/10.1016/j.procs.2021.01.025\nShi, L., Li, X., Hu, W., Chen, H., Chen, J., Fan, Z., Gao, M., Jing, Y., Lu, G., Ma, D.,\nMa, Z., Meng, Q., Tang, D., Sun, H., Grzegorzek, M., Qi, S., Teng, Y., & Li, C.\nUniversitas Sumatera Utara Alamat\nJalan Universitas No. 9 Email: fasilkomti@usu.ac.id\nFAKULTAS ILMU KOMPUTER DAN TEKNOLOGI INFORMASI\nKampus USU, Medan Telepon: (061) 8213793\nPROGRAM STUDI S-1 TEKNOLOGI INFORMASI 20155\n(2023). EBHI-Seg: A novel enteroscope biopsy histopathological hematoxylin and\neosin image dataset for image segmentation tasks. Frontiers in Medicine, 10.\nhttps://doi.org/10.3389/fmed.2023.1114673\nSujatha, R., K, M., & Yoosuf, M. S. (2024). Colorectal cancer prediction via\nhistopathology segmentation using DC-GAN and VAE-GAN. EAI Endorsed\nTransactions on Pervasive Health and Technology, 10.\nhttps://doi.org/10.4108/eetpht.10.5395\nVenkatachalam, C., Shah, P., M, K. R. K., John, S., P, R. D., & Venkatachalam, S.\n(2024). Enhanced Diagnostic Precision for Lung Cancer: A Hybrid Deep Learning\nModel Combining Xception and EfficientNetB3. 2024 4th International\nConference on Mobile Networks and Wireless Communications (ICMNWC), 1–6.\nhttps://doi.org/10.1109/ICMNWC63764.2024.10872176\nWahid, R. R., Nisa’, C., Amaliyah, R. P., & Puspaningrum, E. Y. (2023). Lung and\ncolon cancer detection with convolutional neural networks on histopathological\nimages. 020020. https://doi.org/10.1063/5.0114327\nWang, K. S., Yu, G., Xu, C., Meng, X. H., Zhou, J., Zheng, C., Deng, Z., Shang, L., Liu,\nR., Su, S., Zhou, X., Li, Q., Li, J., Wang, J., Ma, K., Qi, J., Hu, Z., Tang, P., Deng,\nJ., … Deng, H. W. (2021). Accurate diagnosis of colorectal cancer based on\nhistopathology images using artificial intelligence. BMC Medicine, 19(1), 76.\nhttps://doi.org/10.1186/s12916-021-01942-5\nWoo, S., Debnath, S., Hu, R., Chen, X., Liu, Z., Kweon, I. S., & Xie, S. (2023).\nConvNeXt V2: Co-designing and Scaling ConvNets with Masked Autoencoders.\n2023 IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR),\n16133–16142. https://doi.org/10.1109/CVPR52729.2023.01548\nZhou, C., Jin, Y., Chen, Y., Huang, S., Huang, R., Wang, Y., Zhao, Y., Chen, Y., Guo,\nL., & Liao, J. (2021). Histopathology classification and localization of colorectal\ncancer using global labels by weakly supervised deep learning. Computerized\nMedical Imaging and Graphics, 88, 101861.\nhttps://doi.org/10.1016/j.compmedimag.2021.101861\nZidan, U., Gaber, M. M., & Abdelsamea, M. M. (2023). SwinCup: Cascaded swin\ntransformer for histopathological structures segmentation in colorectal cancer.\nExpert Systems with Applications, 216, 119452.\nhttps://doi.org/10.1016/j.eswa.2022.119452\nMedan, 8 Mei 2025\nMahasiswa yang mengajukan,\n(Al Anhar Sufi)\nNIM. 211402045",
  "similar_tokens": [
    "standar",
    "proses",
    "isi",
    "tampil",
    "liput",
    "bantu",
    "science",
    "relevan",
    "usu",
    "journal",
    "wang",
    "fokus",
    "daya",
    "masuk",
    "akibat",
    "lengkap",
    "dunia",
    "manfaat",
    "sempurna",
    "beban",
    "angkat",
    "maju",
    "et",
    "teliti",
    "w",
    "hasil",
    "kerja",
    "teknik",
    "fleksibilitas",
    "deng",
    "deteksi",
    "objek",
    "informasi",
    "j",
    "an",
    "rotasi",
    "tinggi",
    "konteks",
    "on",
    "referensi",
    "atas",
    "d",
    "butuh",
    "kombinasi",
    "gantung",
    "konvensional",
    "dalam",
    "pre",
    "email",
    "teks",
    "enhancing",
    "performa",
    "sedia",
    "sumatera",
    "graphics",
    "ct",
    "alat",
    "presisi",
    "liu",
    "ekstraksi",
    "juta",
    "applications",
    "strategi",
    "mudah",
    "alamat",
    "tingkat",
    "kondisi",
    "komputasi",
    "zhang",
    "dekat",
    "lewat",
    "combining",
    "aplikasi",
    "the",
    "batas",
    "tangan",
    "global",
    "dr",
    "medan",
    "nd",
    "s",
    "mahasiswa",
    "tahap",
    "u",
    "masalah",
    "studi",
    "parameter",
    "jadi",
    "optimal",
    "study",
    "ubah",
    "f",
    "praktik",
    "jenis",
    "nali",
    "krusial",
    "sebab",
    "putus",
    "catat",
    "httpsdoiorg",
    "mei",
    "salah",
    "aju",
    "n",
    "zhou",
    "rao",
    "sisi",
    "dasar",
    "hari",
    "medis",
    "ali",
    "resizing",
    "l",
    "cakup",
    "analis",
    "klasifikasi",
    "beda",
    "kampus",
    "latih",
    "tawar",
    "angka",
    "usul",
    "temu",
    "generalisasi",
    "sumber",
    "li",
    "i",
    "tunggal",
    "hadap",
    "asal",
    "akurat",
    "skala",
    "p",
    "guo",
    "al",
    "representasi",
    "ma",
    "pola",
    "vision",
    "ukur",
    "based",
    "transfer",
    "integrasi",
    "janji",
    "kaya",
    "area",
    "signifikan",
    "kumpul",
    "kolom",
    "eksplorasi",
    "high",
    "komprehensif",
    "y",
    "conference",
    "selesai",
    "pilih",
    "rentang",
    "fasilitas",
    "kotak",
    "energy",
    "through",
    "ringkas",
    "communications",
    "universitas",
    "hybrid",
    "acquisition",
    "lapis",
    "httpsdoiorgs",
    "prediksi",
    "sesuai",
    "networks",
    "klinis",
    "tang",
    "khusus",
    "kelas",
    "tentu",
    "visual",
    "using",
    "wilayah",
    "nasional",
    "unggul",
    "ambil",
    "sensitivitas",
    "otomatis",
    "b",
    "md",
    "mobile",
    "computer",
    "rancang",
    "no",
    "ieee",
    "by",
    "images",
    "health",
    "capai",
    "jalan",
    "comparative",
    "tempat",
    "arsitektur",
    "r",
    "h",
    "sun",
    "klasik",
    "topik",
    "bukti",
    "alami",
    "v",
    "zhao",
    "identifikasi",
    "from",
    "label",
    "a",
    "nilai",
    "tugas",
    "efektif",
    "k",
    "milik",
    "sebar",
    "th",
    "spesifik",
    "kembang",
    "information",
    "utara",
    "tumbuh",
    "tiga",
    "t",
    "tuju",
    "kompleks",
    "shang",
    "harap",
    "manual",
    "o",
    "variasi",
    "telepon",
    "kenal",
    "uji",
    "meng",
    "technology",
    "wireless",
    "guna",
    "arab",
    "kontribusi",
    "gabung",
    "implementasi",
    "karakteristik",
    "in",
    "evaluasi",
    "huang",
    "and",
    "with",
    "citra",
    "indonesia",
    "potensi",
    "ilmu",
    "sehat",
    "roy",
    "langkah",
    "muka",
    "judul",
    "wakil",
    "buat",
    "new",
    "z",
    "latar",
    "program",
    "fakultas",
    "titik",
    "statistik",
    "low",
    "international",
    "bangun",
    "q",
    "trained",
    "efisiensi",
    "gambar",
    "novel",
    "skripsi",
    "ahli",
    "empat",
    "e",
    "piksel",
    "tantang",
    "banding",
    "evaluation",
    "obat",
    "c",
    "pemrosesan",
    "paham",
    "sadar",
    "cepat",
    "tulis",
    "xu",
    "ratarata",
    "terap",
    "integrated",
    "transactions",
    "kritis",
    "ada",
    "rumus",
    "bagi",
    "mampu",
    "augmentation",
    "dukung",
    "g",
    "gu",
    "he",
    "for",
    "m",
    "intelligent",
    "utama",
    "enhanced",
    "saraf",
    "metodologi",
    "x",
    "chen",
    "pasien"
  ],
  "filename": "1751960381_Exum_211402045.pdf",
  "user_id": 17
}