{
  "original_text": "RINGKASAN JUDUL YANG DIAJUKAN\n*Semua kolom di bawah ini diisi oleh mahasiswa yang sudah mendapat judul\nJudul / Topik IMPLEMENTASI LARGE LANGUAGE MODEL (LLM) DAN\nSkripsi RETRIEVAL-AUGMENTED GENERATION (RAG) UNTUK CHATBOT CUSTOMER\nSERVICE LOLOSASN\nLatar Belakang Latar Belakang\ndan Penelitian\nTerdahulu LolosASN adalah aplikasi yang dirancang untuk membantu masyarakat dalam persiapan\nujian Calon Pegawai Negeri Sipil (CPNS). Aplikasi ini menyediakan berbagai fitur, seperti\nsimulasi soal CPNS, materi pembelajaran, dan latihan soal seleksi ASN. LolosASN merupakan\nproduk startup mahasiswa Universitas Sumatera Utara (USU) yang mendapatkan pendanaan\ndari Google dan Kementerian Pendidikan melalui program Bangkit Academy 2024.\nSaat ini, LolosASN telah aktif memberikan layanan kepada lebih dari 5.000 pengguna di\nseluruh Indonesia. Mengingat pentingnya kebutuhan pengguna akan informasi layanan,\nLolosASN memiliki customer service yang berperan dalam menjawab berbagai pertanyaan\npengguna terkait layanan aplikasi.\nLayanan pelanggan atau Customer service adalah salah satu elemen utama yang berperan\npenting bagi perusahaan dalam menciptakan kepuasan pelanggan. Customer service\nmemungkinkan perusahaan untuk memahami keinginan dan harapan pelanggan melalui\npendekatan komunikasi antarpribadi. Customer service menjadi penghubung langsung antara\npelanggan dan perusahaan, sehingga perannya sangat penting bagi keberhasilan perusahaan\n(Tarsani, 2017).\nSelain itu, Menurut Juanamasta et al. (2019), customer service berperan dalam meningkatkan\nloyalitas dan kepuasan pelanggan. Customer service membantu membangun hubungan yang\nkuat, memperkuat citra positif perusahaan, serta memahami kebutuhan dan harapan pelanggan\nsecara langsung. Customer service juga memungkinkan perusahaan untuk memberikan layanan\npersonal berdasarkan kebutuhan pelanggan dan menangani keluhan dengan cepat, yang pada\nakhirnya meningkatkan kepercayaan dan kesan positif terhadap perusahaan.\nSaat ini, layanan customer service didominasi oleh metode yang bersifat online. Akan tetapi,\nonline customer service masih memiliki kekurangan. Salah satunya adalah layanan sering kali\nhanya tersedia pada jam kerja tertentu, sehingga menyulitkan pelanggan yang membutuhkan\nbantuan di luar jam operasional tersebut (Taher, 2021). Selain itu, Ketika layanan pelanggan\ndaring tidak dapat memenuhi kebutuhan mereka dengan cepat atau secara personal, hal ini\ndapat menyebabkan pelanggan memiliki emosi negatif seperti kebingungan, keraguan, dan\nkekecewaan, yang akhirnya berdampak buruk pada pengalaman mereka (McLean & Wilson,\n2016). Permasalahan tersebut juga dialami oleh customer service LolosASN. Banyaknya\nkeluhan yang masuk secara bersamaan ditambah dengan keterbatasan jam operasional\nmenyulitkan customer service LolosASN dalam memberikan pelayanan yang optimal, yang\npada akhirnya dapat berdampak pada persepsi pengguna terhadap LolosASN.\nKecerdasan buatan atau artificial Intelligence dapat meningkatkan kualitas layanan online\ncustomer service dengan menggunakan chatbot. Chatbot adalah program komputer berbasis\nkecerdasan buatan yang dapat melakukan percakapan melalui audio atau teks (Haristiani,\n2019). Penelitian sebelumnya oleh Ngai et al. (2021) berfokus pada pengembangan chatbot\nberbasis kecerdasan buatan untuk meningkatkan layanan pelanggan e-commerce. Tujuan\npenelitian ini adalah mengatasi keterbatasan chatbot tradisional dalam memperbarui informasi\ndan menangani interaksi kompleks. Data yang digunakan berasal dari percakapan antara\npelanggan dan staf layanan pelanggan di perusahaan manufaktur pakaian wanita. Model yang\ndigunakan dalam penelitian ini adalah Natural Language Processing (NLP) serta pemutakhiran\ndataset melalui web crawler. Sistem chatbot yang dikembangkan menunjukkan tingkat akurasi\n100% dalam tes dibandingkan dengan staf manusia. Evaluasi pengguna mencatatkan rata-rata\nskor kepuasan sebesar 4,3 dari skala 5 untuk aspek relevansi, kualitas, dan kejelasan respon\nchatbot.\nSelanjutnya, penelitian oleh Sadhu et al. (2024) berfokus pada tantangan dalam\nmengotomatisasi layanan pelanggan menggunakan chatbot berbasis AI untuk meningkatkan\nefisiensi layanan dan kepuasan pengguna dalam lingkungan e-commerce. Dataset yang\ndigunakan dikumpulkan dari interaksi antara chatbot dan pelanggan di perusahaan e-commerce\ntersebut. Penelitian ini memanfaatkan Natural Language Processing (NLP) untuk mendukung\nfungsi chatbot, termasuk algoritma intent recognition dan sentiment analysis. Hasil penelitian\nmenunjukkan bahwa tingkat keberhasilan chatbot dalam menjawab pertanyaan rutin pelanggan\nmencapai lebih dari 85%, dan survei kepuasan pengguna mencatat respons positif terhadap\nkemampuan chatbot dalam menangani permintaan umum, meskipun efektivitasnya menurun\npada pertanyaan yang lebih kompleks.\nKemudian, penelitian Katragadda (2023) yang membahas tentang customer support\ntradisional yang membutuhkan banyak waktu dan sumber daya, yang sering menyebabkan\nketidakpuasan pelanggan karena waktu tunggu yang lama dan kualitas layanan yang tidak\nkonsisten. Penelitian ini mengevaluasi efektivitas chatbot berbasis machine learning dalam\nmengotomatisasi layanan pelanggan dan membandingkan performa chatbot dengan metode\ndukungan tradisional untuk meningkatkan kepuasan pelanggan dan efisiensi operasional .\nDataset yang digunakan diambil dari historical customer support records dan hasil survei serta\nwawancara dengan pelanggan dan staf pendukung . Model yang digunakan adalah Natural\nLanguage Processing (NLP) dan deep learning dengan model seperti BERT (Bidirectional\nEncoder Representations from Transformers) dan GPT (Generative Pre-trained Transformer),\nserta Reinforcement Learning untuk mengoptimalkan respons berdasarkan interaksi pengguna.\nAkurasi chatbot tercatat sebesar 92% dibandingkan dengan 85% pada metode dukungan\ntradisional. Selain itu, chatbot menunjukkan waktu respons rata-rata 5 detik dibandingkan\ndengan 45 detik pada layanan tradisional, yang meningkatkan kepuasan pelanggan dengan skor\nrata-rata 4.2 dari skala 5 .\nKemudian, Penelitian oleh Shafique et al. (2024) yang membahas tentang tantangan dalam\nmemilih platform chatbot AI yang optimal untuk lingkungan IoT dengan menggunakan dataset\ndari LMSYS (Large Model Systems Organization), yang mencakup sekitar 57 ribu percakapan\nhasil interaksi pengguna dengan beberapa model chatbot terkemuka, seperti GPT-4, Llama, dan\nClaude. Studi ini menggunakan model DeBERTaV3 dari KerasNLP untuk memproses dan\nmenganalisis teks dari percakapan chatbot tersebut. Hasilnya menunjukkan bahwa model ini\nmencapai tingkat akurasi hingga 99% dalam mengidentifikasi chatbot yang menghasilkan\nrespons terbaik pada beberapa pengujian, dengan probabilitas kemenangan setiap chatbot\ndiukur untuk memprediksi preferensi pengguna.\nSelain itu, Perancangan chatbot tidak hanya dapat dikembangkan dengan NLP, tetapi juga\ndapat menggunakan Large Language Model (LLM). LLM menjadi semakin umum dan sudah\ndigunakan dalam pemasaran konten, layanan pelanggan, dan berbagai aplikasi bisnis\n(Neumann, 2024). penelitian yang dilakukan oleh Salminen et al. (2024) bertujuan untuk\nmenganalisis interaksi siswa dengan chatbot berbasis Large Language Model (LLM) dalam\nkonteks pendidikan, serta mengevaluasi kemampuan chatbot dalam menjawab pertanyaan yang\nterkait dengan materi pembelajaran. Penelitian ini menggunakan dataset yang terdiri dari 8077\npesan yang dikirim oleh 44 mahasiswa selama periode tujuh minggu. Chatbot yang digunakan,\ndikenal sebagai Cipherbot, mencapai tingkat keberhasilan sebesar 82.5% dalam menjawab\npertanyaan siswa. Metrik kualitas interaksi menunjukkan bahwa dari 74 interaksi yang\ndievaluasi, 63.5% mendapatkan respons positif dari siswa.\nPenelitian oleh Cao (2023) tentang tantangan yang dihadapi model bahasa besar (LLM)\ndalam menangani skenario dialog yang kompleks, seperti konsultasi medis atau hukum.\nDataset yang digunakan disebut LLM-TOD, terdiri dari 20 skenario dialog tugas-oriented\ndalam berbagai topik, seperti restoran, rumah sakit, dan bank, yang dihasilkan oleh LLM dan\ndivalidasi oleh manusia. Model yang digunakan adalah multi-agent system berbasis LLM,\ndengan GPT-4 sebagai dasar dan diorganisir dalam beberapa modul, termasuk Topic Manager\ndan Chat Agent untuk pengelolaan dialog dan interaksi. Dalam evaluasi eksperimen kuantitatif,\nDiagGPT berhasil menyelesaikan semua tugas pada skenario dialog yang diuji, dengan kualitas\nrespons yang sebanding dengan GPT-4 dan menunjukkan efisiensi yang lebih tinggi dalam\nmenyelesaikan dialog task-oriented.\nPenelitian oleh Alan (2024) yang membahas tentang perancangan chatbot berbasis Large\nLanguage Model (LLM) untuk menjawab pertanyaan terkait agama Islam. Tantangan\nutamanya adalah kecenderungan LLM untuk menghasilkan informasi yang salah\n(hallucination) dan risiko memberikan respons yang tidak sesuai atau ofensif dalam konteks\nagama. Penelitian ini mengusulkan sistem Retrieval-Augmented Generation (RAG) untuk\nmeningkatkan akurasi dan transparansi dalam jawaban yang diberikan oleh LLM, khususnya\ndalam konteks pertanyaan yang sensitif dan membutuhkan referensi. Dataset terdiri dari\nbuku-buku sumber terbuka dalam bahasa Turki yang meliputi terjemahan dan tafsir Al-Quran\nserta literatur Islam lainnya. Sistem MufassirQAS menunjukkan hasil yang lebih baik dalam\nmemberikan jawaban yang lebih tegas dan relevan dibandingkan dengan ChatGPT pada\nbeberapa pertanyaan spesifik tentang Islam, meskipun hasil akurasi kuantitatif tertentu tidak\ndisebutkan secara eksplisit.\nPada penelitian (Touvron dkk., 2023), yang melakukan benchmark terhadap model-model\nclosed-source, menunjukkan bahwa GPT-4 mengungguli secara keseluruhan, terutama pada\nMMLU dengan nilai 86.4, GSM8K dengan nilai 92.0, dan HumanEval dengan nilai 57.0. Hal\nini dapat dilihat pada tabel berikut.\nTabel 1 Penilaian bencmark model LLM\nBerdasarkan penelitian yang telah dilakukan, penulis mengusulkan penerapan framework\nRetrieval-Augmented Generation (RAG) dan Large Language Model (LLM) untuk merancang\nchatbot customer service untuk LolosASN. Chatbot ini akan menggunakan dataset dari lebih\ndari 500 history chat whatsapp customer service dan panduan pengguna LolosASN. penulis\nmemberikan penelitian ini judul “ Implementasi Large Language Model (LLM) dan\nRatrieval-Augmented Generation (RAG) untuk Chatbot Customer Service LolosASN”\nPenelitian Terdahulu\nNo. Penulis Judul Tahun\nEnhancing Customer Service Automation\nAshok Kumar Reddy Sadhu,\nand User Satisfaction: An Exploration of\nMaksym Parfenov, Denis\n1. AI-powered Chatbot Implementation 2024\nSaripov, Maksim Muravev, &\nwithin Customer Relationship\nAmith Kumar Reddy\nManagement Systems\nJoni Salminen, Soon-gyo Jung,\nJohanne Medina, Kholoud Using Cipherbot: An Exploratory\n2. Aldous, Jinan Azem, Waleed Analysis of Student Interaction with an 2024\nAkhtar, dan Bernard J. Jansen LLM-Based Educational Chatbot\nMehran Shafique, Gohar\nA Comparative Analysis of AI Chatbot\n3. Mumtaz, Saleem Zubair 2024\nPerformance in IoT Environments\nAhmad, dan Sajid Iqbal\nDavid N. Sousa, Miguel A. Virtual Customer Service: Building your\n4. 2019\nBrito, dan Carlos Argainha Chatbot\nArtificial Intelligence (AI) Chatbot as\n5. Nuria Haristiani 2019\nLanguage Learning Medium: An inquiry\nEvolving the online customer experience.\nGraeme McLean a dan Alan\n6. Is there a role for online customer 2016\nWilson b\nsupport?\nI Gede Juanamasta, Ni Made\nNopita Wati, Erna Hendrawati,\nWiwin Wahyuni, Mira\nPramudianti, Nugrahini\nSusantinah Wisnujati, Anindya\nPrastiwi Setiawati, Susetyorini\nSusetyorini, Umi Elan, The Role Of Customer Service Through\nRusdiyanto Rusdiyanto, Denny Customer Relationship Management\n7. 2019\nAstanto, Bustanul Ulum, Susan (CRM) To Increase Customer Loyalty\nNovitasari Khadijah, Adrianto And Good Image\nTrimarjono, Mochamad Syafii,\nAbdullah Mubarroq,\nKristiningsih Kristiningsih,\nRita Dwi Pratiwi, Veri Veri,\nLusy Tunik Muharlisiani, M\nChairul Basrun Umanailo\nAnggun Tri Utami Br. Lubis, Question Answering System pada Chatbot\nNazruddin Safaat Harahap, Telegram Menggunakan Large Language\n8. 2024\nSurya Agustian, Muhammad Models (LLM) dan Langchain (Studi\nIrsyad, dan Iis Afrianty Kasus UU Kesehatan)\nAnbang Xu, Zhe Liu, Yufan\nA New Chatbot for Customer Service on\n9. Guo, Vibha Sinha, Rama 2017\nSocial Media\nAkkiraju\nAutomating Customer Support: A Study\n10. Vamsi Katragadda on The Efficacy of Machine 2023\nLearning-Driven Chatbots and Virtual\nRumusan Masalah Dalam memberikan layanan kepada pengguna, tim customer service LolosASN masih\nmenggunakan cara manual, di mana agen harus merespons setiap pertanyaan pengguna secara\nlangsung. Metode ini memiliki beberapa kelemahan, seperti waktu respons yang lambat,\nkebutuhan sumber daya manusia yang besar, serta risiko kesalahan akibat kelelahan atau\nketerbatasan agen. Hal ini dapat menyebabkan ketidakpuasan pengguna, terutama ketika\nmereka membutuhkan informasi atau bantuan dalam waktu singkat. Oleh karena itu,\ndiperlukan solusi alternatif berupa chatbot berbasis AI yang mampu mengotomatisasi layanan\ncustomer service, sehingga dapat menangani pertanyaan pengguna dengan respons yang cepat\ndan konsisten.\nMetodologi\nTahapan Penelitian:\nData Acquisition\nPada tahap ini, data dikumpulkan dari history chat customer service aplikasi LolosASN. Data\nyang dikumpulkan mencakup berbagai percakapan antara pengguna dan tim layanan\npelanggan, yang nantinya akan digunakan sebagai sumber pengetahuan bagi chatbot.\nPreprocessing\nData yang telah dikumpulkan selanjutnya diproses agar lebih mudah dipahami oleh model AI.\nTahapan preprocessing meliputi:\n● Labeling: Pemberian label pada data percakapan yang memisahkan pertanyaan\npengguna dan respons dari customer service.\n● Text Cleaning: Membersihkan data dari karakter yang tidak relevan, seperti simbol,\nangka, atau spasi berlebih.\n● Text Normalization: Mengubah kata-kata slang atau informal menjadi bentuk standar\nsesuai dengan KBBI agar lebih konsisten.\n● Case Folding: Mengonversi semua teks menjadi huruf kecil untuk menghindari\nperbedaan akibat penggunaan huruf besar dan kecil.\n● Tokenization: Memecah teks menjadi unit-unit kecil yang disebut token agar model\nlebih mudah memahami kata-kata dalam konteks percakapan.\nSplit Data\nSetelah melalui tahap preprocessing, data dibagi menjadi tiga bagian untuk keperluan\npelatihan dan evaluasi model. Pembagian data dilakukan dengan rasio tertentu, 60% untuk\ndata training, 20% untuk data validation, dan 20% untuk data testing.\nWord Embedding\nSetelah data di-split, proses embedding dilakukan menggunakan model LLM (Large Language\nModel) berbasis transformer seperti GPT atau BERT. Embedding ini mengubah teks menjadi\nrepresentasi vektor yang mencerminkan makna kata-kata dalam konteks tertentu, sehingga\nchatbot dapat memahami konteks pertanyaan pengguna.\nSimilarity Search\nSetelah embedding selesai, sistem melakukan pencarian kesamaan (similarity search) antara\npertanyaan pengguna dan potongan-potongan teks yang ada di knowledge base. Proses ini\nmembantu menemukan bagian teks yang paling relevan untuk menjawab pertanyaan\npengguna.\nQuestion Embeddings\nSaat pengguna mengajukan pertanyaan, sistem menghasilkan embedding untuk pertanyaan\ntersebut dan mencocokkannya dengan embedding dalam knowledge base menggunakan\nsimilarity search. Ini memungkinkan chatbot untuk menemukan jawaban yang paling relevan.\nModel (LLM)\nChatbot memanfaatkan Large Language Model (LLM) seperti GPT atau model sejenis untuk\nmemahami dan menghasilkan jawaban. Model ini dilatih menggunakan data dari LolosASN,\nsehingga dapat merespons pertanyaan dengan cara yang sesuai dan relevan bagi pengguna\naplikasi.\nRank Result\nHasil pencarian jawaban yang paling sesuai diurutkan berdasarkan tingkat kesesuaian. Sistem\nmemilih jawaban terbaik yang paling relevan untuk dikirimkan ke pengguna.\nOutput\nSetelah proses pencarian dan peringkat selesai, chatbot menampilkan jawaban yang telah\ndipilih kepada pengguna. Jawaban ini disampaikan dalam bentuk percakapan otomatis,\nsehingga pengguna dapat langsung menerima informasi atau bantuan yang diperlukan dalam\naplikasi LolosASN.\nReferensi Cao, L., 2023. Diaggpt: An llm-based chatbot with automatic topic management for\ntask-oriented dialogue. arXiv preprint arXiv:2308.08043.\nHaristiani, N., 2019, November. Artificial Intelligence (AI) chatbot as language learning\nmedium: An inquiry. In Journal of Physics: Conference Series (Vol. 1387, No. 1, p.\n012020). IOP Publishing.\nJuanamasta, I.G., Wati, N.M.N., Hendrawati, E., Wahyuni, W., Pramudianti, M., Wisnujati,\nN.S., Setiawati, A.P., Susetyorini, S., Elan, U., Rusdiyanto, R. and Muharlisiani, L.T.,\n2019. The role of customer service through customer relationship management (Crm) to\nincrease customer loyalty and good image. International Journal of Scientific and\nTechnology Research, 8(10), pp.2004-2007.\nKATRAGADDA, V., 2023. Automating Customer Support: A Study on The Efficacy of\nMachine Learning-Driven Chatbots and Virtual Assistants. IRE Journals, 7(1),\npp.600-601.\nLubis, A.T.U.B., Harahap, N.S., Agustian, S., Irsyad, M. and Afrianty, I., 2024. Question\nAnswering System pada Chatbot Telegram Menggunakan Large Language Models\n(LLM) dan Langchain (Studi Kasus UU Kesehatan): Question Answering System on\nTelegram Chatbot Using Large Language Models (LLM) and Langchain (Case Study:\nHealth Law). MALCOM: Indonesian Journal of Machine Learning and Computer\nScience, 4(3), pp.955-964.\nMcLean, G. and Wilson, A., 2016. Evolving the online customer experience… is there a role\nfor online customer support?. Computers in human behavior, 60, pp.602-610.\nNeumann, A.T., Yin, Y., Sowe, S., Decker, S. and Jarke, M., 2024. An LLM-Driven Chatbot in\nHigher Education for Databases and Information Systems. IEEE Transactions on\nEducation.\nSadhu, A.K.R., Parfenov, M., Saripov, D., Muravev, M. and Sadhu, A.K.R., 2024. Enhancing\nCustomer Service Automation and User Satisfaction: An Exploration of AI-powered\nChatbot Implementation within Customer Relationship Management Systems. Journal\nof Computational Intelligence and Robotics, 4(1), pp.103-123.\nSalminen, J., Jung, S.G., Medina, J., Aldous, K., Azem, J., Akhtar, W. and Jansen, B.J., 2024,\nJuly. Using Cipherbot: An Exploratory Analysis of Student Interaction with an\nLLM-Based Educational Chatbot. In Proceedings of the Eleventh ACM Conference on\nLearning@ Scale (pp. 279-283).\nShafique, M., Mumtaz, G., Ahmad, S.Z. and Iqbal, S., 2024. A Comparative Analysis of AI\nChatbot Performance in IoT Environments. Journal of Computing & Biomedical\nInformatics, 7(02).\nTarsani, T., 2017. PERAN CUSTOMER SERVICE DALAM MENINGKATKAN\nKEPUASAN PELANGGAN MELALUI PENDEKATAN KOMUNIKASI ANTAR\nPRIBADI (Studi Kasus pada Customer Service GraPARI Telkomsel Gandaria).\nBricolage: Jurnal Magister Ilmu Komunikasi, 2(01), pp.46-55.\nTouvron, H., Martin, L., Stone, K., Albert, P., Almahairi, A., Babaei, Y., Bashlykov, N., Batra,\nS., Bhargava, P., Bhosale, S. and Bikel, D., 2023. Llama 2: Open foundation and\nfine-tuned chat models. arXiv preprint arXiv:2307.09288.\nMedan, 19 November 2024\nMahasiswa yang mengajukan,\nDeza Banjarnahor\nNIM. 211402034",
  "similar_tokens": [
    "startup",
    "staf",
    "terap",
    "in",
    "tunggu",
    "langgan",
    "using",
    "support",
    "solusi",
    "tri",
    "latar",
    "angka",
    "utara",
    "ecommerce",
    "s",
    "asal",
    "an",
    "bersih",
    "urut",
    "citra",
    "analis",
    "v",
    "w",
    "teliti",
    "butuh",
    "penuh",
    "medan",
    "akurasi",
    "harap",
    "a",
    "mar",
    "alami",
    "dialog",
    "b",
    "label",
    "token",
    "efektivitas",
    "satisfaction",
    "manufaktur",
    "base",
    "sistem",
    "hindar",
    "fungsi",
    "ringkas",
    "batas",
    "e",
    "huruf",
    "komputer",
    "konteks",
    "skenario",
    "system",
    "spesifik",
    "search",
    "referensi",
    "skala",
    "d",
    "no",
    "sumber",
    "metode",
    "ambil",
    "konsultasi",
    "paham",
    "of",
    "m",
    "u",
    "baru",
    "tahu",
    "dampak",
    "efisiensi",
    "representasi",
    "teks",
    "hadap",
    "survei",
    "rancang",
    "y",
    "satu",
    "pilih",
    "lelah",
    "increase",
    "the",
    "dasar",
    "terjemah",
    "detik",
    "performance",
    "masuk",
    "learning",
    "pandu",
    "journal",
    "simulasi",
    "identifikasi",
    "sifat",
    "temu",
    "intelligence",
    "user",
    "siswa",
    "sebab",
    "wanita",
    "service",
    "manusia",
    "unggul",
    "rumah",
    "from",
    "ni",
    "banyak",
    "performa",
    "lebih",
    "positif",
    "kali",
    "algoritma",
    "jelas",
    "sama",
    "bangun",
    "as",
    "bentuk",
    "negeri",
    "keluh",
    "customer",
    "with",
    "medis",
    "mudah",
    "online",
    "tampil",
    "singkat",
    "masyarakat",
    "buat",
    "nilai",
    "guna",
    "fitur",
    "bisnis",
    "jurnal",
    "testing",
    "liu",
    "peran",
    "muka",
    "cermin",
    "p",
    "kenal",
    "metrik",
    "topik",
    "kompleks",
    "tulis",
    "your",
    "akibat",
    "skripsi",
    "et",
    "l",
    "minta",
    "tuju",
    "komunikasi",
    "health",
    "hubung",
    "sulit",
    "rutin",
    "jam",
    "n",
    "didik",
    "muhammad",
    "literatur",
    "materi",
    "analysis",
    "dkk",
    "research",
    "r",
    "program",
    "seleksi",
    "alam",
    "cari",
    "web",
    "islam",
    "informatics",
    "g",
    "optimal",
    "agama",
    "dukung",
    "model",
    "aspek",
    "robotics",
    "manfaat",
    "cipta",
    "capai",
    "machine",
    "probabilitas",
    "behavior",
    "chat",
    "kembang",
    "masalah",
    "manual",
    "tahap",
    "kolom",
    "ancang",
    "cerdas",
    "relevan",
    "al",
    "layan",
    "konversi",
    "series",
    "utama",
    "den",
    "respons",
    "google",
    "new",
    "kurang",
    "management",
    "and",
    "hasil",
    "informasi",
    "good",
    "prediksi",
    "pakai",
    "t",
    "pesan",
    "to",
    "cocok",
    "kirim",
    "banding",
    "international",
    "ai",
    "indonesia",
    "bahas",
    "fokus",
    "framework",
    "evaluasi",
    "pisah",
    "output",
    "kuat",
    "bantu",
    "lubis",
    "rasio",
    "h",
    "bank",
    "universitas",
    "br",
    "sehat",
    "aktif",
    "role",
    "surya",
    "pegawai",
    "perlu",
    "deep",
    "relationship",
    "through",
    "terima",
    "baik",
    "beri",
    "elemen",
    "usu",
    "pecah",
    "lingkung",
    "otomatis",
    "natural",
    "technology",
    "virtual",
    "kait",
    "standar",
    "interaksi",
    "ribu",
    "salah",
    "kualitas",
    "catat",
    "langsung",
    "konten",
    "sesuai",
    "beda",
    "judul",
    "cenderung",
    "respon",
    "percaya",
    "proses",
    "building",
    "information",
    "selesai",
    "daya",
    "eksplisit",
    "cakup",
    "sakit",
    "tabel",
    "on",
    "tujuh",
    "turun",
    "language",
    "artificial",
    "lambat",
    "skor",
    "bas",
    "operasional",
    "ukur",
    "data",
    "kelola",
    "wawancara",
    "dataset",
    "study",
    "ubah",
    "siap",
    "agen",
    "studi",
    "aju",
    "risiko",
    "foundation",
    "large",
    "rumus",
    "i",
    "j",
    "for",
    "platform",
    "alternatif",
    "implementation",
    "education",
    "uji",
    "transparansi",
    "result",
    "kerja",
    "utami",
    "computer",
    "tambah",
    "dekat",
    "implementasi",
    "mampu",
    "buruk",
    "buka",
    "tugas",
    "puas",
    "lemah",
    "metodologi",
    "text",
    "science",
    "atas",
    "tingkat",
    "mahasiswa",
    "open",
    "bagi",
    "at",
    "sumatera",
    "preferensi",
    "cepat",
    "bangkit",
    "kumpul",
    "is",
    "ilmu",
    "k",
    "aplikasi",
    "tangan",
    "computing",
    "menang",
    "usaha",
    "sedia",
    "dwi",
    "sensitif",
    "isi",
    "simbol",
    "milik",
    "media",
    "conference",
    "case",
    "historical",
    "ajar",
    "knowledge",
    "jenis",
    "martin",
    "liput",
    "bahasa",
    "tantang"
  ],
  "filename": "1751522371_EXUM_211402034.pdf",
  "user_id": 17
}