{
  "original_text": "FORM PENGAJUAN JUDUL\nNama : Febri Zuladhari Bangun\nNIM : 211402126\nJudul diajukan oleh* : Dosen\nMahasiswa\nBidang Ilmu (tulis dua bidang) : I n t e llig e n t S y=s tems dan Software Engineering\nUji Kelayakan Judul** : Diterima Ditolak\nHasil Uji Kelayakan Judul :\nCalon Dosen Pembimbing I: Dr. Baihaqi Siregar, ST.MT\nParaf Calon Dosen Pembimbing I\nCalon Dosen Pembimbing II: Dr. Sawaluddin M.IT\nMedan, 24 Februari 2025\nKa. Laboratorium Penelitian,\n* Centang salah satu atau keduanya (Fanindia Purnamasari, S.TI., M.IT.)\n** Pilih salah satu NIP. 198908172019032023\nRINGKASAN JUDUL YANG DIAJUKAN\n*Semua kolom di bawah ini diisi oleh mahasiswa yang sudah mendapat judul\nJudul / Topik Implementasi Sistem Chatbot Untuk Analisis Keluhan dan Rekomendasi Pengobatan\nSkripsi Berdasarkan Rekam Medis Pasien di Praktik Mandiri Bidan (PMB) Menggunakan\nIndoBERT\nLatar Belakang dan Latar Belakang\nPenelitian\nTerdahulu Perkembangan teknologi informasi telah mengubah berbagai sektor, salah satunya\nadalah sektor kesehatan. Menurut World Health Organization (2021), pentingnya untuk\nmenggunakan ekosistem digital dalam bidang kesehatan yang dapat dipergunakan oleh siapa\nsaja sebagai infrastrukur teknologi dalam perturakan data kesehatan yang lancar dan aman.\nIntegrasi teknologi dalam sektor kesehatan dapat meningkatkan efisiensi dan aksesbilitas\nlayanan terutama pada daerah terpencil. Di Indonesia sendiri, menurut Kementerian Kesehatan\nRI (2021), mencatat bahwa lebih dari 80% fasilitas pelayanan kesehatan saat ini belum\nmenggunakan teknologi digital, dimana data yang tersebar dan tersimpan di sektor kesehatan\nyang bervariasi sehingga mengalami kendala dalam manajemen rekam medis, pertukaran data\ndan respon cepat terhadap keluhan pasien.\nPraktik bidan sebagai garda terdepan dalam memberikan pelayanan kepada ibu dan\nanak untuk menekan angka kematian akibat kelahiran ataupun penyakit umum lainnya. Pada\npenelitian yang dilakukan oleh (Hasyim, 2024) pada Jurnal Kesehatan menyatakan bahwa\nperlunya peningkatan literasi di era digital dalam mengedukasi kesehatan masyarakat. Namun,\nterdapat beberapa tantangan utama yang dihadapi, di antaranya adalah keandalan informasi dan\nkesenjangan akses informasi. Jika tantangan yang dihadapi dapat dieksekusi dengan baik dan\nbenar, maka akan tercapai berbagai peluang besar terkait edukasi kesehatan di era digital. Salah\nsatu langkah yang dapat dilakukan untuk meningkatkan edukasi kesehatan adalah dengan cara\nkolaborasi antara profesional kesehatan dengan penggunaan teknologi. Hal ini menunjukkan\nperlu adanya penggunaan teknologi seperti kecerdasan buatan (artificial intelligence) dalam\nmendukung peningkatan edukasi tentang kesehatan ataupun membantu tenaga medis dalam\nmemberikan pelayanan kesehatan.\nPenggunaan Artificial Intelligence (AI) dapat menciptakan perubahan cara pandang\ndalam sektor kesehatan. Kemajuan dalam AI dapat membantu penyedia pelayanan kesehatan\nyang alih-alih menggantikan mereka, AI dan penyedia pelayanan kesehatan dapat\nberkolaborasi dengan saling melengkapi. Penggunaan AI dalam sektor kesehatan dapat\nmelengkapi dan meningkatkan keandalan penyedia layanan kesehatan, yang di mana pada\nakhirnya akan menciptakan peningkatan kualitas layanan dan sistem yang lebih efisien (Sezgin,\n2023). Implementasi AI dalam layanan kesehatan telah menunjukkan potensi yang menjanjikan\ndalam meningkatkan diagnosis, pengambilan keputusan dan peningkatan pelayanan (Kitsios et\nal., 2023). Salah satu bentuk penerapan AI yang kini tengah berkembang adalah penggunaan\nchatbot yang dapat memberikan layanan konsultasi awal, tersedia kapan saja dan dukungan\ninformasi kesehatan secara real-time (Clark & Bailey, 2024).\nDalam konteks ini, salah satu inovasi AI yang kini tengah berkembang adalah\npenggunaan chatbot. Menurut Laymouna et al. (2024), melakukan tinjauan terhadap 157 studi\nmengungkapkan bahwa 75 studi (47,8%) melaporkan bahwa penggunaan chatbot dapat\nmengurangi beban administratif dan finansial dalam sistem pelayanan kesehatan. Di sisi lain,\npenggunanan AI dalam sektor kesehatan dalam uji klinis mampu menangani data dalam jumlah\nyang besar dan menghasilkan hasil yang akurat diiringi dengan penggunaan basis data yang\nkaya dan kombinasi kata yang beragam (Kevin et al., 2023; Shaheen, 2021; Soufyane et al.,\n2021). Di Indonesia sendiri, implementasi chatbot medis masih terbatas, terutama yang\nmemanfaatkan Natural Language Processing (NLP) untuk bahasa Indonesia. Padahal, studi\nyang dilakukan oleh Imaduddin et al. (2023) pada jurnal Sentiment Analysis in Indonesian\nHealthcare Applications using IndoBERT Approach menunjukkan bahwa model NLP seperti\nIndoBERT yang digunakan dalam penelitiannya mampu mencapai skor akurasi 96% dalam\nmelakukan klasifikasi teks pada aplikasi kesehatan berbahasa Indonesia. Melihat hasil positif\ntersebut, integrasi algoritma IndoBERT ke dalam sistem chatbot memungkinkan menghadirkan\nlayanan yang lebih responsif dan personal. Dengan memanfaatkan kemampuan IndoBERT\ndalam memahami konteks bahasa Indonesia secara mendalam, chatbot kesehatan tidak hanya\ndapat mengidentifikasi keluhan calon pasien atau pasien dengan tepat, tetapi juga menyusun\nrekomendasi pengobatan yang relevan berdasarkan data rekam medis.\nModel NLP seperti IndoBERT sendiri merupakan model transformer pre-trained yang\ndikembangkan khusus untuk bahasa Indonesia dan memiliki kemampuan untuk memahami\nkonteks linguistik bahasa Indonesia (Wilie et al., 2020). Hal tersebut memberikan dasar yang\nkuat untuk mengintegrasikan IndoBERT ke dalam pengembangan chatbot kesehatan.\nPenelitian terkait implementasi chatbot menggunakan model BERT pernah dilakukan oleh\n(Babu & Boddu, 2024) pada jurnal BERT-Based Medical Chatbot: Enhancing Healthcare\nCommunication Through Natural Language Understanding. Penelitian tersebut\nmengimplementasikan BERT dalam chatbot kesehatan. Hasilnya menunjukkan bahwa\nalgoritma BERT yang digunakan mencapai accuracy score 98%. Tidak hanya itu, penelitian\nini juga membandingkan skor accuracy, precision, recall, dan F1 terhadap algoritma LSTM,\nSVM, BI-LTSM, dan BERT yang hasilnya adalah algoritma BERT cukup unggul untuk semua\nkondisi perbandingan dibandingkan algoritma lainnya.\nPenelitian oleh Fatonah et al. (2024) dalam jurnal Chatbot Edukasi Pra-Nikah berbasis\nTelegram Menggunakan Bidirectional Encoder Representations from Transformers (BERT),\nimplementasi model BERT dalam chatbot berbasis Telegram menunjukkan efektivitas yang\nsignifikan dalam memberikan edukasi pranikah secara real-time. Penelitian ini menemukan\nbahwa chatbot yang dikembangkan menggunakan model BERT memiliki akurasi Non-\nResponse-Rate sebesar 76,92%, dengan akurasi tertinggi mencapai 92% pada kategori tertentu.\nSelain itu, evaluasi menggunakan BERTScore menunjukkan bahwa chatbot ini mencapai nilai\nprecision sebesar 86%, recall 83%, dan F1-score 84%, yang mengindikasikan bahwa model\nini mampu memahami dan merespons pertanyaan pengguna dengan tingkat akurasi yang cukup\ntinggi. Keberhasilan ini menunjukkan bahwa penggunaan model NLP berbasis transformer,\nseperti BERT, dapat meningkatkan kualitas interaksi chatbot dalam memberikan informasi\nyang lebih akurat dan kontekstual kepada pengguna (Fatonah et al., 2024).\nKemudian penelitian yang dilakukan oleh Hafidz et al. (2024) dalam jurnal Chatbot\nModel Development Using BERT for West Sumatra Halal Tourism Information, pengembangan\nchatbot berbasis BERT telah menunjukkan akurasi tinggi dalam klasifikasi pertanyaan terkait\ninformasi pariwisata halal di Sumatra Barat. Dalam studi ini, chatbot dilatih menggunakan\n1.125 pertanyaan yang dikategorikan ke dalam sembilan label berbeda, dengan 80% data\ndigunakan untuk pelatihan dan 20% untuk evaluasi. Hasil penelitian menunjukkan bahwa\nmodel chatbot yang dikembangkan mencapai tingkat akurasi sebesar 96%, dengan precision\ndan recall rata-rata masing-masing 0,96. Dengan performa yang menjanjikan, penelitian ini\nmenyoroti potensi chatbot berbasis BERT untuk meningkatkan akses informasi pariwisata\nhalal, meskipun masih ada tantangan dalam optimalisasi klasifikasi pertanyaan tertentu (Hafidz\net al., 2024).\nPenelitian ini menjadi penting untuk diangkat karena dapat mengisi celah atau research\ngap antara potensi teknologi Natural Language Processing (NLP) berbasis IndoBERT dengan\nkebutuhan riil praktik bidan di Indonesia. Studi sebelumnya telah membuktikan keunggulan\nBERT dalam meningkatkan akurasi chatbot kesehatan. Namun, implementasi khusus untuk\nanalisis keluhan dan rekomendasi berbasis rekam medis pasien di praktik bidan menggunakan\nIndoBERT belum pernah dilakukan. Dengan mengintegrasikan rekam medis pasien, penelitian\nini tidak hanya meningkatkan responsivitas layanan bidan tetapi juga memastikan rekomendasi\nyang personal dan berbasis data historis. Selain itu, penelitian ini menjawab tantangan literasi\ndigital bidan dan pasien melalui sistem yang mudah diakses dan intuitif. Dengan demikian,\npenelitian ini tidak hanya berkontribusi pada percepatan transformasi digital kesehatan\nIndonesia tetapi juga mendukung target Sustainable Development Goals (SDGs) dalam\nmengurangi kesenjangan akses layanan kesehatan maternal. Berdasarkan penjelasan di atas\npenulis mengangkat judul “Implementasi Sistem Chatbot Untuk Analisis Keluhan dan\nRekomendasi Pengobatan Berdasarkan Rekam Medis Pasien di Praktik Mandiri Bidan (PMB)\nMenggunakan IndoBERT”.\nPenelitian Terdahulu\nNo. Penulis Judul Tahun\nBERT-Based Medical Chatbot: Enhancing\n1 Babu & Boddu Healthcare Communication 2024\nthrough Natural Language Understanding\nImplementation of BERT, IndoBERT, and\n2 Saadah et al. CNN-LSTM in Classifying Public Opinion 2022\nabout COVID-19 Vaccine in Indonesia\nChatbot Model Development Using BERT\n3 Hafidz et al. for West Sumatra Halal Tourism 2024\nInformation\nA BERT-Based Chatbot to Support Cancer\n4 Bappy et al. 2024\nTreatment Follow-Up\nClassification Performance Comparison of\n5 Budiman et al. BERT and IndoBERT on SelfReport of 2024\nCOVID-19 Status on Social Media\nChatbot Edukasi Pra-Nikah berbasis\nTelegram Menggunakan Bidirectional\n6 Fany et al. 2024\nEncoder Representations from Transformers\n(BERT)\nComparing BERT Against Traditional\nGarrido-Merchan\n7 Machine Learning Models in Text 2023\net al.\nClassification\nA Fine-Tuned BERT-Based Transfer\n8 Qasim et al. 2022\nLearning Approach for Text Classification\nOptimization Chatbot Services Based on\n9 Azmi et at. DNN-Bert for Mental Health of University 2024\nStudents\nRumusan Masalah Bidan memiliki peran penting dalam memberikan pelayanan kesehatan primer, terutama bagi\nibu dan anak. Namun, tantangan seperti keterbatasan tenaga medis, meningkatnya jumlah\npasien, serta keterbatasan waktu dalam memberikan edukasi dan konsultasi kesehatan sering\nkali menghambat pelayanan yang optimal. Dalam era digital saat ini, pemanfaatan teknologi\nkecerdasan buatan seperti chatbot dapat menjadi solusi inovatif untuk meningkatkan efisiensi\nlayanan bidan. Chatbot yang berbasis Natural Language Processing (NLP) memungkinkan\npasien untuk menyampaikan keluhan secara mandiri dan mendapatkan rekomendasi\npengobatan awal sebelum bertemu langsung dengan bidan. Dengan mengintegrasikan\nIndoBERT sebagai model NLP, chatbot diharapkan dapat memahami keluhan pasien dengan\nlebih akurat serta memberikan rekomendasi berdasarkan rekam medis pasien.\nMetodologi\nReferensi Babu, A., & Boddu, S. B. (2024). BERT-Based Medical Chatbot: Enhancing Healthcare\nCommunication through Natural Language Understanding. Exploratory Research in\nClinical and Social Pharmacy, 13. https://doi.org/10.1016/j.rcsop.2024.100419\nClark, M., & Bailey, S. (2024). Chatbots in Health Care: Connecting Patients to Information.\nCanadian Journal of Health Technologies, 4(1). https://doi.org/10.51731/cjht.2024.818\nFatonah, F. R., Maylawati, D. S., & Nurlatifah, E. (2024). Chatbot Edukasi Pra-Nikah\nberbasis Telegram Menggunakan Bidirectional Encoder Representations From\nTransformers (BERT). Jurnal Algoritma, 21(2), 29–40.\nhttps://doi.org/10.33364/algoritma/v.21-2.1657\nHafidz, I., Mukti, B. S., Naseela, Q. Z. I., Yudistira, A. D., Purnama, I. P. A. P. M., Ariyani,\nN. F., Astuti, H. M., & Tjahyanto, A. (2024). Chatbot Model Development Using BERT\nfor West Sumatera Halal Tourism Information. Halal Research Journal, 4(2), 117–131.\nhttps://doi.org/10.12962/j22759970.v4i2.1819\nHasyim, M. (2024). Tantangan dan Peluang Pendidikan Kesehatan di Era Digital:\nMembangun Kesadaran Kesehatan Online. Oshada; Jurnal Kesehatan, 1.\nhttps://doi.org/10.62872/zjb3re50\nImaduddin, H., A’la, F. Y., & Nugroho, Y. S. (2023). Sentiment Analysis in Indonesian\nHealthcare Applications using IndoBERT Approach. International Journal of Advanced\nComputer Science and Applications, 14(8).\nhttps://doi.org/10.14569/IJACSA.2023.0140813\nKementerian Kesehatan RI. (2021). Strategi Transformasi Digital Kesehatan 2024.\nKementerian Kesehatan Republik Indonesia. https://oss2.dto.kemkes.go.id/artikel-web-\ndto/Digital-Transformation-Strategy-2024.pdf\nKevin, B., VIkin, B., & Nair, M. (2023). BUILDING A CHATBOT FOR HEALTHCARE\nUSING NLP. TechRxiv. https://doi.org/10.36227/techrxiv.22578472.v1\nKitsios, F., Kamariotou, M., Syngelakis, A. I., & Talias, M. A. (2023). Recent Advances of\nArtificial Intelligence in Healthcare: A Systematic Literature Review. Applied Sciences,\n13(13). https://doi.org/10.3390/app13137479\nLaymouna, M., Ma, Y., Lessard, D., Schuster, T., Engler, K., & Lebouché, B. (2024). Roles,\nUsers, Benefits, and Limitations of Chatbots in Health Care: Rapid Review. Journal of\nMedical Internet Research, 26. https://doi.org/10.2196/56930\nSezgin, E. (2023). Artificial intelligence in healthcare: Complementing, not replacing, doctors\nand healthcare providers. DIGITAL HEALTH, 9, 1–5.\nhttps://doi.org/10.1177/20552076231186520\nShaheen, M. Y. (2021). Applications of Artificial Intelligence (AI) in healthcare: A review.\nScienceOpen. https://doi.org/10.14293/S2199-1006.1.SOR-.PPVRY8K.v1\nSoufyane, A., Abdelhakim, B. A., & Ahmed, M. Ben. (2021). An Intelligent Chatbot Using\nNLP and TF-IDF Algorithm for Text Understanding Applied to the Medical Field.\nSpringer, Cham, 3–10. https://doi.org/10.1007/978-3-030-53440-0_1\nWilie, B., Vincentio, K., Winata, G. I., Cahyawijaya, S., Li, X., Lim, Z. Y., Soleman, S.,\nMahendra, R., Fung, P., Bahar, S., & Purwarianti, A. (2020). IndoNLU: Benchmark and\nResources for Evaluating Indonesian Natural Language Understanding. Association for\nComputational Linguistics. http://arxiv.org/abs/2009.05387\nWorld Health Organization. (2021). Global Strategy on Digital Health 2020-2025. World\nHealth Organization. https://www.who.int/health-topics/digital-health\nMedan, 24 Februari 2025\nMahasiswa yang mengajukan,\n(Febri Zuladhari Bangun)\nNIM. 211402126",
  "similar_tokens": [
    "kait",
    "isi",
    "bantu",
    "masingmasing",
    "recent",
    "kendala",
    "science",
    "relevan",
    "mana",
    "sumatra",
    "sektor",
    "journal",
    "media",
    "bas",
    "akibat",
    "daerah",
    "lengkap",
    "manfaat",
    "beban",
    "angkat",
    "status",
    "et",
    "teliti",
    "historis",
    "research",
    "hasil",
    "kualitas",
    "informasi",
    "an",
    "kali",
    "konteks",
    "on",
    "referensi",
    "realtime",
    "users",
    "d",
    "butuh",
    "kombinasi",
    "simpan",
    "applied",
    "ri",
    "dalam",
    "teks",
    "hadir",
    "enhancing",
    "understanding",
    "sedia",
    "performa",
    "calon",
    "sumatera",
    "applications",
    "nama",
    "strategi",
    "mudah",
    "tingkat",
    "technologies",
    "kondisi",
    "review",
    "implementation",
    "responsif",
    "anak",
    "comparison",
    "susun",
    "aplikasi",
    "the",
    "batas",
    "tangan",
    "global",
    "dr",
    "medan",
    "s",
    "software",
    "andal",
    "mahasiswa",
    "social",
    "online",
    "studi",
    "positif",
    "optimal",
    "bidang",
    "ubah",
    "basis",
    "f",
    "manajemen",
    "praktik",
    "bentuk",
    "putus",
    "catat",
    "dosen",
    "inovasi",
    "peran",
    "satu",
    "covid",
    "salah",
    "aju",
    "febri",
    "n",
    "target",
    "sisi",
    "dasar",
    "medis",
    "lahir",
    "layan",
    "efisien",
    "beda",
    "about",
    "latih",
    "aman",
    "angka",
    "temu",
    "tinjau",
    "li",
    "i",
    "hadap",
    "nair",
    "akurat",
    "non",
    "p",
    "al",
    "ma",
    "transfer",
    "based",
    "ii",
    "integrasi",
    "janji",
    "signifikan",
    "kolom",
    "y",
    "kurang",
    "pilih",
    "fasilitas",
    "through",
    "ringkas",
    "klinis",
    "khusus",
    "engineering",
    "mit",
    "using",
    "respons",
    "respon",
    "tekan",
    "eksekusi",
    "unggul",
    "ambil",
    "b",
    "computer",
    "sakit",
    "no",
    "bahasa",
    "not",
    "tenaga",
    "health",
    "building",
    "literature",
    "capai",
    "bimbing",
    "kuat",
    "r",
    "h",
    "at",
    "tolak",
    "lapor",
    "topik",
    "bukti",
    "purnama",
    "alami",
    "identifikasi",
    "from",
    "a",
    "nilai",
    "rekomendasi",
    "university",
    "jurnal",
    "efektivitas",
    "sebar",
    "milik",
    "sciences",
    "nip",
    "k",
    "kembang",
    "information",
    "springer",
    "agam",
    "indonesian",
    "t",
    "barat",
    "solusi",
    "harap",
    "variasi",
    "uji",
    "centang",
    "kontribusi",
    "guna",
    "hambat",
    "implementasi",
    "form",
    "systematic",
    "akses",
    "in",
    "advances",
    "and",
    "cipta",
    "indonesia",
    "ganti",
    "sorot",
    "potensi",
    "ilmu",
    "sehat",
    "kategori",
    "langkah",
    "masyarakat",
    "judul",
    "buat",
    "skor",
    "z",
    "latar",
    "budiman",
    "rekam",
    "advanced",
    "healthcare",
    "interaksi",
    "international",
    "bangun",
    "q",
    "efisiensi",
    "skripsi",
    "e",
    "tantang",
    "banding",
    "era",
    "obat",
    "nugroho",
    "lancar",
    "paham",
    "sadar",
    "mandiri",
    "cepat",
    "tulis",
    "ratarata",
    "jelas",
    "langsung",
    "terap",
    "to",
    "terima",
    "rumus",
    "mampu",
    "siregar",
    "development",
    "kevin",
    "dukung",
    "g",
    "didik",
    "layak",
    "for",
    "m",
    "intelligent",
    "utama",
    "metodologi",
    "x",
    "pasien"
  ],
  "filename": "1751985841_Exum_211402126.pdf",
  "user_id": 17
}