{
  "original_text": "RINGKASAN JUDUL YANG DIAJUKAN\n*Semua kolom di bawah ini diisi oleh mahasiswa yang sudah mendapat judul\nJudul / Topik CHATBOT DIAGNOSA PENYAKIT KULIT PADA ANJING RUMAHAN\nSkripsi MENGGUNAKAN ALGORITMA LONG SHORT-TERM MEMORY DAN FUZZY\nSTRING MATCHING\nLatar Belakang Latar Belakang\ndan Penelitian Anjing merupakan salah satu tipe hewan yang setia dan memiliki kemampuan berkomunikasi\nTerdahulu\nyang baik dengan pemiliknya (Fitriani, 2007). Kesetiaan dan kecerdasan anjing menjadikannya\nsalah satu hewan yang banyak berinteraksi dengan manusia sebagai hewan peliharaan.\nBerdasarkan survei yang dilakukan oleh Rakuten Insight, anjing menduduki peringkat ke-4\nsebagai hewan yang banyak dipeliharan oleh masyarakat Indonesia. Menjadikan anjing sebagai\nhewan peliharaan tentunya harus memperhatikan kesehatan anjing tersebut. Salah satunya\ndengan menjaga kesehatan kulit anjing.\nKulit merupakan organ terbesar dalam tubuh anjing yang berfungsi sebagai pelindung tubuh dari\nberbagai jenis gangguan serta membantu mengatur suhu tubuh. Kondisi kulit pada anjing\nberpengaruh pada kondisi kesehatan pada tubuh anjing. Anjing rentan terhadap penyakit kulit\nyang dapat menyebabkan ketidaknyamanan bagi tubuh mereka. Selain itu, penyakit kulit yang\nbersifat zoonotik pada anjing ini juga dapat menular pada manusia dan sesama anjing lainnya.\nPenyakit kulit yang dapat ditularkan dari anjing ini termasuk kurap, kudis, dan impetigo.\nPenyakit ini dapat menyebabkan ruam kulit, gatal, hingga melepuh pada manusia. Oleh karena\nitu, penting untuk segera mengetahui penyakit kulit apa yang diderita oleh anjing tersebut dan\nmencari perawatan untuk mencegah penyebaran penyakit tersebut. Namun, tingginya minat\nmasyarakat dalam memiliki hewan peliharaan masih kurang didukung oleh pengetahuan akan\ncara pemeliharaan dan perawatan hewan tersebut, serta kurangnya sarana dan prasaran\npendukung seperti klinik dokter hewan yang mudah dijangkau mengakibatkan semakin sulitnya\nmasyarakat dalam mendapatkan bantuan untuk menangani masalah pada hewan peliharaan\nmereka.\nMelalui teknologi komputer saat ini dapat memudahkan para pemilik hewan peliharaan untuk\nmendeteksi penyakit kulit yang diderita anjing peliharaan mereka. Salah satu solusinya dengan\npenerapan teknolohi yang memungkinkan digunakan untuk mengatasi masalah tersebut adalah\nchatbot. Chatbot adalah sebuah kecerdasan buatan yang digunakan untuk melakukan dialog\ndengan manusia (Shawar & Atwell, 2002).\nPenelitian yang berkaitan dengan chatbot diagnosa penyakit hewan yang telah dilakukan,\ndiantaranya Diagnosa of Feline Skin Disease Using C4.5 Algotrhm (Triyanna et al, 2020).\nPenelitian ini mengembangkan chatbot yang digunakan untuk mendiagnosa penyakit kulit pada\nkucing dengan menggunakan algoritma C4.5. Penelitian ini menggunakan dataset yang didapat\ndari “Purple Shop” di Malang dengan jumlah 240 data. Penelitian ini mengklasifikasikan gejala\npenyakit kulit pada kucing dengan tingkat akurasi sebesar 95,43%, presisi debesar 96,93%, dan\nrecall sebesar 97,19%. Penelitian sebelumnya, Su et al. (2018) yang melakukan penelitian\ndengan judul “A Chatbot using LSTM-based Multi-layer Embedding for Elderly Care”.\nPenelitian ini menggunakan embedding multi-layer berbasis LSTM untuk memperoleh\ninformasi. Penelitian ini menggunakan dataset yang diambil dari dialog sehari-hari para lansia.\nTingkat akurasi model ini mencapai 76,96%. Penelitian lainnya berjudul Automated Thai-FAQ\nChatbot using RNN-LSTM (Muangkammuen et al. 2018). Penelitian ini mengembangkan\nchatbot untuk membantu e-commerce melakukan obrolan secara langsung dengan cepat dan\nnyaman dengan menggunakan RNN-LSTM. Tingkat akurasi yang didapat dari penelitian ini\nmencapai akurasi 86,36% untuk mengenali pertanyaan dan akurasi 93,2% untuk memberikan\njawaban. Selain itu ada juga penelitian, Anki et al. (2020) yang berjudul “Intelligent Chatbot\nAdapted from Question and Answer System Using RNN-LSTM Model”. Penelitian ini\nmenggunakan data pada program Cornell Movie Dialog Corpus yang merupakan Kumpulan\ndata berisi dialog fiksi yang diperoleh dari naskah film. Tingkat akurasi rata-rata yang didapat\ndari model ini sebesar 0,994869. Ganokatranaa et al. (2022) juga melakukan penelitan yang\nbertudul Decision Support System for Diagnosing Diseases in Dogs from Behaviors using Text\nMining Technique. Peneitian ini bertujuan untuk mengembangkan sistem pengambilan\nkeputusan untuk diagnosis penyakit pada anjing memalalui perilaku dengan menggunakan\nteknik text mining. Penelitian ini menghasilkan akurasi data dan diagnosis sebesar 80%.\nPenelitian lainnya berjudul Answering Islamic Question with a Chatbot using Fuzzy String-\nMatching Algorithm (Sihotang at al. 2020). Penelitian ini mengembangkan chabtbot yang\ndigunakan untuk menjawab pertanyaan yang berkaitan dengan hukum islam yang banyak\nberedar di internet. Tingkat akurasi yang didapat dari penelitian ini mencapai 70,37%. Selain\nintu ada juga penelitian, Adriyani at el. (2023) yang berjudul Improving University Community\nService Communication with Kukerti’s Fuzzy String Matching Chatbot. Penelitian ini bertujuan\nuntuk mengeksplorasi implementasi chatbot Kukerti menggunakan algoritma Fuzzy String\nMatching dalam program pelayanan masyarakat di Universitas Riau. Hasil penelitian ini\nmenunjukkan tingkat akurasi yang didapat melalui implementasi algoritma ini sebesar 93,33%.\nYunus at al. (2023) melakukan penelitian untuk membandingkan tingkat akurasi dari algoritma\nSupport Vectore Machine (SVM), Long Short-Term Memory (LSTM), Covolutional Neural\nNetwork (CNN), dan Recurrent Neural Network (RNN) untuk mengklasifikasikan data. Dimana\nSVM memiliki tingkat akurasi 98%, LSTM sebesar 97%, dan penggabungan model CNN dan\nRNN memiliki akurasi sebesar 96%. Hasil penelitian ini membuktikan bahwa SVM dan LSTM\nadalah algoritma yang sangat baik dalam mengklasifikasikan data. LSTM sendiri memiliki\nkeunggulan yaitu memiliki memori plot jangka panjang yang dapat digunakan untuk\nmempertahankan informasi dalam jangka waktu yang lama. Berdasarkan latar belakang dan\npenelitian di atas, penulis mengajukan penelitian yang berjudul “CHATBOT DIAGNOSA\nPENYAKIT KULIT PADA ANJING RUMAHAN MENGGUNAKAN ALGORITMA\nLONG SORT-TERM MEMORY (LSTM) DAN FUZZY STRING MATCHING”.\nPenelitian Terdahulu\nNo. Penulis Judul Tahun\nDiagnosa of Feline Skin Disease Using\n1. Triyanna et al, 2020\nC4.4 Algorthm\nMing-Hsiang Su A Chatbot using LSTM-based Multi-Layer\n2. 2018\net al. Embedding for Eldery Care\nMuangkammuen Automated Thai-FAQ Chatbot using RNN-\n3. 2018\net al LSTM\nIntelligent Chatbot Adapted from Question\n4. P Anki at al. 2020\nand System Using RNN-LSTM Model\nDecision Support System for Diagnosing\nT Ganokatranaa\n5. Diseases in Dogs from Behaviors using Text 2022\net al\nMining Technique\nAnswering Islamic Questiion with a Chatbot\n6. M Sihotang at al. 2020\nusing Fuzzy String-Matching Algorthm\nImproving University Community Service\n7. Y Adriyani at al Commnication with Kukerti’s Fuzzy String 2023\nMatching Chatbot\nRumusan Masalah Kurangnya pengetahuan akan cara merawat hewan peliharaan pada masyarakat Indonesia\nmenyebabkan masyarakat sulit untuk mendeteksi dini penyakit yang menyerang hewan\npeliharaan mereka. Salah satu penyakit yang rentan diderita oleh anjing peliharaan adalah\npenyakit kulit. Dampak dari penanganan yang terlambat akan penyakit tersebut dapat\nmenyebabkan penyebaran penyakit kepada sesama anjing dan manusia. Maka untuk membantu\nmendeteksi penyakit kulit pada anjing peliharaan dibutuhkan sebuah pendekatan yang dapat\nmembantu masyarakat mendiagnosa penyakit kulit pada anjing ini.\nMetodologi\nTahapan Penelitian:\n1. Collecting Dataset\nDataset yang digunakan dalam penelitian ini menggunakan dataset yang\ndikumpul secara manual melalui wawancara yang dilakukan terhadap dokter\nhewan. Adapun data yang dikumpulkan adalah beberapa jenis penyakit kulit\nyang sering dialami oleh anjing dan simptom yang ditunjukkan penyakit\ntersebut.\n2. Input\nTahap ini dilakukan dengan penginputan data yang sudah dikumpulkan\nsebelumnya. Data yang diinput pada tahap ini merupakan data dalam bentuk\n.cvs. Dimana input nantinya akan dibagi menjadi 2 yaitu data training dan\ndata testing\n3. Data Pre-processing\nPada tahap ini dilakukan pengubahan dataset yang tidak terstruktur\nmenjadi terstruktur.\n3.1 Case Folding\nPada tahap ini akan dilakukan konversi pada teks ke bentuk standar\ndengan menghilangkan perbedaan huruf kapital dan huruf kecil.\n3.2 Filtering\nPada tahap ini dilakukan penghapusan pungtuasi atau tanda baca yang\nada. Pengabaian pungtuasi akan memudahkan selama proses training.\n3.3 Stemming\nPada tahap ini dilakukan pemrosesan untuk menghilangkan afiks dari\nkata sehingga menghasilkan bentuk dasar kata.\n3.4 Padding\nPadding memiliki tujuan untuk mengubah setiap urutan angka agar\nmemiliki panjang yang sama. Proses ini sangat dibutuhkan agar pelatihan\nmodel bekerja secara konsisten.\n4. Word Embedding\nTahap ini merupakan teknik konversi teks untuk mengubah kata menjadi\nurutan angka. Tahap ini digunakan untuk memungkinkan model memahami\nmakna kata dan hubungan antar kata.\n5. Split Data\nPada tahap ini dataset yang akan dipisahkan menjadi data training\nsebanyak 80% dan data testing sebanyak 20%.\n6. Processing\nTahap ini merupakan pembuatan model dengan menerapkan Long Short-\nTerm Memory menggunakan data yang telah melewati tahap preprocessing.\n6.1 Embbeding Layer\nLapisan pertama ini digunakan untuk memetakan kata-kata dalam teks\nke dalam vector ruang.\n6.2 Dropout Layer\nLapisan selanjutnya adalah dropout layer yang digunakan untuk\nmencegah overfitting.\n6.3 LSTM Layer\nPada layer ini dilakukan penentuan hyperparameter untuk setiap layer\nLSTM. Hyperparameter yang digunakan adalah berapa jumlah unit\nneuron yang digunakan, rate dropout, dan recurrent dropout.\n6.4 Dense Layer\nLayer ini merupakan lapisan terakhir yang menggunakan fungsi aktivasi\nSoftmax.\n7. Penerapan Fuzzy String Matching\nSetelah melaui tahap pre-processing dan pelabelan menggunakan algoritma\nLSTM, dataset akan difilter untuk menampilkan output yang sesuai dengan\npencocokan pertanyaan menggunakaan algoritma Fuzzy String Matching.\nReferensi Andriyani, Y., Firyadi, R., Mahdiyah, E., Fitriansyah, A., Aminuddin, A., Meitarice, S.,\n& Niqotaini, Z. (2023). Improving University Community Service\nCommunication with Kukerti’s Fuzzy String Matching Chatbot. 2023\nInternational Conference on Informatics, Multimedia, Cyber and Informations\nSystem (ICIMCIS), 398–403.\nAnki, P., Bustaman, A., dan Sarwinda, D. 2020. Intelligent Chatbot Adapted from\nQuestion and Answer System Using RNN-LSTM Model.\nFitriani, H. 2007, Studi Kasus Leiomiosarkoma pada Anjing: Potensial Metastatik,\nSkripsi, Fakultas Kedokteran Hewan, Institut Pertanian Bogor\nGanokratanaa, T., Ketcham, M., Chumuang, N., Yimyam, W., Pramkeaw, P., & Pinthong,\nT. (2022). Decision support system for diagnosing diseases in dogs from\nbehaviors using text mining technique. International Conference on Cybernetics\nand Innovations, ICCI 2022. https://doi.org/10.1109/ICCI54995.2022.9744175\nKaraman, Y., Akdeniz, F., Savaş, B. K., & Becerikli, Y. (2023). A Comparative Analysis\nof SVM, LSTM and CNN-RNN Models for the BBC News Classification. 473–\n483. https://doi.org/10.1007/978-3-031-26852-6_44\nMuangkammuen, P., Intiruk, N., Saikaew, K. R. 2018. A Chatbot using LSTM-based\nMulti-layer Embedding for Elderly Care. 22nd International Computer Science\nand Engineering Conference(ICSEC). doi:10.1109/ICSES.2018.8712781\nSihotang, M. T., Jaya, I., Hizriadi, A., & Hardi, S. M. (2020). Answering Islamic\nQuestions with a Chatbot using Fuzzy String-Matching Algorithm. Journal of\nPhysics: Conference Series, 1566(1), 012007. https://doi.org/10.1088/1742-\n6596/1566/1/012007\nWidiyaningtyas, T., Made Wirawan, I., & Halimatus Mahmud, S. (2020). Diagnosis of\nFeline Skin Disease Using C4.5 Algorithm. 2020 Fifth International Conference\non Informatics and Computing (ICIC), 1–5.\nMedan, 04 April 2024\nMahasiswa yang mengajukan,\n(Febri Naomi Sofia Tammpubolon)\nNIM. 20142117",
  "similar_tokens": [
    "cari",
    "fuzzy",
    "sarana",
    "hilang",
    "satu",
    "network",
    "jaga",
    "awat",
    "machine",
    "akibat",
    "deteksi",
    "testing",
    "p",
    "data",
    "unggul",
    "islam",
    "su",
    "aju",
    "jenis",
    "duduk",
    "dekat",
    "capai",
    "malang",
    "lambat",
    "akurasi",
    "tulis",
    "dokter",
    "latih",
    "gejala",
    "memory",
    "langsung",
    "computer",
    "university",
    "w",
    "diagnosa",
    "ambil",
    "sebab",
    "conference",
    "nd",
    "diagnosis",
    "support",
    "svm",
    "alami",
    "pelihara",
    "survei",
    "hubung",
    "kait",
    "tinggi",
    "training",
    "program",
    "fungsi",
    "dukung",
    "ringkas",
    "beda",
    "sakit",
    "informasi",
    "vector",
    "mudah",
    "setia",
    "input",
    "topik",
    "studi",
    "banding",
    "dasar",
    "indonesia",
    "perhati",
    "referensi",
    "overfitting",
    "isi",
    "suhu",
    "f",
    "implementasi",
    "kembang",
    "pisah",
    "engineering",
    "perilaku",
    "informatics",
    "universitas",
    "teknik",
    "decision",
    "mahasiswa",
    "pengaruh",
    "hasil",
    "i",
    "kolom",
    "bagi",
    "milik",
    "system",
    "on",
    "gabung",
    "algoritma",
    "s",
    "nali",
    "proses",
    "atas",
    "cocok",
    "salah",
    "analysis",
    "unit",
    "label",
    "c",
    "metodologi",
    "standar",
    "besar",
    "putus",
    "rawat",
    "rentan",
    "from",
    "h",
    "interaksi",
    "tangan",
    "sehat",
    "paham",
    "konversi",
    "komputer",
    "lewat",
    "internet",
    "community",
    "manusia",
    "komunikasi",
    "al",
    "jangka",
    "bukti",
    "nim",
    "skripsi",
    "the",
    "baca",
    "ubah",
    "potensial",
    "teknologi",
    "jadi",
    "no",
    "sulit",
    "shop",
    "d",
    "adapted",
    "ganggu",
    "riau",
    "mining",
    "of",
    "dataset",
    "hardi",
    "minat",
    "bentuk",
    "journal",
    "manual",
    "rumus",
    "in",
    "nyaman",
    "bas",
    "n",
    "m",
    "kurang",
    "fakultas",
    "meta",
    "series",
    "z",
    "medan",
    "terap",
    "e",
    "a",
    "tampil",
    "intelligent",
    "rumah",
    "technique",
    "b",
    "tentu",
    "derita",
    "wawancara",
    "hapus",
    "latar",
    "tanda",
    "using",
    "sistem",
    "et",
    "memori",
    "term",
    "wirawan",
    "t",
    "solusi",
    "at",
    "sesuai",
    "angka",
    "tuju",
    "mampu",
    "struktur",
    "kumpul",
    "diinput",
    "with",
    "collecting",
    "peringkat",
    "service",
    "buat",
    "output",
    "communication",
    "and",
    "for",
    "sifat",
    "cegah",
    "bantu",
    "masyarakat",
    "cepat",
    "tahap",
    "y",
    "neural",
    "dialog",
    "layan",
    "science",
    "el",
    "klinik",
    "atur",
    "oleh",
    "international",
    "ruang",
    "rate",
    "k",
    "model",
    "lapis",
    "case",
    "mana",
    "kondisi",
    "sebar",
    "tahu",
    "r",
    "cerdas",
    "tingkat",
    "dampak",
    "urut",
    "cnn",
    "algorithm",
    "teliti",
    "tani",
    "judul",
    "butuh"
  ],
  "filename": "1751698967_1750790005_Exum_201402117.pdf",
  "user_id": 17
}