{
  "original_text": "FORM PENGAJUAN JUDUL\nNama : Kevin Tulus Ricardo Silitonga\nNIM : 201402051\nJudul diajukan oleh* : Dosen\n✓ Mahasiswa\nBidang Ilmu (tulis dua bidang) : 1 . D a ta S c i e n c e a =nd Intelligent System\n2. Computer Graphics and Vision\nUji Kelayakan Judul** : Diterima Ditolak\nFoto Terbaru\nHasil Uji Kelayakan Judul :\nCalon Dosen Pembimbing I: Sarah Purnamawati S.T., M.Sc\nParaf Calon Dosen Pembimbing I\n(Jika judul dari dosen maka dosen tersebut berhak menjadi pembimbing I)\nCalon Dosen Pembimbing II: Ivan Jaya, S.Si., M.Kom.\nMedan, 5 April 2024\nKa. Laboratorium Penelitian,\n* Centang salah satu atau keduanya (Fanindia Purnamasari, S.TI., M.IT.)\n** Pilih salah satu NIP. 198908172019032023\nRINGKASAN JUDUL YANG DIAJUKAN\n*Semua kolom di bawah ini diisi oleh mahasiswa yang sudah mendapat judul\nJudul / Topik Skripsi Klasifikasi Bencana Kekeringan di Jawa Timur Menggunakan Citra Satelit\nLandsat 8 Dengan Metode Random Forest\nLatar Belakang dan Latar Belakang\nPenelitian Terdahulu\nDefinisi kekeringan secara luas adalah kurangnya curah hujan dalam jangka waktu\nyang lama, biasanya satu musim atau lebih, yang mengakibatkan kekurangan air untuk\nbeberapa aktivitas, kelompok, atau sektor lingkungan (UN/ISDR & (UNISDR), 2007).\nBencana kekeringan dapat terjadi dikarenakan curah hujan yang sangat rendah, periode\npanjang tanpa hujan, atau kombinasi faktor-faktor seperti tingkat penguapan yang tinggi\ndan kondisi tanah yang kering. Kekeringan dapat mengakibatkan penurunan drastis dalam\nketersediaan air, baik untuk konsumsi manusia, pertanian, industri, maupun keperluan\nekologi.\nCitra satelit merupakan salah satu teknologi paling penting dalam pemantauan dan\npemetaan bumi dari jarak jauh. Citra satelit adalah gambar atau rekaman visual dari\npermukaan Bumi yang diambil oleh satelit buatan manusia yang mengorbit bumi. Citra-\ncitra ini dihasilkan oleh sensor optik yang terpasang pada satelit, yang mampu mendeteksi\ncahaya yang dipantulkan atau dipancarkan oleh permukaan bumi dalam berbagai panjang\ngelombang, mulai dari sinar tampak hingga inframerah. Citra-citra satelit bisa digunakan\nuntuk berbagai tujuan, mulai dari pemetaan dan pemantauan lingkungan, analisis\nperubahan lahan, pemantauan cuaca, hingga keperluan militer dan komersial.\nPenelitian sebelumnya yang berjudul Analisis Data Citra Landsat 8 OLI Sebagai\nIndeks Prediksi Kekeringan Menggunakan Machine Learning di Wilayah Kabupaten\nBoyolali dan Purworejo (Prasetyo et al., 2019). Dengan menggunakan dataset Landsat 8\nyang dimasukan ke dalam Machine Learning yang menggunakan metode XGBoost dan\nRandom Forest. Hasil penelitian menunjukan nilai akurasi 0.8286 dan Nilai Kappa 0.6477\ndari metode XGBoost dan nilai akurasi 0.6857 dan Nilai Kappa 0.3699 dari metode\nRandom Forest.\nPenelitian lainnya dengan judul Identifikasi Kekeringan Lahan Kabupaten\nLamongan Berdasarkan Citra Satelit (Noraini et al., 2022). Penelitian ini menggunakan\ndataset Landsat 8 yang diolah menggunakan algoritma NDWI dan NDVI untuk\nmendapatkan nilai indeks NDDI. Hasil penelitian ini menunjukkan kekeringan lahan di\nKabupaten Lamongan didominasi sebesar 62,14% atau 1.097,087 Km2 dengan tingkat\nklasifikasi kekeringan berat dari seluruh total area.\nPada penelitian Klasifikasi Tutupan Lahan Pada Citra Sentinel-2 Kabupaten\nKuningan Dengan NDVI Dan Algoritme Random Forest (Marlina, 2022). Citra satelit\nyang digunakan adalah citra satelit sentinel-2. Klasifikasi tutupan lahan yang diterapkan\npada penelitian ini terdiri dari empat kelas yaitu badan air, bangunan, lahan kosong,\npertanian, dan vegetasi. Hasil overall accuracy pada algoritma random forest bernilai\n91,39% dan nilai kappa 0,88.\nPenelitian lainnya judul Satellite imagery and machine learning for aridity\ndisaster classification using vegetation indices (Prasetyo et al., 2020). Dengan\nmenggunakan citra satelit Landsat 8, Penelitian ini mencoba memprediksi bencana\nkekeringan provinsi Jawa Tengah menggunakan K-Nearest Neighbour (K-NN), Random\nForest (RF), dan Support Vector Machine (SVM). Data satelit dipreprocessing untuk\nmenghasilkan NDVI, SAVI, VHI, TCI, dan VCI kemudian dibagi 70% training data dan\n30% testing data. Dari penelitian ini ditemukan hasil akurasi K-Nearest Neighbour sebesar\n92.03%, akurasi Support Vector Machine sebesar 96% dan Random Forest sebesar 91%.\nPenelitian sebelumnya yang berjudul Drought Monitoring using MODIS derived\nindices and Google Earth Engine Platform (Samet AKSOY et al., 2019). Dengan\nmenggunakan dataset yang didapat dari MODIS sensor, diolah untuk mendapatkan\nNormalized Difference Drought Index (NDDI), Vegetation Health Index (VHI), dan\nNormalized Multi-Band Drought Index (NMDI). Hasil penelitian ini menunjukkan bahwa\nKetepatan peta kondisi kekeringan NMDI lebih rendah dibandingkan dengan peta indeks\nlainnya dan Peta VHI menunjukkan peta kondisi kekeringan yang lebih baik dibandingkan\ndengan VCI.\nPenelitian Terdahulu\nNo. Penulis Tahun Metode Keterangan\n1. Prasetyo, et. 2019 XGBoost dan Memprediksi risiko bencana\nal. Random kekeringan menggunakan metode\nForest XGBoost dan Random Forest dan\ndataset dari satelit Landsat 8. Hasil\npenelitian menunjukan nilai akurasi\n0.8286 dari metode XGBoost dan\nnilai akurasi 0.6857 dari metode\nRandom Forest.\n2. Noraini, et. al. 2022 Normalized Mengidentifikasi lahan kekeringan\nDifference menggunakan dataset satelit\nIndex Water, Landsat 8. Dataset diolah untuk\nNormalized mendapatkan NDWI, NDVI,\nDifference NDDI. Hasil penelitian ini\nIndex menunjukkan kekeringan lahan di\nVegetation Kabupaten Lamongan didominasi\ndan sebesar 62,14% atau 1.097,087\nNormalized Km2 dengan tingkat klasifikasi\nDifference kekeringan berat dari seluruh total\nDrought area.\nIndeks\n3. Dwi Marlina. 2022 Random Penelitian ini melakukan klasifikasi\nForest tutupan lahan menggunakan citra\nsatelit Landsat 8. Dengan\nmenggunakan Algoritma Random\nForest, data di bagi ke dalam empat\nklasifikasi. Hasil overall accuracy\npada algoritma random forest\nbernilai 91,39% dan nilai kappa\n0,88.\n4. Prasetyo, et. 20202 K-Nearest Memprediksi bencana kekeringan\nal. Neighbor, provinsi Jawa Tengah\nRandom menggunakan K-Nearest\nForest, Neighbour (K-NN), Random Forest\nSupport (RF), dan Support Vector Machine\nVector (SVM). Data satelit\nMachine dipreprocessing kemudian dibagi\n70% training data dan 30% testing\ndata. Dari penelitian ini ditemukan\nhasil akurasi K-Nearest Neighbour\nsebesar 92.03%, akurasi Support\nVector Machine sebesar 96% dan\nRandom Forest sebesar 91%.\n5. Aksoy, et. al. 2019 Normalized Penelitian ini memonitor kondisi\nDifference kekeringan yang terjadi di Turki\nDrought dalam periode dua puluh tahun\nIndex, menggunakan citra satelit MODIS.\nVegetation Data citra satelit MODIS diolah\nHealth Index untuk mendapatkan NDDI, VHI\ndan dan NMDI. Hasil penelitian ini\nNormalized menunjukkan bahwa Ketepatan\nMulti-Band peta kondisi kekeringan NMDI\nDrought Index lebih rendah dibandingkan dengan\npeta indeks lainnya dan Peta VHI\nmenunjukkan peta kondisi\nkekeringan yang lebih baik\ndibandingkan dengan VCI.\nRumusan Masalah Bencana kekeringan merupakan bencana yang memberikan dampak berkurangnya air\nbersih, merusak tanaman pangan dan hancurnya ekosistem lingkungan yang terjadi di area\nyang sangat luas dalam waktu yang sangat lama. Oleh karena itu diperlukan pemantauan\npola kekeringan sehingga dapat memberikan informasi yang tepat kepada masyarakat dan\npihak berwenang untuk mengurangi kerugian dengan mengantisipasi kekeringan dan\nmemitigasi dampak sosial, ekonomi, dan lingkungan yang diakibatkan oleh bencana\nkekeringan.\nMetodologi\nPenelitian ini melewati beberapa tahapan dalam pemrosesan berdasarkan metode yang\ndigunakan. Tahap pertama dimulai dengan mengumpulkan citra satelit yang kana\ndigunakan pada penelitian ini. Setelah data telah terkumpul, data tersebut masuk ke dalam\ntahap preprosesing. Pada tahap ini dilakukan koreksi atmosferik yang menghapus\npengaruh atmosferik, koreksi geometrik dan radiometrik yang bertujuan mencocokan\nposisi citra dengan koordinat geografi dan koreksi dasar citra yang dilakukan untuk\nmenghilangkan noise akibat dari distorsi cahaya matahari, filtering untuk menentukan\nuntuk menentukan tanggal citra satelit diambil beserta area yang diteliti (Area of Interest),\ndan ekstraksi data band yang akan digunakan. Tahap selanjutnya adalah kombinasi band\nuntuk mendapat indeks NDVI, VHI, TCI, VCI, SAVI. Setelah itu data training akan dilatih\ndengan metode Random Forest dan menghasilkan learning model. Kemudian data\ndiklasifikasi menjadi tiga kategori bencana kekeringan. Dan terakhir perhitungan akurasi\nhasil dan menghasilkan output peta bencana kekeringan yang sudah diklasifikasi.\nReferensi Marlina, D. (2022). Klasifikasi Tutupan Lahan pada Citra Sentinel-2 Kabupaten\nKuningan dengan NDVI dan Algoritme Random Forest. STRING (Satuan Tulisan\nRiset Dan Inovasi Teknologi), 7(1), 41. https://doi.org/10.30998/string.v7i1.12948\nNoraini, A., Tjahjadi, M. E., & Sudiasa, I. N. (2022). Identifikasi Kekeringan Lahan\nKabupaten Lamongan Berdasarkan Citra Satelit. Buletin Poltanesa, 23(1), 335–\n340. https://doi.org/10.51967/tanesa.v23i1.958\nPrasetyo, S. Y. J., Christianto, Y. B., & Hartomo, K. D. (2019). Analisis Data Citra\nLandsat 8 OLI Sebagai Indeks Prediksi Kekeringan Menggunakan Machine\nLearning di Wilayah Kabupaten Boyolali dan Purworejo. Indonesian Journal of\nModeling and Computing, 2(2), 25–36.\nhttps://ejournal.uksw.edu/icm/article/view/2954\nPrasetyo, S. Y. J., Hartomo, K. D., Paseleng, M. C., Chandra, D. W., & Winarko, E.\n(2020). Satellite imagery and machine learning for aridity disaster classification\nusing vegetation indices. Bulletin of Electrical Engineering and Informatics, 9(3),\n1149–1158. https://doi.org/10.11591/eei.v9i3.1916\nSamet AKSOY, Ozge GORUCU, & Elif SERTEL. (2019). 2019 the Eighth International\nConference on Agro-Geoinformatics : July 16-19, Istanbul, Turkey. 8th\nInternational Conference on Agro-Geoinformatics (Agro-Geoinformatics), 1–6.\nUN/ISDR, & (UNISDR), U. N. secretariat of the I. S. for D. R. (2007). Drought Risk\nReduction, Framework and Practices, Contributing to the Implementation of the\nHyogo Framework for Action, Preliminary Version, May 2007. May, 97.\nMedan, 5 April 2024\nMahasiswa yang mengajukan,\n(Kevin Tulus Ricardo Silitonga)\nNIM. 201402051",
  "similar_tokens": [
    "jarak",
    "engine",
    "cocok",
    "algoritma",
    "w",
    "medan",
    "machine",
    "deteksi",
    "gelombang",
    "bumi",
    "skripsi",
    "nd",
    "dwi",
    "nip",
    "layak",
    "latar",
    "dosen",
    "informatics",
    "ringkas",
    "accuracy",
    "hasil",
    "terima",
    "c",
    "muka",
    "metodologi",
    "teliti",
    "buat",
    "nilai",
    "model",
    "analisis",
    "rusak",
    "turun",
    "msc",
    "computer",
    "to",
    "ekosistem",
    "satu",
    "nila",
    "manusia",
    "dampak",
    "conference",
    "ubah",
    "d",
    "implementation",
    "form",
    "identifikasi",
    "tulis",
    "computing",
    "referensi",
    "mahasiswa",
    "olah",
    "industri",
    "wenang",
    "perlu",
    "j",
    "using",
    "sarah",
    "mkom",
    "monitoring",
    "u",
    "akibat",
    "al",
    "rendah",
    "uji",
    "akurasi",
    "k",
    "laboratorium",
    "chandra",
    "and",
    "learning",
    "tunjuk",
    "ekstraksi",
    "for",
    "kombinasi",
    "bidang",
    "no",
    "informasi",
    "hapus",
    "kelompok",
    "masyarakat",
    "hilang",
    "output",
    "ambil",
    "disaster",
    "terang",
    "r",
    "kategori",
    "indeks",
    "pola",
    "total",
    "temu",
    "n",
    "tani",
    "bersih",
    "kurang",
    "matahari",
    "antisipasi",
    "random",
    "bagi",
    "ka",
    "sosial",
    "topik",
    "berat",
    "tanggal",
    "m",
    "puluh",
    "kabupaten",
    "peta",
    "support",
    "bimbing",
    "kondisi",
    "km",
    "curah",
    "th",
    "data",
    "tingkat",
    "tentu",
    "b",
    "baru",
    "st",
    "posisi",
    "i",
    "a",
    "engineering",
    "luas",
    "aktivitas",
    "practices",
    "pasang",
    "timur",
    "lahan",
    "rekam",
    "pemrosesan",
    "riset",
    "ilmu",
    "vector",
    "rugi",
    "jawa",
    "pantau",
    "tuju",
    "journal",
    "lingkung",
    "pengaruh",
    "testing",
    "kumpul",
    "ekonomi",
    "e",
    "sinar",
    "coba",
    "citra",
    "tutup",
    "air",
    "lewat",
    "geografi",
    "system",
    "meta",
    "koordinat",
    "terap",
    "tanah",
    "metode",
    "on",
    "reduction",
    "cuaca",
    "provinsi",
    "teknologi",
    "bangun",
    "kelas",
    "the",
    "kering",
    "musim",
    "kosong",
    "tahap",
    "dasar",
    "badan",
    "salah",
    "uap",
    "rumus",
    "aju",
    "s",
    "judul",
    "y",
    "platform",
    "visual",
    "pilih",
    "sektor",
    "ssi",
    "health",
    "bencana",
    "wilayah",
    "framework",
    "hujan",
    "prediksi",
    "hitung",
    "sedia",
    "definisi",
    "foto",
    "svm",
    "dataset",
    "centang",
    "gambar",
    "area",
    "international",
    "of",
    "masuk",
    "banding",
    "kolom",
    "jangka",
    "risiko",
    "index",
    "ii",
    "serta",
    "inovasi",
    "nama",
    "kevin",
    "google",
    "isi",
    "et",
    "water"
  ],
  "filename": "1751599013_Exum_201402051.pdf",
  "user_id": 17
}