{
  "original_text": "Universitas Sumatera Utara Alamat\nJalan Universitas No. 9 Email: fasilkomti@usu.ac.id\nFAKULTAS ILMU KOMPUTER DAN TEKNOLOGI INFORMASI\nKampus USU, Medan Telepon: (061) 8213793\nPROGRAM STUDI S-1 TEKNOLOGI INFORMASI 20155\nFORM PENGAJUAN JUDUL\nNama : Andre Gozali\nNIM : 211402100\nJudul diajukan oleh* : Dosen\n\nMahasiswa\n Data Science and Intelligent Systems\nBidang Ilmu (tulis dua bidang) : =\n Machine Learning\nUji Kelayakan Judul** : Diterima Ditolak\nHasil Uji Kelayakan Judul :\nCalon Dosen Pembimbing I:\nSeniman S.Kom., M.Kom\nCalon Dosen Pembimbing II:\nFahrurrozi Lubis, B.IT., M.Sc.IT\nMedan, ......................................\nKa. Laboratorium Penelitian,\n* Centang salah satu atau keduanya (Fanindia Purnamasari, S.TI., M.IT)\n** Pilih salah satu NIP. 198908172019032023\nUniversitas Sumatera Utara Alamat\nJalan Universitas No. 9 Email: fasilkomti@usu.ac.id\nFAKULTAS ILMU KOMPUTER DAN TEKNOLOGI INFORMASI\nKampus USU, Medan Telepon: (061) 8213793\nPROGRAM STUDI S-1 TEKNOLOGI INFORMASI 20155\nRINGKASAN JUDUL YANG DIAJUKAN\n*Semua kolom di bawah ini diisi oleh mahasiswa yang sudah mendapat judul\nJudul / Topik IMPLEMENTASI DEEP LEARNING DENGAN BIDIRECTIONAL LSTM DAN\nSkripsi FASTTEXT UNTUK IDENTIFIKASI KOMENTAR JUDI ONLINE PADA MEDIA\nSOSIAL\nLatar Belakang Latar Belakang\ndan Penelitian Perkembangan teknologi digital telah membawa berbagai perubahan signifikan dalam\nTerdahulu kehidupan masyarakat, salah satunya dalam bentuk perjudian online. Menurut KBBI, arti kata\n\"judi\" adalah permainan dengan memakai uang atau barang berharga sebagai taruhan. Judi\nonline adalah aktivitas perjudian yang dilakukan melalui internet, di mana pemain dapat bertaruh\npada berbagai jenis permainan seperti poker, mesin slot, dan permainan kasino. Kemudahan\nakses melalui berbagai platform digital menjadikan judi online semakin diminati, terutama oleh\nindividu yang mencari keuntungan instan. Namun, dampak negatif dari fenomena ini tidak bisa\ndiabaikan. Judi online telah menyebabkan banyak kasus kecanduan, kerugian finansial, serta\nmasalah sosial yang berkepanjangan (Juhara et al., 2025).\nMenteri Koordinator Bidang Politik dan Keamanan (Menko Polkam), Budi Gunawan,\nmenyatakan bahwa Indonesia saat ini berada dalam kondisi darurat judi online (judol), dengan\n8,8 juta masyarakat terlibat sebagai pemain dan total perputaran uang mencapai Rp900 triliun.\nIa menegaskan bahwa situasi ini sudah sangat meresahkan dan mengkhawatirkan, terutama\nkarena mayoritas pemain berasal dari kalangan menengah ke bawah. Berdasarkan data yang\ndiungkapkan dalam konferensi pers di Gedung Kementerian Komunikasi dan Digital (Komdigi),\nJakarta, pada 21 November 2024, judi online telah menjangkiti berbagai lapisan masyarakat,\ntermasuk 97.000 anggota TNI/Polri, 1,9 juta pegawai swasta, dan bahkan 80.000 anak di bawah\nusia 10 tahun. Pernyataan ini semakin memperkuat urgensi dalam memberantas judi online, yang\ntelah berkembang pesat di Indonesia dan menimbulkan dampak ekonomi serta sosial yang luas.\nSejumlah penelitian telah dilakukan untuk mengidentifikasi dan analisis sentimen terkait judi\nonline. Namun, tren komentar judi online sekarang ini banyak mengalami perubahan dengan\nsedikit mengandung keyword terkait judi online yaitu komentar yang menggunakan berbagai\nteknik seperti modifikasi kata, penggunaan kombinasi angka dan huruf, serta simbol tertentu\nmembentuk pola nama brand (merk), vendor (penyedia), dan situs web untuk menghindari filter\nberbasis kata kunci. Metode filter berbasis kata kunci sederhana sudah tidak lagi efektif, karena\npelaku judi online terus beradaptasi dengan sistem deteksi yang ada.\nBeberapa penelitian telah dilakukan untuk menganalisis sentimen dan klasifikasi teks terkait judi\nonline di media sosial. Sebuah studi oleh Antonius et al. (2024) menggunakan Support Vector\nMachine (SVM) dan Synthetic Minority Oversampling Technique (SMOTE) untuk\nmengklasifikasikan opini masyarakat tentang pemblokiran judi online. Hasil penelitian\nmenunjukkan bahwa SVM mampu mencapai akurasi 61.84%, namun masih mengalami\nkesulitan dalam menangani distribusi kata yang tidak seimbang dalam komentar negatif dan\npositif.\nSelain itu, penelitian Febrian As Shidiq et al., (2025) menggunakan Naïve Bayes dan SVM untuk\nanalisis sentimen terkait judi online di media sosial X (Twitter). Studi ini menemukan bahwa\nSVM memiliki akurasi lebih tinggi (83%) dibandingkan dengan Naïve Bayes (79%),\nmenunjukkan bahwa metode berbasis vektor seperti SVM lebih efektif dalam\nUniversitas Sumatera Utara Alamat\nJalan Universitas No. 9 Email: fasilkomti@usu.ac.id\nFAKULTAS ILMU KOMPUTER DAN TEKNOLOGI INFORMASI\nKampus USU, Medan Telepon: (061) 8213793\nPROGRAM STUDI S-1 TEKNOLOGI INFORMASI 20155\nmengklasifikasikan opini masyarakat. Namun, pendekatan ini masih terbatas dalam menangkap\nkonteks dan variasi bahasa dalam komentar, sehingga diperlukan model berbasis deep learning\nseperti Bidirectional LSTM untuk meningkatkan akurasi deteksi.\nPendekatan berbasis NLP seperti TF-IDF dan Naïve Bayes juga telah digunakan dalam\npenelitian sebelumnya untuk menganalisis sentimen publik terkait judi online. Studi oleh Julianti\net al. (2024) menunjukkan bahwa penggunaan TF-IDF dalam kombinasi dengan Naïve Bayes\nmampu mencapai akurasi sebesar 76% dalam klasifikasi komentar judi online di Twitter.\nNamun, keterbatasan utama dari metode ini adalah tidak mampu dalam menangkap hubungan\nantar kata dalam suatu kalimat, yang membuatnya kurang optimal dalam mendeteksi komentar\ndengan pola kalimat yang lebih kompleks.\nBerdasarkan penelitian terdahulu, penulis mengusulkan penerapan algoritma Bidirectional\nLSTM dan FastText untuk identifikasi komentar judi online pada media sosial. Penelitian ini\nakan mengembangkan model deteksi apakah komentar mengandung narasi (sentimen) judi\nonline, brand, vendor dan situs web terkait judi online menggunakan Bidirectional LSTM dan\nFastText. Model ini akan diuji dengan dataset komentar dari media sosial, yang akan melalui\ntahap preprocessing, embedding dengan FastText, serta klasifikasi menggunakan Bidirectional\nLSTM. Penulis memberi penelitian ini dengan judul “Implementasi Deep Learning Dengan\nBidirectional LSTM Dan FastText Untuk Identifikasi Komentar Judi Online Pada Media\nSosial”.\nContoh data komentar yang mengandung judi online dan brand judi online\nUniversitas Sumatera Utara Alamat\nJalan Universitas No. 9 Email: fasilkomti@usu.ac.id\nFAKULTAS ILMU KOMPUTER DAN TEKNOLOGI INFORMASI\nKampus USU, Medan Telepon: (061) 8213793\nPROGRAM STUDI S-1 TEKNOLOGI INFORMASI 20155\nPenelitian Terdahulu\nNo. Penulis Judul Tahun\nPENERAPAN NATURAL LANGUAGE\nOkta Nur Julianti,\nPROCESSING PADA ANALISIS\n1. Nana Suarna, 2024\nSENTIMEN JUDI ONLINE DI MEDIA\nWilly Prihartono\nSOSIAL TWITTER\nANALISIS SENTIMEN MASYARAKAT\nM Febrian As TERHADAP KASUS JUDI ONLINE\n2. Shidiq, Debby MENGGUNAKAN DATA DARI MEDIA 2025\nAlita SOSIAL X PENDEKATAN NAIVE\nBAYES DAN SVM\nAji Dewo Analisis Sentimen Terkait Judi Online di\n3. Pangestu, Lailan Media Sosial Instagram Menggunankan 2025\nSofinah Harahap Naïve Bayes\nANALISIS SENTIMEN OPINI PUBLIK\nTERKAIT JUDI ONLINE PADA\nAndrea Maulana, PENGGUNA APLIKASI X\n4. 2024\nAde Yuliana MENGGUNAKAN ALGORITMA NAÏVE\nBAYES DAN SUPPORT VECTOR\nMECHINE\nKOMPARASI ALGORITMA NAÏVE\nDwi Nanda\nBAYES, RANDOM FOREST, DAN\n5. Agustia, Ryan 2025\nLOGISTIC REGRESION UNTUK\nRandy Suryono\nANALISIS SENTIMEN JUDI ONLINE\nUniversitas Sumatera Utara Alamat\nJalan Universitas No. 9 Email: fasilkomti@usu.ac.id\nFAKULTAS ILMU KOMPUTER DAN TEKNOLOGI INFORMASI\nKampus USU, Medan Telepon: (061) 8213793\nPROGRAM STUDI S-1 TEKNOLOGI INFORMASI 20155\nRobert Antonius,\nPendekatan TF-IDF, SMOTE, dan SVM\nAchmad Rizky\n6. dalam Klasifikasi Sentimen Masyarakat 2024\nZulkarnain, Hafiz\nterhadap Pemblokiran Judi Online\nIrsyad\nHermawan Comparison of Support Vector Machine\n7. Syahputra, Aldiva (SVM) and Random Forest Algorithm for 2023\nWibowo Detection of Negative Content on Websites\nPenelitian yang dilakukan oleh Julianti et al., (2024), menganalisis sentimen masyarakat\nterhadap judi online di Twitter menggunakan metode Natural Language Processing (NLP) dan\nalgoritma Naïve Bayes. Pelabelan data dilakukan dengan menggunakan Metode lexicon. Dataset\nterdiri dari 952 tweet, diklasifikasikan menjadi positif (7.7%), netral (16.5%), dan negatif\n(75.8%). Pembobotan dilakukan dengan menggunakan TF-IDF dengan 70% data training, dan\n30% data testing. Model Naïve Bayes mencapai akurasi 76%, dengan precision 58% dan recall\n76% dengan data uji sebanyak 666 dan data latih sebanyak 286. Hasil menunjukkan bahwa\nsebagian besar opini masyarakat terhadap judi online bersifat negatif.\nPenelitian yang dilakukan oleh Febrian As Shidiq et al., (2025), menganalisis sentimen\nmasyarakat terhadap judi online di media sosial X (Twitter) menggunakan Naïve Bayes dan\nSVM. Dataset berisi 2.866 tweet, dikategorikan menjadi positif dan negatif tanpa sentimen\nnetral. Pelabelan data dilakukan dengan menggunakan Metode lexicon. Tahap uji terbagi\nmenjadi 30% data testing dan 70% data training, dilakukan dengan fungsi perhitungan confusion\nmatrix. Model SVM lebih akurat (83%) dibanding Naïve Bayes (79%), dengan performa lebih\nbaik dalam mengklasifikasikan sentimen negatif dan positif.\nPenelitian yang dilakukan oleh Dewo Pangestu & Sofinah Harahap, (2025), menganalisis\nsentimen publik terhadap judi online di Instagram menggunakan Naïve Bayes. Dataset berisi\n1.033 komentar, yang setelah preprocessing diklasifikasikan menjadi 50% negatif, 25% positif,\ndan 25% netral. Pelabelan data diklasifikasikan menjadi positif, negatif dan netral. Data dibagi\nmenjadi data latih sebesar 80% dan data uji 20%. Model Naïve Bayes digunakan untuk\nklasifikasi, dengan hasil akurasi 66,7%, precision 100%, recall 50%, dan F1-score 66,7%.\nPenelitian ini menunjukkan bahwa Naïve Bayes efektif untuk analisis sentimen, tetapi\nakurasinya masih dapat ditingkatkan dengan dataset yang lebih besar.\nPenelitian yang dilakukan oleh Maulana & Yuliana, (2024), menganalisis sentimen publik\nterhadap judi online di X (Twitter) menggunakan Naïve Bayes dan SVM. Dataset terdiri dari\n630 komentar, yang setelah preprocessing diklasifikasikan menjadi positif, negatif, dan netral.\nModel SVM lebih akurat (98%) dibanding Naïve Bayes (93%), dengan performa lebih baik\ndalam klasifikasi sentimen negatif dan positif.\nPenelitian yang dilakukan oleh Agustia & Suryono, (2025), membandingkan Naïve Bayes,\nRandom Forest, dan Logistic Regression untuk analisis sentimen judi online menggunakan\ndataset 4592 komentar dari Twitter. Data dikategorikan sebagai sentimen positif, negatif, dan\nnetral. Data diseimbangkan menggunakan SMOTE, dan fitur diekstraksi menggunakan TF-IDF.\nData dibagi sebesar 80% untuk training dan 20% untuk testing. Hasilnya, Random Forest\nUniversitas Sumatera Utara Alamat\nJalan Universitas No. 9 Email: fasilkomti@usu.ac.id\nFAKULTAS ILMU KOMPUTER DAN TEKNOLOGI INFORMASI\nKampus USU, Medan Telepon: (061) 8213793\nPROGRAM STUDI S-1 TEKNOLOGI INFORMASI 20155\nmemberikan performa terbaik dengan akurasi 78%, diikuti oleh Naïve Bayes dan Logistic\nRegression yang masing-masing mencapai akurasi 77%. Teknik SMOTE meningkatkan deteksi\nsentimen minoritas, tetapi menurunkan precision. Penelitian ini menyoroti pentingnya teknik\nSMOTE dalam meningkatkan performa algoritma pada dataset yang tidak seimbang.\nPenelitian yang dilakukan oleh Robert Antonius et al., (2024), menganalisis sentimen\nmasyarakat terhadap pemblokiran judi online di YouTube menggunakan TF-IDF, SMOTE, dan\nSVM. Dataset terdiri dari 1.315 komentar, yang diklasifikasikan menjadi positif, negatif, dan\nnetral. Data dipisahkan menjadi data latih dan data uji dengan takar 80:20. Data diberi bobot\ndengan TF-IDF, lalu diratakan kelas antar sentimennya dengan SMOTE. Model SVM mencapai\nakurasi 61.84% dengan F1-score 0.7590.\nPenelitian yang dilakukan oleh Syahputra & Wibowo, (2023), membandingkan SVM dan\nRandom Forest dalam mendeteksi konten negatif (fraud, judi, dan pornografi) di website.\nDataset terdiri dari 2628 teks yang dibagi 70% training dan 30% testing. Data diklasifikasikan\nmenjadi fraud, gambling, pornography and Whitelist. Preprocessing mencakup TF-IDF,\nstopword removal, dan tokenisasi. Hasilnya, SVM memiliki akurasi lebih tinggi dengan 97%\naccuracy, 90% precision, 91% recall dan F1 90%, dibanding Random Forest dengan 92%\naccuracy, 77% precision, 86% recall dan F1 76%. Penelitian ini menunjukkan bahwa SVM lebih\nefektif dalam dalam mendeteksi konten negatif di situs web berbahasa Indonesia dibandingkan\nRandom Forest.\nRumusan Masalah Perkembangan teknologi telah mendorong peningkatan aktivitas perjudian online yang\nmeresahkan masyarakat. Media sosial sering dimanfaatkan sebagai sarana untuk\nmempromosikan perjudian online melalui komentar yang tersebar luas. Hal ini dapat\nmempengaruhi pengguna media sosial yang rentan terhadap ajakan tersebut. Upaya manual\nuntuk mendeteksi dan menghapus komentar promosi judi online merupakan tantangan besar\nkarena data yang banyak dan kecepatan penyebarannya. Selain itu, komentar sering\nmenggunakan bahasa atau kode tertentu untuk menghindari deteksi, sehingga menyulitkan\nidentifikasi secara manual. Oleh karena itu, perlu adanya pendekatan otomatis yang efektif untuk\nmendeteksi komentar yang mengandung promosi judi online di media sosial. Pendekatan ini\ndiharapkan dapat membantu dalam upaya pencegahan penyebaran dan melindungi pengguna\nmedia sosial dari dampak negatif perjudian online.\nUniversitas Sumatera Utara Alamat\nJalan Universitas No. 9 Email: fasilkomti@usu.ac.id\nFAKULTAS ILMU KOMPUTER DAN TEKNOLOGI INFORMASI\nKampus USU, Medan Telepon: (061) 8213793\nPROGRAM STUDI S-1 TEKNOLOGI INFORMASI 20155\nMetodologi\nData Collection\nTahapan pertama yaitu mengumpulkan data komentar yang akan dianalisis untuk\nmengidentifikasi apakah mengandung unsur judi online atau tidak melalui YouTube\ndengan teknik web scraping. Data dikumpulkan dalam file berekstensi .csv\nData preprocessing\nData preprocessing dimulai dengan labeling, hal ini dilakukan pada setiap komentar. 1\nuntuk komentar yang mengandung judi dan 0 untuk komentar yang tidak mengandung\njudi. Text cleaning, yaitu menghapus karakter khusus, tanda baca, angka, emoji, serta\nelemen yang tidak relevan. Case folding, yaitu mengubah semua huruf menjadi huruf kecil\nuntuk konsistensi. Contoh: \"Judi Online\" menjadi \"judi online\". Stopword removal, untuk\nmenghapus kata-kata umum yang tidak memiliki makna signifikan. Contoh: \"dan\", \"di\",\n\"ke\", dll. Tokenization, yaitu memecah teks menjadi kata-kata atau token agar dapat\ndiproses oleh model.\nUniversitas Sumatera Utara Alamat\nJalan Universitas No. 9 Email: fasilkomti@usu.ac.id\nFAKULTAS ILMU KOMPUTER DAN TEKNOLOGI INFORMASI\nKampus USU, Medan Telepon: (061) 8213793\nPROGRAM STUDI S-1 TEKNOLOGI INFORMASI 20155\nSplit Data\nData yang telah di preprocessing kemudian dibagi menjadi 3 jenis data, yaitu data training,\nvalidation, dan testing. Perbandingan data yang digunakan adalah 70% data training, 15%\ndata validation, dan 15% data testing.\nWord Embedding dengan FastText\nFastText digunakan untuk mengubah teks menjadi vektor numerik. FastText bekerja\ndengan subword embedding, yang memungkinkan model memahami kata-kata baru atau\nkata-kata yang memiliki bentuk yang bervariasi.\nBidirectional Long Short-Term Memory (Bi-LSTM)\nSetelah data dikonversi menjadi vektor, model Bidirectional LSTM digunakan untuk\nmemproses data teks secara forward dan backward. Bidirectional LSTM dapat menangkap\nkonteks kata sebelum dan setelahnya dalam suatu kalimat. Bidirectional LSTM membantu\nmodel membedakan komentar yang benar-benar mengandung unsur judi dari komentar\nyang hanya mengandung kata-kata serupa tetapi tidak terkait perjudian.\nLearned Model\nModel sudah mempelajari pola-pola yang ada pada data training dan dapat digunakan\nuntuk mengidentifikasi komentar (apakah itu komentar judi atau bukan).\nModel Evaluation\nSetelah model dilatih menggunakan Bidirectional LSTM, dilakukan evaluasi\nmenggunakan metrik seperti akurasi, precision, recall, dan F1-score. Confusion Matrix\njuga digunakan untuk melihat seberapa baik model dalam membedakan komentar judi dan\nbukan judi.\nModel Implementation\nSetelah model dievaluasi dan bekerja dengan baik, kemudian model akan diterapkan\ndalam sistem untuk mengidentifikasi komentar. Di sini, model akan digunakan pada\nYouTube untuk memprediksi apakah komentar baru yang diterima oleh sistem\nberhubungan dengan judi atau tidak. Jika model mendeteksi bahwa komentar mengandung\nkonten judi online, komentar tersebut akan langsung dihapus secara otomatis. Dengan\nmenggunakan API YouTube, sistem dapat menghapus komentar yang terdeteksi\nmengandung judi online, memastikan komentar yang tidak sesuai dengan kebijakan\nYouTube dihapus dalam waktu singkat.\nOutput\nOutput adalah klasifikasi komentar, yaitu komentar judi mengandung brand, vendor, situs\nweb judi online dan bukan komentar judi. Bentuk akhir dari penelitian ini, penulis\nberencana untuk membuat sebuah bot pada YouTube yang dapat membantu menghapus\nkomentar yang mengandung judi online pada video pengguna secara otomatis, sehingga\ndapat mengurangi promosi judi online.\nUniversitas Sumatera Utara Alamat\nJalan Universitas No. 9 Email: fasilkomti@usu.ac.id\nFAKULTAS ILMU KOMPUTER DAN TEKNOLOGI INFORMASI\nKampus USU, Medan Telepon: (061) 8213793\nPROGRAM STUDI S-1 TEKNOLOGI INFORMASI 20155\nReferensi Agung, A., Dyanggi, M. C., Agus, W., Darma, S., Nyoman, N., & Sastaparamitha, A. J. (2024).\nFastText and Bi-LSTM for Sentiment Analysis of Tinder Application Reviews. JURNAL\nILMIAH MERPATI, 12(1).\nAgustia, D. N., & Suryono, R. R. (2025). COMPARISON OF NAÏVE BAYES, RANDOM\nFOREST, AND LOGISTIC REGRESSION ALGORITHMS FOR SENTIMENT\nANALYSIS ONLINE GAMBLING. JURNAL INOVTEK POLBENG, 10(1), 2025.\nAmalia, J., Matondang, D. F., Hutajulu, G. E. M., & Hasibuan, A. (2024). Impact Of Sarcasm\nDetection on Sentiment Analysis Using Bi-LSTM and FastText. Jurnal Sistem Informasi\nBisnis, 14(4), 353–362. https://doi.org/10.21456/vol14iss4pp353-362\nAndika, A. J., Kristian, Y., & Setiawan, E. I. (2023). Deteksi Komentar Cyberbullying Pada\nYouTube Dengan Metode Convolutional Neural Network – Long Short-Term Memory\nNetwork (CNN-LSTM). Teknika, 12(3), 183–188.\nhttps://doi.org/10.34148/teknika.v12i3.677\nAzahra, N. M., & Setiawan, E. B. (2023). Sentence-Level Granularity Oriented Sentiment\nAnalysis of Social Media Using Long Short-Term Memory (LSTM) and IndoBERTweet\nMethod. Jurnal Ilmiah Teknik Elektro Komputer Dan Informatika, 9(1), 85–95.\nhttps://doi.org/10.26555/jiteki.v9i1.25765\nDewo Pangestu, A., & Sofinah Harahap, L. (2025). Analisis Sentimen Terkait Judi Online di\nMedia Sosial Instagram Menggunankan Naïve Bayes. IJEDR: Indonesian Journal of\nEducation and Development Research.\nFebrian As Shidiq, M., Alita, D., & Ratu Kec Kedaton Kota Bandar Lampung, L. (2025).\nANALISIS SENTIMEN MASYARAKAT TERHADAP KASUS JUDI ONLINE\nMENGGUNAKAN DATA DARI MEDIA SOSIAL X PENDEKATAN NAIVE BAYES\nDAN SVM. Jurnal Sistem Informasi Dan Informatika (Simika), 8(1).\nForry Kusuma, J., & Chowanda, A. (2023). Indonesian Hate Speech Detection Using\nIndoBERTweet and BiLSTM on Twitter. www.joiv.org/index.php/joiv\nHendrawan, A., & Sela, E. I. (2024). Analisis Sentimen Komentar Youtube Tentang Resesi\nGlobal 2023 Menggunakan LSTM. Jurnal Indonesia : Manajemen Informatika Dan\nKomunikasi, 5(1), 587–593. https://doi.org/10.35870/jimik.v5i1.526\nJuhara, N. F., Amalia, M., & Mulyana, A. (2025). Efektivitas Penegakan Hukum terhadap Judi\nOnline di Indonesia: Analisis Yuridis dan Sosiologis ARTICLE HISTORY. Journal of\nContemporary Law Studies, 2, 153–164. https://doi.org/10.47134/lawstudies.v2i2.3353\nJulianti, O. N., Suarna, N., & Prihartono, W. (2024). PENERAPAN NATURAL LANGUAGE\nPROCESSING PADA ANALISIS SENTIMEN JUDI ONLINE DI MEDIA SOSIAL\nTWITTER. In Jurnal Mahasiswa Teknik Informatika (Vol. 8, Issue 3).\nKeya, A. J., Kabir, M. M., Shammey, N. J., Mridha, M. F., Islam, M. R., & Watanobe, Y. (2023).\nG-BERT: An Efficient Method for Identifying Hate Speech in Bengali Texts on Social\nMedia. IEEE Access, 11, 79697–79709. https://doi.org/10.1109/ACCESS.2023.3299021\nKhairani, U., Mutiawani, V., & Ahmadian, H. (2024). Pengaruh Tahapan Preprocessing Terhadap\nModel Indobert Dan Indobertweet Untuk Mendeteksi Emosi Pada Komentar Akun Berita\nInstagram. Jurnal Teknologi Informasi Dan Ilmu Komputer, 11(4), 887–894.\nhttps://doi.org/10.25126/jtiik.1148315\nKristine Angelina Simanjuntak, Muhamad Koyimatu, Yolla Putri Ervanisari, & Tasmi. (2024).\nIdentifikasi Opini Publik Terhadap Kendaraan Listrik dari Data Komentar YouTube:\nPemodelan Topik Menggunakan BERTopic. TEMATIK, 11(2), 195–203.\nhttps://doi.org/10.38204/tematik.v11i2.2096\nLee, E., Rustam, F., Washington, P. B., Barakaz, F. El, Aljedaani, W., & Ashraf, I. (2022).\nRacism Detection by Analyzing Differential Opinions Through Sentiment Analysis of\nTweets Using Stacked Ensemble GCR-NN Model. IEEE Access, 10, 9717–9728.\nhttps://doi.org/10.1109/ACCESS.2022.3144266\nMaulana, A., & Yuliana, A. (2024). ANALISIS SENTIMEN OPINI PUBLIK TERKAIT JUDI\nONLINE PADA PENGGUNA APLIKASI X MENGGUNAKAN ALGORITMA NAÏVE\nBAYES DAN SUPPORT VECTOR MECHINE. Jurnal Informatika Dan Teknik Elektro\nTerapan, 12(3S1). https://doi.org/10.23960/jitet.v12i3S1.5187\nUniversitas Sumatera Utara Alamat\nJalan Universitas No. 9 Email: fasilkomti@usu.ac.id\nFAKULTAS ILMU KOMPUTER DAN TEKNOLOGI INFORMASI\nKampus USU, Medan Telepon: (061) 8213793\nPROGRAM STUDI S-1 TEKNOLOGI INFORMASI 20155\nMolero, J. M., Perez-Martin, J., Rodrigo, A., & Penas, A. (2023). Offensive Language Detection\nin Spanish Social Media: Testing from Bag-of-Words to Transformers Models. IEEE\nAccess, 11, 95639–95652. https://doi.org/10.1109/ACCESS.2023.3310244\nMullah, N. S., & Zainon, W. M. N. W. (2021). Advances in Machine Learning Algorithms for\nHate Speech Detection in Social Media: A Review. In IEEE Access (Vol. 9, pp. 88364–\n88376). Institute of Electrical and Electronics Engineers Inc.\nhttps://doi.org/10.1109/ACCESS.2021.3089515\nObaid, M. H., Guirguis, S. K., & Elkaffas, S. M. (2023). Cyberbullying Detection and Severity\nDetermination Model. IEEE Access, 11, 97391–97399.\nhttps://doi.org/10.1109/ACCESS.2023.3313113\nOryngozha, N., Shamoi, P., & Igali, A. (2024). Detection and Analysis of Stress-Related Posts in\nReddit’s Acamedic Communities. IEEE Access, 12, 14932–14948.\nhttps://doi.org/10.1109/ACCESS.2024.3357662\nPratama, A., & Rosyda, M. (2025). Analisis Sentimen dalam Aplikasi X terhadap Pengungsi\nRohingya dengan LSTM. SKANIKA: Sistem Komputer Dan Teknik Informatika, 8(1), 95.\nRamos, G., Batista, F., Ribeiro, R., Fialho, P., Moro, S., Fonseca, A., Guerra, R., Carvalho, P.,\nMarques, C., & Silva, C. (2024). Leveraging Transfer Learning for Hate Speech Detection\nin Portuguese Social Media Posts. IEEE Access, 12, 101374–101389.\nhttps://doi.org/10.1109/ACCESS.2024.3430848\nRiza, M. A., & Charibaldi, N. (2021). Emotion Detection in Twitter Social Media Using Long\nShort-Term Memory (LSTM) and Fast Text. International Journal of Artificial Intelligence\n& Robotics (IJAIR), 3(1), 15–26. https://doi.org/10.25139/ijair.v3i1.3827\nRizwan, M., Mushtaq, M. F., Akram, U., Mehmood, A., Ashraf, I., & Sahelices, B. (2022).\nDepression Classification From Tweets Using Small Deep Transfer Learning Language\nModels. IEEE Access, 10, 129176–129189.\nhttps://doi.org/10.1109/ACCESS.2022.3223049\nRobert Antonius, Zulkarnain, A. R., & Irsyad, H. (2024). Pendekatan TF-IDF, SMOTE, dan\nSVM dalam Klasifikasi Sentimen Masyarakat terhadap Pemblokiran Judi Online. Buletin\nIlmiah Informatika Teknologi, 2(3), 115–122. https://doi.org/10.58369/biit.v2i3.65\nSapto Nugroho, A., & Nugroho, K. (2025). Comparing RNN and LSTM Algorithms with\nFastText Embeddings for Sentiment Analysis on Educational Platforms. Jurnal Dan\nPenelitian Teknik Informatika, 9(1). https://doi.org/10.33395/sinkron.v9i1.14296\nSetiawan, J. C., M. Lhaksmana, K., & Bunyamin, B. (2023). Sentiment Analysis of Indonesian\nTikTok Review Using LSTM and IndoBERTweet Algorithm. JIPI (Jurnal Ilmiah\nPenelitian Dan Pembelajaran Informatika), 8(3), 774–780.\nhttps://doi.org/10.29100/jipi.v8i3.3911\nSyahputra, H., & Wibowo, A. (2023). Comparison of Support Vector Machine (SVM) and\nRandom Forest Algorithm for Detection of Negative Content on Websites. Jurnal Ilmiah\nTeknik Elektro Komputer Dan Informatika, 9(1), 165–173.\nhttps://doi.org/10.26555/jiteki.v9i1.25861\nTriyadi, I., Prasetiyo, B., & Nikmah, T. L. (2023). News text classification using long-term short\nmemory (LSTM) algorithm. Journal of Soft Computing Exploration.\nMedan, ......................................\nMahasiswa yang mengajukan,\n(Andre Gozali)\n211402100",
  "similar_tokens": [
    "kombinasi",
    "alamat",
    "development",
    "evaluasi",
    "sumatera",
    "technique",
    "kode",
    "putri",
    "konten",
    "as",
    "an",
    "bijak",
    "individu",
    "s",
    "issue",
    "tanda",
    "and",
    "bidang",
    "nama",
    "fungsi",
    "education",
    "angka",
    "dorong",
    "positif",
    "rugi",
    "hindar",
    "utama",
    "mesin",
    "juta",
    "hukum",
    "konsistensi",
    "usul",
    "otomatis",
    "arti",
    "modifikasi",
    "terima",
    "barang",
    "alami",
    "harga",
    "ringkas",
    "asal",
    "judul",
    "skripsi",
    "kunci",
    "kalang",
    "kbbi",
    "h",
    "bas",
    "lubis",
    "aju",
    "lee",
    "f",
    "sulit",
    "libat",
    "sebar",
    "singkat",
    "distribusi",
    "beda",
    "wibowo",
    "sarana",
    "y",
    "file",
    "isi",
    "skom",
    "pecah",
    "v",
    "tengah",
    "negatif",
    "telah",
    "in",
    "capai",
    "usu",
    "satu",
    "using",
    "tangan",
    "platform",
    "untung",
    "harahap",
    "sedia",
    "manfaat",
    "mahasiswa",
    "with",
    "pers",
    "hasil",
    "i",
    "al",
    "anggota",
    "review",
    "kelas",
    "hafiz",
    "temu",
    "aplikasi",
    "turun",
    "tahap",
    "putar",
    "darurat",
    "timbul",
    "jadi",
    "identifikasi",
    "to",
    "form",
    "bagi",
    "l",
    "rumus",
    "websites",
    "referensi",
    "berita",
    "uji",
    "pilih",
    "through",
    "a",
    "bantu",
    "bentuk",
    "utara",
    "nugroho",
    "j",
    "anak",
    "universitas",
    "bot",
    "swasta",
    "kompleks",
    "collection",
    "baca",
    "situasi",
    "dasar",
    "fakultas",
    "pratama",
    "prediksi",
    "global",
    "jip",
    "konteks",
    "akun",
    "ratu",
    "transfer",
    "budi",
    "bawa",
    "bahasa",
    "kuat",
    "website",
    "tulis",
    "elemen",
    "oriented",
    "calon",
    "guna",
    "cepat",
    "kategori",
    "bobot",
    "from",
    "angelina",
    "panjang",
    "milik",
    "tantang",
    "o",
    "k",
    "online",
    "aji",
    "nim",
    "banding",
    "signifikan",
    "akurat",
    "dekat",
    "analis",
    "topik",
    "manajemen",
    "layak",
    "b",
    "nip",
    "impact",
    "laboratorium",
    "relevan",
    "medan",
    "et",
    "baik",
    "w",
    "httpsdoiorgjipivi",
    "achmad",
    "method",
    "institute",
    "kumpul",
    "main",
    "kurang",
    "paham",
    "konversi",
    "jenis",
    "r",
    "hitung",
    "informatika",
    "situs",
    "media",
    "dampak",
    "pengaruh",
    "netral",
    "ilmiah",
    "for",
    "komunikasi",
    "cari",
    "application",
    "sederhana",
    "langsung",
    "efektivitas",
    "hidup",
    "no",
    "nur",
    "pp",
    "jurnal",
    "ilmu",
    "metrik",
    "c",
    "adaptasi",
    "evaluation",
    "ajar",
    "buat",
    "optimal",
    "hapus",
    "rencana",
    "bisnis",
    "performa",
    "publik",
    "algorithms",
    "kondisi",
    "research",
    "laku",
    "kembang",
    "pakai",
    "hasibuan",
    "soft",
    "label",
    "m",
    "implementation",
    "kandung",
    "g",
    "latar",
    "islam",
    "manual",
    "aman",
    "international",
    "contoh",
    "bimbing",
    "teks",
    "program",
    "kolom",
    "jalan",
    "pegawai",
    "informasi",
    "sebab",
    "intelligent",
    "model",
    "teknik",
    "bit",
    "e",
    "pisah",
    "email",
    "el",
    "case",
    "rizky",
    "t",
    "x",
    "ubah",
    "andika",
    "setiawan",
    "indonesia",
    "implementasi",
    "teliti",
    "kec",
    "nyata",
    "harap",
    "khusus",
    "p",
    "tingkat",
    "journal",
    "memory",
    "kota",
    "terap",
    "amalia",
    "luas",
    "efektif",
    "centang",
    "batas",
    "ikut",
    "total",
    "salah",
    "by",
    "n",
    "keyword",
    "akses",
    "ka",
    "d",
    "on",
    "latih",
    "kait",
    "jakarta",
    "masyarakat",
    "science",
    "metodologi",
    "sifat",
    "darma",
    "dosen",
    "ii",
    "mkom",
    "mudah",
    "proses",
    "u",
    "hubung",
    "sesuai",
    "usia",
    "studi",
    "simbol",
    "cakup"
  ],
  "filename": "1751864798_Exum_211402100.pdf",
  "user_id": 17
}