{
  "original_text": "RINGKASAN JUDUL YANG DIAJUKAN\n*Semua kolom di bawah ini diisi oleh mahasiswa yang sudah mendapat judul\nJudul / Topik Pemetaan Sebaran Terumbu Karang di Perairan Pulau Kalimantung Gadang\nSkripsi\nMenggunakan Citra Satelit dengan Algoritma Lyzenga dan Optimisasi ADAM\n(Adaptive Moment Estimation)\nLatar Belakang Latar Belakang\ndan Penelitian\nTerdahulu Indonesia adalah negara kepulauan yang memiliki lebih dari 17.500 pulau, tersebar dari Sabang\nhingga Merauke. Dengan luas laut yang lebih dari 70% dari total luas negara, Indonesia dikenal\nsebagai negara maritim. Salah satu kekayaan alam yang dimiliki perairan Indonesia adalah\nterumbu karang, ekosistem bawah laut yang kompleks dan kaya akan keanekaragaman hayati.\nKeanekaragaman hayati yang tinggi menjadikannya habitat vital bagi berbagai biota laut dan\nmemberikan manfaat ekonomi bagi masyarakat di sekitarnya (Eddy et al., 2018). Perpaduan\nsuhu air yang hangat dan paparan sinar matahari yang optimal di perairan Indonesia menciptakan\nrumah ideal bagi terumbu karang untuk berkembang dan mewarnai lautan dengan keindahannya\n(Fadli et al., 2013; Saptarini et al., 2017). Kekayaan biologis dari terumbu karang di Indonesia\nadalah yang paling beragam di dunia, dengan sekitar 590 jenis karang keras (Veron, 2002), serta\nsejumlah spesies karang yang hanya ditemukan di wilayah ini (Rudi et al., 2009). Lebih dari\n95% dari total jumlah spesies karang yang terdaftar dalam Pusat Segitiga Terumbu Karang\nberada di Indonesia (Veron et al., 2009). Menurut Burke et al,. (2012), wilayah ini sering disebut\nsebagai \"Amazon Laut\" dan meliputi hampir 30% dari total luas terumbu karang di seluruh dunia\nserta 75% dari semua spesies karang yang dikenal. Namun, sumber daya yang sangat berharga\nini kini menghadapi ancaman. Aktivitas penangkapan yang berlebihan, penggunaan teknik\npenangkapan yang merusak, pembangunan di sepanjang pantai, dan pencemaran telah\nmengancam lebih dari 85% luas terumbu karang di Indonesia.\nRusaknya ekosistem terumbu karang juga ditemukan di perairan Pulau Kalimantung Gadang,\nKabupaten Tapanuli Tengah seperti yang dijelaskan oleh pihak Dinas Kelautan dan Perikanan\nProvinsi Sumatera Utara selaku pihak konservasi terumbu karang wilayah Sumatera Utara.\nKerusakan ekosistem terumbu karang didaerah tersebut sebagian besar diakibatkan oleh\naktivitas manusia, hal tersebut diketahui berdasarkan bukti bahwa terdapat terumbu karang yang\nhancur berkeping-keping yang tersebar di dasar perairan. Sebagian terumbu karang juga\nditemukan sudah mengalami pemutihan. Selain itu cara menangkap ikan di laut Pulau\nKalimantung Gadang yang menggunakan bom ikan menjadi salah satu penyebab kerusakan\nterumbu karang.\nCitra adalah salah satu komponen multimedia yang memegang peranan sangat penting sebagai\nbentuk informasi visual. Citra satelit adalah gambaran objek-objek yang terdapat di permukaan\ndan dekat permukaan bumi, yang direkam oleh sebuah satelit yang beroperasi di luar angkasa,\ndengan jarak ratusan kilometer di atas paras bumi. Citra satelit memiliki beragam kegunaan yang\npenting dalam berbagai bidang, termasuk pemetaan lingkungan, pemantauan perubahan iklim,\npemantauan bencana alam, pertanian, pengelolaan sumber daya alam, serta penelitian ilmiah.\nDengan kemampuannya untuk memberikan informasi visual tentang permukaan bumi dari\nketinggian, citra satelit memungkinkan analisis yang mendalam tentang kondisi dan dinamika\nlingkungan global secara luas dan efisien, serta membantu dalam pengambilan keputusan yang\nlebih tepat dalam berbagai konteks.\nPenggunaan citra satelit dalam pemetaan sebaran terumbu karang memiliki beberapa\nkeunggulan yang signifikan. Citra satelit memberikan cakupan yang luas, resolusi spasial dan\ntemporal yang baik, serta aksesibilitas yang mudah, memungkinkan para peneliti dan pengambil\nkeputusan untuk memantau kondisi terumbu karang secara efisien dan akurat. Dengan integrasi\nteknologi analisis seperti sistem informasi geografis dan pengolahan citra digital, citra satelit\nmemungkinkan pemetaan yang mendalam tentang kondisi terumbu karang serta pemantauan\nperubahan lingkungan laut dari waktu ke waktu. Ini membantu dalam perencanaan konservasi\ndan pengelolaan yang lebih efektif untuk melindungi dan memelihara keberlanjutan terumbu\nkarang Indonesia.\nPenelitian terkait yang sudah dilakukan sebelumnya dilakukan oleh (Fuad et al., 2022) dengan\njudul Pemetaan Terumbu Karang dengan Citra Satelit Sentinel-2 dan Analisis Kondisi Karang\ndi Kawasan Pantai Pasir Putih, Situbondo Jawa Timur. Penelitian ini memetakan dan\nmengidentifikasi kondisi terumbu karang di kawasan Pantai Pasir Putih Situbondo, Jawa Timur\ndengan menggunakan citra satelit Sentinel 2 dan survei lapangan. Hasil akurasi peta yang\ndihasilkan sebesar 72,2%.\nPenelitian lainnya dilakukan oleh Amrillah, Khoirul, et al., (2019) dengan judul Pemetaan\nSebaran Terumbu Karang di Perairan Pulau Kelapan, Kabupaten Bangka Selatan Berdasarkan\nData Satelit Sentinel 2A. Citra satelit yang digunakan adalah citra satelit sentinel-2A dengan\nmetode pengolahan citra untuk membuat peta sebaran terumbu karang di Perairan Pulau\nKelapan, menganalisis luasan terumbu karang di perairan dangkal Pulau Kelapan, dan\nmenganalisis kondisi terumbu karang (persentase tutupan, indeks mortalitas, dan keragaman\ngenus) berdasarkan analisa data penyelaman di lapangan. Hasil uji akurasi hasil citra digital\ndengan pengecekan di lapangan menunjukkan nilai akurasi 84%.\nPenelitian lainnya dilakukan oleh Maulana, Y, et al., (2018) dengan judul Pemetaan Sebaran\nTerumbu Karang Menggunakan Citra Satelit SPOT-6 di Perairan Pulau Pari Kepulauan Seribu\nJakarta. Citra satelit yang digunakan adalah citra satelit SPOT-6 dan menggunakan purposive\nsampling technique. Hasil uji akurasi hasil citra digital adalah 70.00%.\nPenelitian lainnya dilakukan oleh Suryono, et al., (2022) dengan judul Perubahan Luas Terumbu\nKarang di Pulau Panjang, Jepara. Citra satelit yang digunakan adalah citra satelit Landsat 7\ndan 8 yang digunakan untuk menganalisis perubahan luas terumbu di Pulau Panjang, Jepara.\nPenelitian ini juga menggunakan metode SIG dengan klasifikasi multispektral dari kemungkinan\nmaksimum untuk ekstraksi data tutupan terumbu karang dari citra multi temporal yang telah\ndikoreksi secara geometris dan radiometrik.\nPenelitian lainnya dilakukan oleh Azka, Laila, et al., (2019) dengan judul Analisa Luasan\nTerumbu Karang Berdasarkan Pengolahan Data Citra Satelit Landsat 8 Menggunakan\nAlgoritma Lyzenga. Penelitian ini menggunakan citra satelit Landsat 8 dan algoritma Lyzenga\nuntuk mengeliminasi kesalahan identifikasi spektral habitat karena faktor kedalaman. Hasil\npenelitian menunjukan bahwa data hasil pengolahan citra memiliki tingkat ketelitian peta untuk\nPulau Menjangan Besar dan Menjangan Kecil sebesar 77,78% sedangkan tingkat ketelitian peta\nuntuk Pulau Karimunjawa dan Kemujang sebesar 72,23%.\nBerdasarkan latar belakang dan penelitian terdahulu, maka penulis mengajukan penelitian yang\nberjudul “Pemetaan Sebaran Terumbu Karang di Perairan Pulau Kalimantung\nGadang Menggunakan Citra Satelit dengan Algoritma Lyzenga dan Optimisasi\nADAM (Adaptive Moment Estimation).”\nPenelitian Terdahulu\nNo Penulis Tahun Metode Keterangan\n1 M. Arif Zainul Fuad, 2022 Depth Penelitian ini memetakan dan\net al Invariant\nmengidentifikasi kondisi terumbu\nIndex (DII)\nkarang di kawasan Pantai Pasir Putih\nSitubondo, Jawa Timur dengan\nmenggunakan citra satelit Sentinel 2\ndan survei lapangan. Hasil akurasi\npeta yang dihasilkan sebesar 72,2%.\n2 Khoirul Amrillah, 2019 Algoritma Penelitian ini citra satelit sentinel-2A\nWahyu Adi, dan Lyzenga\ndengan metode pengolahan citra\nKurniawan\nuntuk membuat peta sebaran terumbu\nkarang di Perairan Pulau Kelapan,\nmenganalisis luasan terumbu karang\ndi perairan dangkal Pulau Kelapan,\ndan menganalisis kondisi terumbu\nkarang (persentase tutupan, indeks\nmortalitas, dan keragaman genus)\nberdasarkan analisa data penyelaman\ndi lapangan. Hasil uji akurasi hasil\ncitra digital dengan pengecekan di\nlapangan menunjukkan nilai akurasi\n84%.\n3 Yonas Ramadhan 2021 Purposive Penelitian ini dilakukan untuk\nMaulana, Sampling\nmengetahui kondisi terumbu karang\nTechnique\nSupriharyono, dan\ndi kawasan perairan Pulau Pari\nSigit Febrianto\nKepulauan Seribu, Jakarta dan\nmenggunakan citra satelit SPOT-6\ndan menggunakan purposive\nsampling technique. Hasil uji akurasi\nhasil citra digital adalah 70.00%.\n4 Suryono, et al 2022 Sistem Penelitian ini menggunakan citra\nInformasi\nsatelit Landsat 7 dan 8 yang\nGeografis\n(SIG) digunakan untuk menganalisis\nperubahan luas terumbu di Pulau\nPanjang, Jepara. Penelitian ini juga\nmenggunakan metode SIG dengan\nklasifikasi multispektral dari\nkemungkinan maksimum untuk\nekstraksi data tutupan terumbu\nkarang dari citra multi temporal yang\ntelah dikoreksi secara geometris dan\nradiometrik.\n5 Laila Martina Azka, 2019 Algoritma Penelitian ini menggunakan citra\net al Lyzenga\nsatelit Landsat 8 dan algoritma\nLyzenga untuk mengeliminasi\nkesalahan identifikasi spektral habitat\nkarena faktor kedalaman. Hasil\npenelitian menunjukan bahwa data\nhasil pengolahan citra memiliki\ntingkat ketelitian peta untuk Pulau\nMenjangan Besar dan Menjangan\nKecil sebesar 77,78% sedangkan\ntingkat ketelitian peta untuk Pulau\nKarimunjawa dan Kemujang sebesar\n72,23%.\n6 Zainul Hidayah dan 2019 Algoritma Penelitian ini menggunakan citra\nNike Ika Nuzula Lyzenga\nsatelit Landsat 7 dan algoritma\nLyzenga untuk mengkoreksi kolom\nair. Hasil penelitian menunjukkan\nbahwa luas substrat terumbu karang\nmenurut hasil olahan citra adalah\n10,478.032 Ha. Secara umum\nterumbu karang di pesisir Selat\nMadura berada dalam kondisi sedang\nhingga rusak.\n7 Ridha Alamsyah, 2019 Algoritma Penelitian ini menggunakan citra\nUspar, Armita Lyzenga\nsatelit Landsat 8 dan algoritma\nPermatasari, dan\nLyzenga untuk mengetahui sebaran\nNurfadillah\ndan luasan karang pada kawasan\nPulau Larearea. Hasil penelitian\nmenunjukkan persentase karang\nhidup di Pulau Lareare sebesar\n47,54%, karang mati 35,19%, pasir\n17,27%, dan luasan karang hidup\nsebesar 59,59 Ha.\nRumusan Aktivitas penangkapan yang berlebihan dan penggunaan teknik penangkapan yang merusak\nMasalah\ntelah mengancam luas terumbu karang di Pulau Kalimantung Gadang, Kabupaten Tapanuli\nTengah, Provinsi Sumatera Utara. Selain itu, survey manual yang biasanya dilakukan oleh pihak\nkonservasi memiliki kekurangan yaitu cakupan yang terbatas dalam menangkap variasi spasial\nyang lebih luas dari terumbu karang. Dalam situasi ini, penting untuk melakukan pemetaan\nsebaran terumbu karang di perairan Pulau Kalimantung Gadang yang juga merupakan daerah\nkonservasi terumbu karang, guna mengidentifikasi lokasi dan kondisi terumbu karang dan\nmemberikan informasi yang penting bagi upaya konservasi, manajemen sumber daya laut, dan\nperencanaan pemulihan terumbu karang.\nMetodologi\nPenelitian ini melewati beberapa tahapan dalam pemrosesan berdasarkan metode yang\ndigunakan. Tahap pertama dimulai dari proses pengumpulan data citra satelit yang akan\ndigunakan pada penelitian ini. Data tersebut akan masuk ke tahap kedua yaitu pre-processing,\ndimana pada tahap ini akan dilakukan filtering, yaitu menentukan tanggal citra satelit diambil\nbeserta area yang diteliti (Area of Interest), cloud masking yaitu menghilangkan atau\nmemisahkan informasi dari permukaan bumi yang terpengaruh oleh awan, dan band composit\nyaitu penyusunan citra komposit menggunakan kombinasi 3 band RGB (red, green, blue).\nSetelah itu akan masuk ke tahap berikutnya yaitu Split Data untuk membagi dataset menjadi\nbeberapa bagian, yaitu data training, data testing, dan data validaton. Data training dan data\ntesting akan dilatih dengan algoritma Lyzenga untuk mengkoreksi kolom air yang berfungsi\nuntuk mengatasi pengaruh kedalaman air, lalu digunakan optimisasi ADAM (Adaptive Moment\nEstimation) untuk menghasilkan meningkatkan akurasi dan efisiensi pemetaan, setelah itu\nsistem akan menghasilkan learned model. Setelah itu, akurasi hasil akan dihitung dan\nmenghasilkan output berupa peta sebaran terumbu karang.\nReferensi Akraboelittaqwa, A., Astuty, S., Yustiati, A., & Jannah, W. (2020). Identifikasi Tutupan Terumbu\nKarang Di Gili Meno. Indonesian Journal of Engineering (IJE), 1(1), 01-11.\nAlamsyah, R., Uspar, U., Permatasari, A., & Nurfadillah, N. (2019). Sebaran Dan Luasan\nTerumbu Karang Di Perairan Pulau Larearea Menggunakan Citra Landsat\n8. Agrominansia, 4(1), 49-54.\nAmrillah, K., Adi, W., & Kurniawan, K. (2019). Pemetaan Pemetaan sebaran Terumbu Karang\ndi Perairan Pulau Kelapan, Kabupaten Bangka Selatan Berdasarkan Data Satelit Sentinel\n2A. Journal of Tropical Marine Science, 2(2), 59-70.\nAzka, L. M. (2019). Analisa Luasan Terumbu Karang Berdasarkan Pengolahan Data Citra Satelit\nLansat 8 menggunakan Algoritma Lyzenga. Journal of Telecommunication Network\n(Jurnal Jaringan Telekomunikasi), 8(1), 18-24.\nBadriawan, N. (2019). Analisis Kerusakan Terumbu Karang Di Pulau Pahawang, Provinsi\nLampung (Doctoral dissertation, Universitas Brawijaya).\nBahri, S., Purnama, D. A., Syawal, S., & Khairi, I. (2020). Evaluasi Tutupan Terumbu Karang\nBerbasis Masyarakat Di Wilayah Kawasan Konservasi Perairan Daerah (Kkpd) Kabupaten\nAceh Selatan. Jurnal Laot Ilmu Kelautan, 2(2), 129-136.\nBurke, L., Reytar, K., Spalding, M., & Perry, A. (2012). Menengok kembali terumbu karang yang\nterancam di segitiga terumbu karang. World Resources Institute, 10.\nFuad, M. A. Z., Ramadhani, M. F. N., Dewi, C. S. U., Fikri, M. A., & Herdikusuma, E. B. (2022).\nPemetaan terumbu karang dengan citra satelit Sentinel-2 dan analisis kondisi karang di\nkawasan Pantai Pasir Putih, Situbondo Jawa Timur. Jurnal Pendidikan Geografi, 27(1), 73-\n87.\nHidayah, Z., & Nuzula, N. I. (2019). Pemetaan Sebaran Terumbu Karang Studi Kasus Selat\nMadura, Jawa Timur. Jurnal Kelautan Tropis, 22(2), 127-134.\nMaulana, Y. R., Supriharyono, S., & Febrianto, S. (2018). PEMETAAN SEBARAN TERUMBU\nKARANG MENGGUNAKAN CITRA SATELIT SPOT-6 DI PERAIRAN PULAU PARI\nKEPULAUAN SERIBU JAKARTA. Management of Aquatic Resources Journal\n(MAQUARES), 7(3), 279-287.\nLyzenga, D. R. (1978). Passive remote sensing techniques for mapping water depth and bottom\nfeatures. Applied optics, 17(3), 379-383.\nSaptarini, D. (2010). Evaluasi terumbu buatan dalam peningkatan kualitas lingkungan Pantai\nPasir Putih Situbondo.\nSuryono, S., Ambariyanto, A., Munasik, M., Ario, R., Pratikto, I., Taufiq-SPJ, N., ... &\nSupryhatun, E. (2022). Perubahan Luas Terumbu Karang di Pulau Panjang, Jepara. Jurnal\nKelautan Tropis, 25(3), 337-344.\nVeron, J. E. N. (2002). New species described in Corals of the World (Vol. 11) Australian\nInstitute of Marine Science.\nMedan, 10 Juni 2024\nMahasiswa yang mengajukan,\n( Syavira Nur Khairani )\nNIM. 201402087",
  "similar_tokens": [
    "provinsi",
    "visual",
    "manajemen",
    "nilai",
    "kembang",
    "manual",
    "telekomunikasi",
    "rekam",
    "mampu",
    "the",
    "kawasan",
    "kumpul",
    "matahari",
    "medan",
    "komponen",
    "terang",
    "ilmiah",
    "new",
    "isi",
    "signifikan",
    "papar",
    "jurnal",
    "efisien",
    "serta",
    "lanjut",
    "bidang",
    "f",
    "milik",
    "r",
    "olah",
    "techniques",
    "hitung",
    "learned",
    "bantu",
    "n",
    "d",
    "kelola",
    "ikan",
    "muka",
    "maksimum",
    "and",
    "purnama",
    "z",
    "teliti",
    "identifikasi",
    "sebab",
    "situasi",
    "masyarakat",
    "mana",
    "tahap",
    "sumber",
    "manusia",
    "adi",
    "aktivitas",
    "mudah",
    "ringkas",
    "tunjuk",
    "cakup",
    "journal",
    "faktor",
    "ubah",
    "cipta",
    "kualitas",
    "jarak",
    "lokasi",
    "ekosistem",
    "gambar",
    "tentu",
    "metodologi",
    "kaya",
    "lapang",
    "uji",
    "s",
    "c",
    "bukti",
    "alami",
    "buat",
    "management",
    "adaptive",
    "peran",
    "alam",
    "topik",
    "citra",
    "dunia",
    "aksesibilitas",
    "efisiensi",
    "kompleks",
    "sinar",
    "studi",
    "spesies",
    "bas",
    "green",
    "m",
    "peta",
    "agam",
    "bagi",
    "for",
    "mahasiswa",
    "ideal",
    "a",
    "hidayah",
    "persentase",
    "wilayah",
    "rumus",
    "fungsi",
    "geografis",
    "global",
    "didik",
    "pegang",
    "daya",
    "aju",
    "manfaat",
    "pusat",
    "hadap",
    "lingkung",
    "daerah",
    "luas",
    "pisah",
    "tinggi",
    "harga",
    "unggul",
    "ekstraksi",
    "hidup",
    "marine",
    "jenis",
    "guna",
    "kurang",
    "i",
    "integrasi",
    "utara",
    "in",
    "skripsi",
    "indonesian",
    "rusa",
    "dinas",
    "engineering",
    "kilometer",
    "daftar",
    "operasi",
    "variasi",
    "susun",
    "multimedia",
    "survei",
    "b",
    "indonesia",
    "y",
    "kait",
    "pengaruh",
    "analisa",
    "masuk",
    "kondisi",
    "optimal",
    "wahyu",
    "fadli",
    "tingkat",
    "j",
    "batas",
    "e",
    "efektif",
    "total",
    "rencana",
    "juni",
    "bangun",
    "salah",
    "temu",
    "al",
    "timur",
    "survey",
    "informasi",
    "sumatera",
    "tutup",
    "latih",
    "bentuk",
    "kece",
    "jadi",
    "air",
    "putus",
    "applied",
    "vol",
    "judul",
    "dasar",
    "tulis",
    "hasil",
    "pantau",
    "kenal",
    "warna",
    "ambil",
    "dinamika",
    "sebar",
    "lewat",
    "akurat",
    "referensi",
    "pemrosesan",
    "rumah",
    "no",
    "konteks",
    "k",
    "atas",
    "et",
    "aquatic",
    "ramadhan",
    "latar",
    "pelihara",
    "vital",
    "science",
    "teknik",
    "tani",
    "dalam",
    "dewi",
    "technique",
    "jakarta",
    "u",
    "indah",
    "akibat",
    "kombinasi",
    "universitas",
    "tangkap",
    "ilmu",
    "liput",
    "analis",
    "l",
    "w",
    "tanggal"
  ],
  "filename": "1751946291_Exum_201402087.pdf",
  "user_id": 17
}