{
  "original_text": "FORM PENGAJUAN JUDUL\nNama : Raihan Alifya Lubis\nNIM : 201402062\nJudul diajukan oleh* : Dosen Foto Terbaru\n✓ Mahasiswa\nBidang Ilmu (tulis dua bidang) : 1. D a t a =Sc ience and Intelligence System\n2. Computer Graphics and Vision\nUji Kelayakan Judul** : Diterima Ditolak\nHasil Uji Kelayakan Judul :\nCalon Dosen Pembimbing I: Dr. Marischa Elveny S.TI., M.Kom.\nParaf Calon Dosen Pembimbing I\n(Jika judul dari dosen maka dosen tersebut berhak menjadi pembimbing I)\nCalon Dosen Pembimbing II: Muhammad Safri Lubis S.T., M.Com.\nMedan, ......................................\nKa. Laboratorium Penelitian,\n* Centang salah satu atau keduanya (Fanindia Purnamasari S.TI., M.IT)\n** Pilih salah satu NIP. 198908172019032023\nRINGKASAN JUDUL YANG DIAJUKAN\n*Semua kolom di bawah ini diisi oleh mahasiswa yang sudah mendapat judul\nJudul / Topik IDENTIFIKASI GERAKAN SALAT WAJIB DALAM MENENTUKAN JUMLAH\nSkripsi RAKAAT MENGGUNAKAN MODEL MOVENET SECARA REAL-TIME\nLatar Belakang Latar Belakang\ndan Penelitian\nTerdahulu Salat merupakan suatu bentuk penghambaan seorang muslim yang beriman kepada\nTuhannya, sehingga dibutuhkan kekhusyukan dalam melaksanakan atau menjalankan ibadah\nsalat agar diterima Allah SWT. Dalam pelaksanaannya, salat memiliki runtutan gerakan yang\ndilakukan secara tertib yang dinamakan rukun salat sebagai sebuah tolak ukur dari sahnya salat\n(Nasution et al., 2022). Dalam survei yang dilakukan oleh Jahan et al. (2023) mengenai\nkesalahan yang sering terjadi dalam salat dan dampak teknologi untuk mengatasinya, dari 126\npartisipan dinyatakan bahwa kesalahan yang paling sering terjadi dalam salat adalah lupa jumlah\nrakaat yang telah dijalani. Meskipun lupa jumlah rakaat telah menjadi suatu hal yang sering\nterjadi, namun kesalahan seperti ini tidak bisa dianggap biasa.\nPenghitungan rakaat dalam salat adalah ketika berdirinya seseorang dalam salat setelah\nmelakukan sujud atau tahiyat. Identifikasi gerakan salat untuk menentukan jumlah rakaat adalah\ndengan mengidentifikasi 3 gerakan yaitu berdiri, sujud dan duduk (tahiyat). Dengan\nmengidentifikasi 3 gerakan tersebut dapat dilihat apabila dilakukan gerakan sujud – duduk –\nsujud kemudian dilanjutkan dengan berdiri atau maka salat tersebut dapat dihitung sebagai satu\nrakaat penuh. Lupa rakaat dalam salat terjadi ketika seseorang melaksanakan salat dan pada\nrakaat kedua, setelah sujud kedua, seharusnya duduk untuk tahiyat, namun malah berdiri\nkembali. Berbeda dengan salat berjemaah, salat yang dilaksanakan sendirian tidak ada yang akan\nmembenarkan apabila terjadi permasalahan seperti lupa rakaat. Maka dari itu diperlukan sebuah\nsistem yang dapat mengingatkan ketika lupa rakaat salat dengan mengucapkan Subhanallah\nsebagai pertanda bahwa terdapat kesalahan pada penghitungan rakaat yang sedang dilakukan.\nMetode pengenalan gerakan manusia pada Deep Learning yang disebut Pose Estimation\nmemberikan manfaat dalam kelangsungan hidup manusia. Pose Estimation menggunakan\npemrosesan citra untuk mengidentifikasi pose seseorang sehingga komputer dapat mengetahui\napa yang sedang dilakukan oleh seseorang yang sedang diidentifikasi. Salah satu model Pose\nEstimation yang dapat melakukan identifikasi terhadap pose adalah MoveNet. MoveNet\nmenawarkan hasil dengan akurasi yang tinggi, namun tetap mengedepankan kepada efisiensi\ndan kecepatan pengiriman data ketika mengidentifikasi data secara Real-Time.\nPada penelitian yang dilakukan oleh Bajpai dan Joshi (2021) mengenai Kinerja MoveNet\ndalam permodelan bentuk pose manusia khususnya pada bagian lutut ketika seseorang berjalan.\nPenelitian ini menjelaskan bagaimana arsitektur MoveNet yang memiliki 3 bagian, yaitu:\nEncoder, Mapper dan Decoder. Encoder yang dilakukan untuk mengubah input berupa gambar\nmenjadi gambar yang lebih kecil, sehingga Mapper dilakukan untuk memetakan titik yang\nterdapat pada tubuh manusia dan kemudian Decoder akan mengembalikan output dari sebuah\ngambar yang telah dipetakan dengan Mapper sebelumnya sehingga menghasilkan output yang\nlebih mudah dimengerti oleh manusia. Penelitian ini mendapatkan kesimpulan bahwasanya\nMoveNet mendapatkan akurasi yang tinggi bahkan dengan input yang sedikit, sehingga dapat\nmembuat waktu permodelan yang dibutuhkan menjadi lebih singkat.\nPada penelitian sebelumnya yang dilakukan oleh Koubaa et al. (2020) yang meneliti tentang\nbagaimana Deep Learning dapat mengidentifikasi gerakan salat seseorang dengan keresahan\npenulis yaitu pada beberapa orang yang melakukan salat, tidak menunjukkan keseriusan ataupun\nmelakukan salat dengan tidak sempurna dengan beberapa kekurangan dalam gerakan rukun salat\ntersebut. Penelitian yang dilakukan dengan menggunakan algoritma YOLO-V3 ini memiliki\nhasil yang sedikit memuaskan yaitu dengan persentasi 75% sampai dengan 83%\nBeberapa penelitian sebelumnya seperti yang dilakukan oleh Jahan et al. (2023) yang\nberjudul Leveraging a Smartwatch for Activity Recognition in Salat yaitu dengan membuat\nsebuah perangkat mini yang akan ditempelkan pada beberapa titik di anggota tubuh dengan\ntujuan mengetahui gerakan apa yang sedang dilaksanakan dan juga pada penelitian yang\ndilakukan oleh Latifah et al. (2022) yaitu Monitoring Gerakan Shalat Melalui Kamera dengan\nMetode Pose Predict memiliki suatu permasalahan yang sama mengenai masalah yang muncul\nketika seseorang sedang melaksanakan salat dan memiliki tujuan yang sama yaitu membantu\nseseorang dalam pelaksanaan ibadah salat agar tercapainya kualitas salat yang lebih baik.\nPenelitian yang dilakukan oleh Rehman et al. (2023) yang meneliti mengenai identifikasi\ngerakan salat menggunakan OpenPose dan 3D-CNN dengan mengambil tiga gerakan yaitu\nberdiri, rukuk dan sujud. Penelitian ini mendapatkan akurasi yang sangat besar dengan\nmenggunakan model OpenPose dalam menentukan posisi titik yang ada pada tubuh manusia,\nnamun yang menjadi pembeda antara OpenPose dan MoveNet adalah pada kapasitas memori\nyang dibutuhkan sehingga membuat OpenPose berjalan lebih lambat daripada MoveNet (Jo Et\nal., 2023) yang akhirnya mendorong peneliti untuk menggunakan model MoveNet dalam\npermodelan lokasi titik pada tubuh manusia.\nBerdasarkan dari permasalahan yang muncul, serta penelitian terdahulu yang membahas\ntentang hal hal yang berkaitan dengan permasalahan dan metode yang digunakan, penulis\nmemutuskan untuk membuat sistem dengan berbasis aplikasi menggunakan kamera menulis\npenelitian guna menyelesaikan permasalahan yang muncul dengan judul “IDENTIFIKASI\nGERAKAN SALAT WAJIB DALAM MENENTUKAN JUMLAH RAKAAT\nMENGGUNAKAN MODEL MOVENET SECARA REAL-TIME”.\nPenelitian Terdahulu\nNo. Penulis Judul Tahun\nMoveNet: A Deep Neural Network for Joint\nRishabh Bajpai and\n1 Profile Prediction Across Variable Walking 2021\nDeepak Joshi\nSpeeds and Slopes\nAnis Koubaa, Adel\nAmmar, Bilel Benjdira,\nAbdullatif Al-Hadid,\nActivity Monitoring of Islamic Prayer (Salat)\n2 Belal Kawaf, Saleh Ali 2020\nPostures using Deep Learning\nAl-Yahri, Abdelrahman\nBabiker, Koutaiba Assaf\ndan Mohannad Ba Ras\nIshrat Jahan, Najla\nAbdulrahman Al-\nLeveraging a Smartwatch for Activity\n3 Nabhan, Jannatun Noor, 2023\nRecognition in Salat\nMasfiqur Rahaman dan\nA.B.M Alim Al Islam\nMONITORING GERAKAN SHALAT\nNyatu Latifah dan\n4 MELALUI KAMERA DENGAN METODE 2022\nIskandar Lutfi\nPOSE PREDICT\nKhalil Ur Rehman,\nSameena Javaid, Salat Postures Detection Using a Hybrid Deep\n5 2023\nMudasser Ahmed dan Learning Architecture\nShahzad Khan\nComparative analysis of OpenPose, PoseNet,\nBeomJun Jo dan\n6 and MoveNet models for pose estimation in 2022\nSeongKi Kim\nmobile devices\nRumusan Masalah Dalam pelaksanaan salat, seringkali kita kehilangan fokus dan tidak mencapai kekhusyukan\nyang diharapkan. Hal ini bisa menyebabkan kita lupa jumlah rakaat yang telah dilaksanakan,\nterutama ketika salat dilakukan seorang diri. Maka dari itu diperlukan sebuah sistem yang dapat\nmengingatkan ketika lupa rakaat salat dengan mengucapkan Subhanallah sebagai pertanda\nbahwa terdapat kelupaan pada rakaat yang dilakukan.\nMetodologi Metodologi yang digunakan dalam penelitian ini yaitu:\n1. Analisis masalah\nPenulis mengambil keresahan yang sering terjadi pada orang orang disekitar kemudian\nmenjabarkan serta memeriksa apakah masalah yang terjadi pada orang orang di sekitar\npenulis juga menjadi sebuah keresahan yang dirasakan oleh orang lain.\n2. Studi Literatur\nPada tahap ini, penulis mengumpulkan beberapa jurnal, buku, artikel dan jawaban dari\nahli agama, yaitu mengenai hukum dalam agama Islam maupun mengenai model\npengenalan yang digunakan.\n3. Persiapan Data\nTahap ini, penulis mengumpulkan data yaitu gambar dari seseorang yang sedang\nmelakukan beberapa gerakan salat yang nantinya akan digunakan pada aplikasi untuk\nmengidentifikasi gerakan salat.\n4. Perancangan Awal\nPada tahap ini, penulis merancang arsitektur umum yang akan digunakan dalam\nidentifikasi gerakan salat. Arsitektur umum yang dibuat digunakan agar aplikasi yang\nakan dibuat dapat berjalan lancar dan tidak keluar dari konteks yang akan dikerjakan.\n5. Pembuatan Sistem\nPenulis membuat aplikasi yang dapat mengidentifikasi gerakan salat sesuai dengan\narsitektur umum yang telah dibuat pada tahap perancangan awal.\n6. Pengujian Sistem\nPengujian yang dilakukan agar mengetahui akurasi yang didapatkan pada aplikasi yang\ntelah dibuat.\nArsitektur Umum:\n1. Data Acquisition\nMerupakan tahapan dimana penulis mengumpulkan data yang berbentuk image yang\nnantinya akan dijadikan sebagai dataset dalam mengidentifikasi gerakan salat.\nKemudian data dibagi menjadi 3 yaitu untuk Data Training, Data Validation dan Data\nTesting.\n2. Preprocessing Data\nTahapan selanjutnya ketika sudah mengumpulkan dataset yang diperlukan dan untuk\nmendapatkan input yang lebih baik dan sesuai dengan model yang akan digunakan. Pada\ndata preprocessing ini memiliki 3 tahapan yaitu:\n2.1. Labelling\nYaitu melakukan pemberian label pada setiap data yang telah dikumpulkan dengan\nbertujuan untuk memberikan pertanda kepada mesin yang akan diajari.\n2.2. Resizing\nYaitu melakukan pengubahan ukuran data yang telah diberikan label sehingga\nmenjadi lebih kecil agar sesuai dengan input yang diterima oleh model yang akan\ndigunakan.\n2.3. Augmentation\nYaitu melakukan perubahan pada data yang telah dikecilkan untuk menginkatkan\nakurasi.\n3. MoveNet Model\nData yang telah melalui proses Preprocessing dimasukkan kedalam model MoveNet\nsehingga mendapatkan posisi sendi tubuh manusia yang sedang melakukan gerakan\nsalat tersebut. MoveNet Model memiliki 3 bagian:\n3.1. Encoder\nYaitu melakukan pengubahan ukuran input sehingga dapat memfokuskan pada\nbagian bagian tubuh yang diperlukan.\n3.2. Mapper\nYaitu melakukan pemetaan pada bagian bagian sendi tubuh yaitu ada 17 titik yang\ndipetakan pada tubuh manusia.\n3.3. Decoder\nYaitu melakukan pengembalian berupa ouput sesuai dengan input yang telah\ndimasukkan di awal ditambahkan dengan titik yang telah dipetakan sebelumnya.\n4. Classifier\nSetelah mendapatkan output berupa posisi anggota tubuh dari masing masing data\ntersebut, dilakukan klasifikasi agar mengetahui gerakan gerakan apa yang telah\ndilakukan oleh manusia pada data tersebut.\n5. Learned Model\nAdalah hasil dari model yang telah dilatih menggunakan data training yang kemudian\nakan digunakan sebagai acuan dari data yang akan diidentifikasi dan disimpan pada\nsistem.\n6. Real-World Application\nPenggunaan sistem dengan kamera yang mengambil gambar seseorang sedang\nmelaksanakan salat secara real-time dengan kemudian menggunakan model MoveNet\nuntuk memetakan posisi bagian tubuh manusia.\n7. Output\nOutput yang dihasilkan berupa suara Subhanallah yang akan memberitahukan jika\nterjadi kesalahan pada jumlah rakaat salat yang telah dilaksanakan.\nReferensi Nasution, M. I. P., Putri, R. A., & Nasution, R. A. (2022). Aplikasi Mobile Media Pembelajaran\nRukun Shalat Fardu Menurut 4 Imam Mazhab. YASIN, 2(1), 169-185.\nhttps://doi.org/10.58578/yasin.v2i1.220\nJahan, I., Al-Nabhan, N. A., Noor, J., Rahaman, M., & Al Islam, A. A. (2023). Leveraging A\nSmartwatch for Activity Recognition in Salat. IEEE Access.\nLatifah, N., & Lutfi, I. (2022). MONITORING GERAKAN SHALAT MELALUI KAMERA\nDENGAN METODE POSE PREDICT. Jurnal Qua Teknika, 12(2), 28-38.\nKoubâa, A., Ammar, A., Benjdira, B., Al-Hadid, A., Kawaf, B., Al-Yahri, S. A., ... & Ras, M.\nB. (2020, March). Activity monitoring of islamic prayer (salat) postures using deep learning. In\n2020 6th Conference on data science and machine learning applications (CDMA) (pp. 106-111).\nIEEE.\nJo, B., & Kim, S. (2022). Comparative analysis of OpenPose, PoseNet, and MoveNet models\nfor pose estimation in mobile devices. Traitement du Signal, 39(1), 119.\nRehman, K. U., Javaid, S., Ahmed, M., & Khan, S. (2023). Salat Postures Detection Using a\nHybrid Deep Learning Architecture.\nBajpai, R., & Joshi, D. (2021). Movenet: A deep neural network for joint profile prediction\nacross variable walking speeds and slopes. IEEE Transactions on Instrumentation and\nMeasurement, 70, 1-11.\nMedan, 14 Januari 2025\nMahasiswa yang mengajukan,\n(Raihan Alifya Lubis)\nNIM.201402062",
  "similar_tokens": [
    "judul",
    "kurang",
    "sah",
    "metode",
    "survei",
    "mesin",
    "depan",
    "ubah",
    "lanjut",
    "applications",
    "models",
    "singkat",
    "nim",
    "dampak",
    "kumpul",
    "cepat",
    "bahas",
    "algoritma",
    "ilmu",
    "hybrid",
    "on",
    "mahasiswa",
    "kait",
    "prediction",
    "komputer",
    "aju",
    "erti",
    "and",
    "tawar",
    "kualitas",
    "bantu",
    "memberitahukan",
    "januari",
    "for",
    "atas",
    "layak",
    "beda",
    "putri",
    "measurement",
    "butuh",
    "masalah",
    "manfaat",
    "buku",
    "tanda",
    "beri",
    "ambil",
    "dasar",
    "guna",
    "ancang",
    "data",
    "tuhan",
    "kecil",
    "imam",
    "jalan",
    "kim",
    "manusia",
    "muncul",
    "of",
    "laksana",
    "mudah",
    "lupa",
    "latifah",
    "et",
    "rancang",
    "dosen",
    "bidang",
    "dorong",
    "network",
    "medan",
    "tuju",
    "teliti",
    "terima",
    "hasil",
    "siap",
    "referensi",
    "jurnal",
    "lambat",
    "nip",
    "tentu",
    "al",
    "muhammad",
    "islam",
    "lubis",
    "ali",
    "latar",
    "ahli",
    "th",
    "putus",
    "ringkas",
    "output",
    "konteks",
    "s",
    "buat",
    "form",
    "sesuai",
    "machine",
    "allah",
    "anggota",
    "laboratorium",
    "training",
    "fokus",
    "tahap",
    "hidup",
    "studi",
    "metodologi",
    "ka",
    "dalam",
    "computer",
    "iskandar",
    "jabar",
    "gambar",
    "mkom",
    "label",
    "literatur",
    "diri",
    "st",
    "simpul",
    "identifikasi",
    "hitung",
    "conference",
    "lokasi",
    "nama",
    "pp",
    "harap",
    "march",
    "sc",
    "nyata",
    "tulis",
    "using",
    "proses",
    "p",
    "intelligence",
    "pilih",
    "bagi",
    "j",
    "sebab",
    "media",
    "a",
    "rumus",
    "acu",
    "ukur",
    "calon",
    "citra",
    "selesai",
    "meta",
    "langsung",
    "profile",
    "orang",
    "hak",
    "isi",
    "aplikasi",
    "capai",
    "latih",
    "no",
    "perangkat",
    "periksa",
    "in",
    "jadi",
    "system",
    "duduk",
    "science",
    "input",
    "variable",
    "monitoring",
    "sistem",
    "mobile",
    "memori",
    "learning",
    "dapat",
    "centang",
    "saleh",
    "analysis",
    "kolom",
    "bas",
    "peta",
    "activity",
    "posisi",
    "agama",
    "n",
    "i",
    "u",
    "simpan",
    "skripsi",
    "ii",
    "milik",
    "analisis",
    "akurasi",
    "uji",
    "salah",
    "raih",
    "teknologi",
    "tertib",
    "topik",
    "penuh",
    "efisiensi",
    "runtut",
    "anggap",
    "arsitektur",
    "baru",
    "kirim",
    "kerja",
    "kenal",
    "t",
    "dr",
    "masuk",
    "m",
    "r",
    "ajar",
    "mana",
    "model",
    "b",
    "hukum",
    "swt",
    "abm",
    "titik",
    "application",
    "d",
    "bentuk",
    "architecture",
    "bimbing",
    "predict",
    "muas",
    "testing",
    "khan",
    "k",
    "kapasitas"
  ],
  "filename": "1751736650_1750929028_Exum_201402062.pdf",
  "user_id": 17
}