{
  "original_text": "RINGKASAN JUDUL YANG DIAJUKAN\n*Semua kolom di bawah ini diisi oleh mahasiswa yang sudah mendapat judul\nJudul / Topik IMPLEMENTASI ALGORITMA FP-GROWTH DAN RANDOM FOREST PADA\nSkripsi SISTEM PENDETEKSIAN URL TERINDIKASI PHISHING\nLatar Belakang Latar Belakang\ndan Penelitian\nTerdahulu Seiring dengan semakin berkembangnya teknologi pada era digital ini, banyak ancaman yang\nmembuat masyarakat resah berkaitan dengan keamanan siber. Keamanan siber merupakan salah\nsatu hal yang sangat krusial terhadap perlindungan data dan privasi pengguna. Dari banyaknya\njenis keamanan siber yang mengancam perlindungan data dan privasi pengguna, salah satu\nbentuk ancaman yang sering ditemukan yakni phishing. Secara umum phishing dapat diartikan\nsebagai bentuk kejahatan digital yang bertujuan untuk mendapatkan data maupun informasi\nsensitif dari seseorang melalui email, pesan singkat atau situs website palsu yang dibuat mirip\ndengan sumber resminya (Putra, et al. 2022).\nBerdasarkan laporan yang disampaikan oleh Anti-Phishing Working Group (APWG) pada\nperiode kuartal ketiga tahun 2024 tercatat sebanyak 932.923 kasus serangan phishing yang\nterjadi di seluruh dunia, nilai yang tercatat ini 6% lebih tinggi dari serangan yang terjadi pada\nkuartal sebelumnya. Ancaman phishing saat ini memiliki banyak bentuk dan tersebar secara luas,\nbeberapa bentuknya berupa email, pesan singkat, telepon, bahkan dokumen yang secara sengaja\ndisebar untuk mengelabui calon korban. Dari bentuk-bentuk yang telah disebutkan, salah satu\njenis yang paling sering diterima yakni situs website (URL). Masyarakat secara umum masih\nsering melakukan klik pada sembarang tautan yang mengarah kepada situs web (URL)\nterindikasi phishing dan terkecoh dengan situs web palsu yang dibuat sangat mirip dengan situs\nweb asli untuk mencuri data banyak orang.\nBerbagai upaya telah dilakukan untuk mencegah pencurian data melalui situs web yang\nterindikasi phishing. Beberapa upaya yang telah dilakukan diantaranya, analisis sintaksis URL\ndan penggunaan daftar hitam (blacklist), namun kedua metode ini masih kurang efektif untuk\nmendeteksi phishing dikarenakan situs website yang sekarang beredar dibuat semirip mungkin\ndengan website resminya dan pendekatan blacklist tidak mampu mengenali tautan phishing baru\nyang belum terdaftar pada database (Mahalakshmi, et al. 2024). Selain itu, saat ini banyak dari\nantara situs website terindikasi phishing yang sudah menggunakan sertifikat keamanan yang sah\nsehingga menyebabkan semakin sulitnya untuk mendeteksi URL phishing dengan efektif dan\nsecara real-time.\nPenerapan metode machine learning dapat menjadi solusi yang lebih efektif untuk mendeteksi\nsitus website terindikasi phishing. Metode machine learning dinilai lebih mampu untuk\nmenganalisis pola yang kompleks, mudah beradaptasi dengan ancaman baru, memungkinkan\notomatisasi dan pemanfaatan berbagai sumber data. Beberapa penelitian telah berhasil dilakukan\nuntuk menerapkan machine learning sebagai metode untuk pendeteksian URL phishing.\nSalah satu metode machine learning yang digunakan untuk pendeteksian phishing adalah\nmetode klasifikasi yang bertujuan untuk mengkategorikan terhadap suatu URL terindikasi\nphishing atau tidak. Berbagai algoritma telah digunakan untuk proses pendeteksian URL\nphishing, seperti Support Vector Machine (SVM), Logistic Regression, XGBoost dan Random\nForest. Penelitian yang dilakukan oleh Sindhu et al. (2021), telah berhasil menunjukkan\npenerapan Random Forest, SVM dan Neural Network dengan Backpropagation mampu\nmendeteksi URL phishing dengan efektif.\nDari antara berbagai algoritma klasifikasi yang sudah diterapkan, algoritma Random Forest\nmerupakan salah satu algoritma yang telah banyak diterapkan dan terbukti efektif untuk\nmelakukan pendeteksian URL phishing. Berdasarkan penelitian yang dilakukan oleh Mahmud\n& Wirawan (2024) yang melakukan studi untuk membandingkan berbagai algoritma klasifikasi\nterhadap pendeteksian situs web phishing, diperoleh hasil bahwa Random Forest memberikan\nhasil yang paling baik dalam hal akurasi, presisi, dan recall diantara algoritma lainnya yang\ndigunakan. Hasil yang sama juga diperoleh dari penelitian yang dilakukan oleh Putri &\nWijayanto (2022) yang menunjukkan bahwa Random Forest memberikan performa terbaik\nuntuk mengklasifikasikan situs website terindikasi phishing atau tidak dibandingkan dengan\nalgoritma lainnya. Penelitian terhadap penggunaan Random Forest juga telah diimplementasikan\ndalam sistem yang nyata. Sistem website dibuat untuk memungkinkan pengguna memasukkan\nsitus web dan mendapatkan hasil deteksi secara otomatis (Harahap, et al. 2024)\nUntuk dapat meningkatkan performa pendeteksian situs web phishing dengan penerapan\nmachine learning, beberapa penelitian bahkan sudah menggabungkan metode klasifikasi dengan\nmetode lainnya. Penerapan metode aturan asosiasi (association rule mining) juga telah terbukti\nefektif digunakan untuk pendeteksian situs website terindikasi phishing. Teknik aturan asosiasi\ndigunakan untuk menemukan hubungan atau pola tersembunyi antar fitur-fitur dalam dataset.\nShawkat et al. (2021) mengembangkan algoritma Modified FP-Growth (MFP-Growth) yang\nlebih efisien dalam menemukan aturan asosiasi tanpa memerlukan pembentukan ulang\nconditional subtrees, sehingga lebih hemat waktu dan memori. Sementara itu, Tiwari & Arjariya\n(2021) membandingkan algoritma FP-Tree dan Apriori dalam mendeteksi phishing,\nmenemukan bahwa FP-Tree lebih unggul dalam hal efisiensi dan akurasi.\nKombinasi yang dilakukan antara aturan asosiasi dengan klasifikasi merupakan pendekatan yang\nmampu mengoptimalkan akurasi dan efektivitas model untuk menemukan pola atau hubungan\ntersembunyi dari data karena aturan asosiasi dapat menemukan keterkaitan antar fitur dalam\ndata, sementara itu klasifikasi akan menggunakan pola yang ditemukan tersebut untuk\nmemberikan hasil prediksi yang lebih akurat. Penelitian yang dilakukan oleh Lin & Gao (2021)\nmemanfaatkan aturan asosiasi untuk menyeleksi fitur dan interaksinya sebelum digunakan\ndalam algoritma klasifikasi. Hasilnya menunjukkan terjadinya peningkatan efisiensi serta\nakurasi model terutama untuk menangani dataset berukuran besar dan beragam jenis tugas\nklasifikasi. Penelitian lainnya yang mengembangkan metode Intelligent Association\nClassification (IAC) menggantikan ukuran support dan confidence dengan Harmonic Mean,\nsehingga mampu meningkatkan akurasi deteksi phishing (Al-Fayoumi, et al. 2020).\nBerdasarkan berbagai penelitian yang telah dilakukan, penulis mengusulkan penerapan\nkombinasi metode asosiasi dan klasifikasi dengan algoritma FP-Growth dan Random Forest\nuntuk mendeteksi situs web terindikasi phishing. Penulis memberikan judul untuk penelitian ini\n“Implementasi Algoritma FP-Growth dan Random Forest pada Sistem Pendeteksian URL\nPhishing”.\nPenelitian Terdahulu\nNo. Penulis Judul Tahun\nMustafa Al-\nFayoumi, Jaber\nIntelligent Association Classification\n1. Alwadian dan 2020\nTechnique for Phishing Website Detection\nMohammad\nAbusail\nMai Shawkat,\nMahmoud\nBadawi, Sally El-\nAn optimized FP growth algorithm for\n2. Ghamrawy, 2021\ndiscovery of association rules\nReham Arnous\ndan Ali El-\nDesoky\nManish Tiwari\nA Phishing URL Classification Technique\n3. dan Tripti 2021\nusing Machine Learning Approach\nArjariya\nDiscovering Categorical Main and\nQiuqiang Lin dan\n4. Interaction Effects Based on Association 2021\nChuanou Gao\nRule Mining\nSimitha Sindhu,\nArya Sreevalsan,\nSunil Phishing Detection using Random Forest,\n5. Parameshwar SVM and Neural Network with 2021\nPatil, Faiz Backpropagation\nRahman dan\nSaritha A. N\nNabila Bianca\nAnalisis Komparasi Algoritma Klasifikasi\nPutri dan Arie\n6 Data Mining dalam Klasifikasi Website 2022\nWahyu\nPhishing\nWijayanto\nAli Dongan\nHarahap, Didi Rancang Bangun Sistem Pendeteksi Link\n7 Juardi dan Agung Phishing Menggunakan Algoritma Random 2024\nSusilo Yuda Forest Berbasis Web\nIrawan\nAzzam Fawwaz\nDeteksi Phishing Website menggunakan\n8 Mahmud dan 2024\nMachine Learning Metode Klasifikasi\nSetia Wirawan\nKebaruan Penelitian:\nPenelitian mengenai pendeteksian URL phishing dengan metode machine learning telah banyak\ndilakukan, tetapi sebagian besar hanya menggunakan satu pendekatan, yaitu klasifikasi.\nKeterbatasan ini menyebabkan tidak adanya proses optimasi dalam pemilihan fitur atau analisis\nhubungan antar fitur dalam dataset. Di sisi lain, penelitian yang menerapkan aturan asosiasi telah\nmembuktikan kemampuannya dalam mengidentifikasi pola tersembunyi dalam URL phishing.\nAturan asosiasi bermanfaat karena dapat mengungkap keterkaitan antar fitur yang mungkin tidak\nterdeteksi oleh metode klasifikasi murni, sehingga memungkinkan pemodelan yang lebih\nmendalam terhadap karakteristik URL phishing. Namun, masih sedikit penelitian yang\nmenggabungkan aturan asosiasi dan klasifikasi, terutama dengan algoritma yang secara terpisah\nmenangani proses pencarian pola dan klasifikasi. Oleh karena itu, kombinasi kedua metode ini\ndiharapkan dapat menghasilkan sistem deteksi URL phishing yang lebih efektif dan akurat.\nRumusan Masalah Serangan phishing yang semakin canggih menjadi ancaman serius bagi keamanan siber,\nterutama melalui situs web (URL) yang menipu pengguna. Mengidentifikasi URL phishing\nmerupakan tantangan bagi para peneliti dan praktisi keamanan dalam mengembangkan sistem\ndeteksi yang lebih akurat dan andal. Berbagai metode berbasis machine learning telah\nditerapkan, tetapi akurasi dan efektivitasnya masih perlu ditingkatkan. Oleh karena itu,\ndiperlukan sistem yang mampu menemukan pola tersembunyi dalam data serta menghasilkan\nklasifikasi yang lebih tepat untuk mendeteksi phishing secara lebih optimal.\nMetodologi\nTahapan Penelitian:\n1. Data Collection\nTahapan awal yang dilakukan yakni pengumpulan data yang akan digunakan\nuntuk proses pendeteksian URL phishing. Data yang akan digunakan terdiri dari\ndua jenis data yakni dataset dan juga new data. Dataset merupakan data yang\nsudah diekstrak beserta dengan fitur-fitur yang akan digunakan untuk proses\npembuatan model, sementara new data merupakan data berupa masukan\nberbentuk tautan atau URL dari user yang nantinya akan dideteksi. Dataset yang\ndigunakan merupakan data tabular dengan nilai fiturnya berupa bilangan bulat\n(integer). Fitur-fitur yang terdapat dalam dataset merupakan fitur-fitur yang\nmencakup karakteristik suatu URL phishing, seperti panjang URL, usia domain,\nIP address dan fitur pendukung lainnya.\n2. Data Pre-processing\nSetelah data yang digunakan terkumpul, tahapan berikutnya adalah pre-\nprocessing data untuk memastikan data-data yang sudah terkumpul siap untuk\ndiproses lebih lanjut dalam analisis dan pelatihan model. Hal-hal yang dilakukan\ndalam preprocessing data yakni pengecekan nilai yang hilang (missing value),\nmenghilangkan data yang duplikat (duplicate), dan juga normalisasi. Selain itu,\nnantinya untuk data baru berupa tautan atau URL yang diberikan user akan\ndilakukan transformasi data untuk mengubah dan menyesuaikan URL tersebut\nsesuai dengan bentuk dan fitur dari dataset yang digunakan untuk pembuatan dan\npelatihan model.\n3. FP-Growth Algorithm\nAlgoritma Frequent Pattern-Growth (FP Growth) adalah salah satu jenis algoritma\nyang merupakan penerapan dari aturan asosiasi. Tujuan dari penggunaan FP-\nGrowth yakni untuk menemukan pola atau hubungan antar item yang ada di dalam\ndataset. FP-Growth membangun struktur seperti pohon yang akan mencari pola\nyang sering muncul tanpa melakukan iterasi berulang terhadap seluruh dataset.\nProses penerapan FP-Growth ini juga akan memberikan insight baru dari dataset\nyang digunakan sehingga memungkinkan untuk adanya penyesuaian fitur yang\nrelevan untuk digunakan atau penambahan fitur baru berdasarkan pola atau\nhubungan yang diperoleh melalui proses FP-Growth.\n4. Split Dataset\nSetelah dataset secara keseluruhan sudah disesuaikan dengan hasil dari algoritma\nFP-Growth, dataset tersebut akan dibagi menjadi dua subset utama, yakni training\ndataset dan juga testing dataset. Proses pembagian ini bertujuan agar model\nnantinya dapat belajar dari data tanpa adanya overfitting. Secara umum, beberapa\nrasio yang sering digunakan seperti 80:20 atau 70:30, di mana training dataset\nbernilai lebih besar dikarenakan akan digunakan untuk melatih model sementara\ntesting dataset digunakan untuk mengukur dan mengevaluasi kinerja model dari\nterhadap data yang belum digunakan sebelumnya.\n5. Random Forest Model\nModel Random Forest merupakan salah satu model klasifikasi dengan basis\npohon keputusan. Dengan training dataset yang sudah ditentukan sebelumnya,\nmodel ini dilatih untuk memberikan hasil deteksi terhadap tautan atau URL\nterindikasi phishing.\n6. Model Evaluate\nSetelah model dilatih dengan training dataset, kemudian model akan diuji dan di\nevaluasi dengan menggunakan testing dataset. Metrik evaluasi yang akan\ndigunakan diantaranya confusion matrix, akurasi, presisi, recall dan F1 score.\nSelain itu akan dilakukan juga pencarian terhadap Feature Importance dari\nkeseluruhan fitur dalam dataset untuk mengetahui seberapa besar pengaruh tiap\nfitur terhadap hasil yang dikeluarkan. Dari proses Model Evaluate yang dilakukan\nakan menghasilkan satu model yang merupakan model terbaik untuk mendeteksi\nURL phishing.\n7. Output\nSetelah model dievaluasi dan ditemukan model terbaik untuk mendeteksi,\nselanjutnya dilakukan proses deploy agar dapat digunakan untuk mendeteksi URL\nphishing secara real-time. Pada tahap ini data baru berupa tautan atau URL secara\nlangsung sudah dapat dijadikan sebagai inputan yang akan diproses untuk\nmenghasilkan deteksi. Hasil akhir yang ditampilkan yakni kategori deteksi berupa\nlegitimate, suspicious dan juga phishing.\nReferensi\nAl-Fayoumi, M., Alwidian, J., & Abusaif, M. (2020). Intelligent association\nclassification technique for phising website detection. The International Arab Journal of\nInformation Technology, 17(4), 488-496.\nAnti-Phising Working Group. (2024). Phishing activity trends (3Q\n2024). https://apwg.org/trendsreports/\nHarahap, A. D., Juardi, D., & Irawan, A. S. (2024). Rancang bangun sistem pendeteksi\nlink phishing menggunakan algoritma random forest berbasis web. Jurnal Informatika\ndan Teknik Terapan Elektro, 12(3), 2677-2686.\nLin, Q., & Gao, C. (2023). Discovering categorical main and interaction effects based on\nassociation rule mining. IEEE Transaction on Knowledge and Data Engineering, 35(2),\n1379-1390.",
  "similar_tokens": [
    "daftar",
    "mining",
    "mean",
    "akurat",
    "tiga",
    "masuk",
    "lapor",
    "growth",
    "journal",
    "mudah",
    "tentu",
    "an",
    "for",
    "c",
    "address",
    "ip",
    "mahasiswa",
    "information",
    "ubah",
    "learning",
    "harap",
    "bukti",
    "digital",
    "informasi",
    "m",
    "random",
    "support",
    "putri",
    "nali",
    "solusi",
    "network",
    "oleh",
    "realtime",
    "ganti",
    "interaksi",
    "jadi",
    "tuju",
    "svm",
    "aman",
    "n",
    "prediksi",
    "rules",
    "inputan",
    "luas",
    "latar",
    "deteksi",
    "agam",
    "lin",
    "tugas",
    "kerja",
    "nila",
    "jenis",
    "skripsi",
    "al",
    "telepon",
    "pengaruh",
    "langsung",
    "efisiensi",
    "hubung",
    "terima",
    "matrix",
    "rancang",
    "rumus",
    "iterasi",
    "seleksi",
    "output",
    "pesan",
    "integer",
    "data",
    "algoritma",
    "baik",
    "hemat",
    "utama",
    "tahap",
    "singkat",
    "vector",
    "tangan",
    "database",
    "relevan",
    "jurnal",
    "optimasi",
    "and",
    "f",
    "mampu",
    "teknik",
    "machine",
    "j",
    "karakteristik",
    "kombinasi",
    "model",
    "orang",
    "a",
    "sengaja",
    "kembang",
    "basis",
    "informatika",
    "tingkat",
    "studi",
    "sensitif",
    "dunia",
    "manfaat",
    "banyak",
    "tambah",
    "sistem",
    "rule",
    "value",
    "metode",
    "aju",
    "mohammad",
    "buat",
    "et",
    "temu",
    "terap",
    "cakup",
    "efektivitas",
    "pisah",
    "dekat",
    "dokumen",
    "bas",
    "otomatis",
    "serang",
    "atur",
    "no",
    "judul",
    "ukur",
    "catat",
    "arah",
    "masyarakat",
    "andal",
    "kategori",
    "email",
    "setia",
    "akurasi",
    "cegah",
    "metodologi",
    "murni",
    "teknologi",
    "engineering",
    "kolom",
    "klik",
    "testing",
    "memori",
    "dalam",
    "pilih",
    "main",
    "serta",
    "bulat",
    "sisi",
    "approach",
    "privasi",
    "dukung",
    "adaptasi",
    "upaya",
    "muncul",
    "activity",
    "sembarang",
    "normalisasi",
    "sesuai",
    "proses",
    "tulis",
    "situs",
    "gabung",
    "sebar",
    "web",
    "efisien",
    "knowledge",
    "technology",
    "ringkas",
    "referensi",
    "based",
    "bagi",
    "tampil",
    "krusial",
    "with",
    "keluar",
    "identifikasi",
    "performa",
    "the",
    "batas",
    "struktur",
    "pola",
    "sebab",
    "salah",
    "arti",
    "mirip",
    "analis",
    "asli",
    "ulang",
    "algorithm",
    "rasio",
    "cari",
    "evaluate",
    "optimal",
    "guna",
    "isi",
    "analisis",
    "using",
    "korban",
    "dasar",
    "baru",
    "nyata",
    "hasil",
    "putus",
    "milik",
    "dataset",
    "ajar",
    "d",
    "tantang",
    "uji",
    "of",
    "website",
    "iring",
    "metrik",
    "domain",
    "fitur",
    "on",
    "era",
    "bangun",
    "kumpul",
    "topik",
    "new",
    "kompleks",
    "international",
    "sumber",
    "neural",
    "nilai",
    "hilang",
    "implementasi",
    "putra",
    "kait",
    "efektif",
    "evaluasi",
    "s",
    "url",
    "bilang",
    "q",
    "banding",
    "user",
    "sulit",
    "unggul",
    "wahyu",
    "teliti",
    "sally",
    "bentuk"
  ],
  "filename": "1751531837_Exum_211402115.pdf",
  "user_id": 17
}