{
  "original_text": "FORM PENGAJUAN JUDUL\nNama : Dzakiy Dzakwan\nNIM 211402075\nJudul diajukan oleh* : Dosen Foto Terbaru\nMahasiswa\nBidang Ilmu (tulis dua bidang) : Data Science= a nd Inteligent System\nUji Kelayakan Judul** : Diterima Ditolak\nHasil Uji Kelayakan Judul :\nCalon Dosen Pembimbing I:\nIvan Jaya S.Si., M.Kom.\nCalon Dosen Pembimbing II:\nFanindia Purnamasari S.TI., M.IT\nMedan, 5 November 2024\nKa. Laboratorium Penelitian,\n* Centang salah satu atau keduanya (Fanindia Purnamasari S.TI., M.IT)\n** Pilih salah satu NIP. 198908172019032023\nRINGKASAN JUDUL YANG DIAJUKAN\nJudul / Topik KLASIFIKASI PROMOSI JUDI ONLINE PADA KOMENTAR SIARAN LANGSUNG\nSkripsi YOUTUBE MENGGUNAKAN ALGORITMA GATED RECURRENT UNIT\nLatar Belakang Latar Belakang\ndan Penelitian\nTerdahulu Platform siaran langsung telah merubah cara manusia dalam berkomunikasi dan\nberinteraksi secara langsung. Kemudahan mencari informasi, berkomunikasi hingga\nberinteraksi menjadikan platform siaran langsung sebagai salah satu hal tak bisa\nterpisahkan dari gaya hidup modern saat ini. Menurut data yang diberikan oleh\nhttps.statista.com YouTube, sebagai salah satu platform siaran langsung terpopuler,\nmencatat 2,504 miliar pengguna aktif bulanan pada April 2024. Namun dibalik berbagai\nmanfaat positif yang diberikan, platform siaran langsung tidak luput dari banyaknya\norang yang tidak bertanggung jawab dalam menyebarkan pesan negatif. Salah satunya\nadalah pemanfaatan komentar pada siaran langsung untuk mempromosikan judi online.\nJudi online (Judol) merupakan masalah besar yang sedang dihadapi oleh Indonesia\nsaat ini. Menurut Pusat Pelaporan dan Analisis Transaksi Keuangan (PPATK), terdapat\n2,37 juta penduduk yang terjerumus kedalam judi online dengan transaksi mencapai 600\ntriliun rupiah pada kuartal pertama tahun 2024. Bahkan Kepala Satuan Tugas\nPemberantasan Judi Online sekaligus Menteri Koordinator bidang Politik, Hukum dan\nKeamanan Hadi Tjahjanto menyebutkan bahwa sekitar 2 persen dari pemain\njudi online adalah anak di bawah umur atau kurang dari 10 tahun. Hal ini terjadi karena\nperubahan gaya hidup seseorang yang menginginkan sesuatu secara instan dan tingkat\nkebutuhan hidup yang meningkat (Hamid, 2024).\nAdapun dampak negatif yang dirasakan oleh pemain judi online terlihat dari segi\nekonomi, sosial masyarakat dan psikologis. Dari segi ekonomi pemain judi online akan\nmempertaruhkan semua hal yang dimilikinya agar terus bisa bermain hingga akhirnya\ntidak ada lagi harta yang dapat dipertaruhkan. Bahkan pemain judi online melakukan\nsegala cara seperti melakukan tindakan kriminal atau melakukan pinjaman online agar\ndia dapat terus bermain (Rohmah & Khodijah, 2024). Dari segi sosial pemain judi online\nbiasanya mengasingkan dirinya sendiri dari kehidupan bermasyarakat agar dapat lebih\nbanyak menghabiskan waktunya didepan layar untuk bermain judi online (Dash &\nHoward, 2024). Sementara itu dampak negatif judi online dari segi psikologis adalah\nkecanduan yang terus mendorong pemain untuk bermain dikarenakan rasa penasaran\nterhadap kemenangan di permainan selanjutnya. Hal tersebut dapat menyebabkan\nkecemasan, stress bahkan hingga depresi ketika pemain terus menerus kalah (Bakhtiar\n& Adilah, 2024).\nSalah satu faktor yang menyebabkan peningkatan pemain judi online adalah\nlingkungan yang sudah terbiasa melakukan judi online sehingga membuat individu lain\nterdorong untuk melakukan judi online (Krisna Murti et al., 2024). Selain itu\npengiklanan dan promosi judi online juga meningkatkan pemain judi online (Hing et al.,\n2014). Penelitian yang dilakukan oleh (Fathor et al., 2023) menghasilkan bahwa salah\nsatu faktor yang mendukung peningkatan pemain judi online di Indonesia adalah\nmaraknya promosi judi online di layanan jejaring sosial yang memperlihatkan beragam\nkeuntungan pada promosinya. Hal ini juga didukung dengan penelitian yang dilakukan\noleh (Jimmy & Sumarlan, 2024) yang menyatakan bahwa promosi judi online yang\nkerap dilakukan para influencer besar di salah satu layanan jejaring sosial seperti\nInstagram ataupun Youtube dapat memberikan dampak yang signifikan kepada\npengikutnya untuk terjerumus kedalam judi online.\nSaat ini banyak upaya yang telah dilakukan oleh pemerintah dalam mengatasi judi\nonline salah satunya adalah kampanye yang dilakukan oleh pemerintah mengenai\nbahaya judi online. Namun menurut (Estriana & Ratu, 2024) upaya tersebut dinyatakan\nbelum sepenuhnya efektif dikarenakan pesan yang disampaikan melalui kampanye\ntersebut tidak cukup memikat bagi para pemain judi online. Selain itu adapun usaha lain\nyang telah dilakukan adalah upaya mencegah dan memutuskan akses promosi yang\nmengandung unsur judi online di layanan jejaring sosial yang telah dilakukan oleh\nDittipidsiber Bareskrim Polri dan lembaga pemerintahan lainnya (Hendarto &\nHandayani, 2024). Pencegahan promosi judi online di layanan jejaring sosial ini\nmerupakan hal yang penting dikarenakan promosi judi online di layanan jejaring sosial\nmemiliki dampak yang signifikan terhadap perkembangan pemain judi online (Akbar et\nal., 2024). Namun sumber daya yang kurang memadai dan sulitnya mengumpulkan alat\nbukti menjadi kendala dalam proses memberantas judi online (Saputra & Pranoto, 2023).\nPemanfaatan teknologi machine learning berbasis Natural Languange Processing\n(NLP) dapat digunakan dalam mengidentifikasi pola teks tertentu yang mengindikasikan\nkonten dengan unsur promosi judi online di layanan jejaring sosial. Hal ini didukung\ndengan penelitian yang dilakukan oleh (Smith et al., 2023) dengan judul “Automatic\nDetection of Problem Gambling Sign from Online Text Using Large Language Models”.\nPada penelitian tersebut penulis melakukan pendeteksian teks online yang\nmengindikasikan perjudian menggunakan Bidirectional Encoder Representations from\nTransformers (BERT) model. Penelitian menghasil penggunaan BERT model dapat\nmencapai tingkat presisi sebesar 0,95 dengan skor F1 sebesar 0,71 dalam mendeteksi\nmasalah perjudian pada online teks. Hal tersebut menyimpulkan bahwa pemanfaatan\nteknologi machine learning layak digunakan dalam mengidentifikasi teks yang\nmengandung unsur promosi judi online di layanan jejaring sosial.\nAdapun beberapa penelitian sebelumnya mengenai pemanfaatan machine learning\ndalam mengidentifikasi konten negatif di platform layanan jejaring sosial dapat menjadi\ndasar untuk penelitian ini. Salah satunya adalah penelitian dengan judul “Analisis\nSentimen Twitter Menggunakan Machine Learning untuk Identifikasi Konten Negatif”\nyang dilakukan oleh (Saputra & Pranoto, 2023). Penelitian ini menerapkan model\nmachine learning Logistic Regression Model dan Naïve Bayes Classifier untuk\nmengklasifikasikan sentimen tweet pada platform Twitter. Penelitian ini menggunakan\ndataset yang diperoleh melalui platform Kaggle yang berfokus pada analisis sentiment\ntweet di platform layanan jejaring sosial Twitter. Penelitian ini menghasilkan\nkesimpulan bahwasannya model Logistic Regression memiliki tingkat akurasi yang\nlebih tinggi yaitu sebesar 68,5% dibandingkan model Naïve Bayes Clasifier dengan\ntingkat akurasi sebesar 63,1%.\nPenelitian dalam mendeteksi konten negatif juga pernah dilakukan pada tahun 2018\noleh (Zhang et al., 2018). Penelitian tersebut memperkenalkan metode baru dalam\nmendeteksi ujaran kebencian di Twitter menggunakan gabungan model antara\nConvolutional Neural Network (CNN) dan Gated Recurrent Unit (GRU). Hasil\npenelitian menunjukan bahwasannya metode gabungan tersebut dapat mengungguli\nmodel Support Vector Machine (SVM) dalam mendeteksi ujaran kebencian pada\nsebagian besar dataset yang digunakan. Kesimpulan dari\nTerakhir terdapat sebuah peneltian mengenai perbandingan 4 model dalam deep\nlearning yang digunakan untuk mengklasifikasikan sebuah teks. Penelitian yang\ndilakukan oleh (Muhammad Zulqarnain et al., 2023) pada tahun 2024 membandingkan\nperforma 4 buah model Deep Learning yaitu Deep Believe Network (DBN),\nConvolutional Neural Network (CNN), Gated Recurrent Unit (GRU) dan Long Short-\nTerm Memory (LSTM) dalam mengklasifikasikan sebuah teks. Hasil penelitian tersebut\nmenyimpulkan bahwa model GRU dan LSTM memiliki performa yang lebih baik\ndibandingkan dengan model DBN dan CNN. Model GRU dan LSTM pada penelitian\ntersebut memiliki perbandigan peforma dimana GRU memiliki peforma lebih tinggi\ndisebagian besar dataset dibandingkan dengan LSTM. Dapat disimpulkan bahwasannya\ndalam mengklasifikasikan sebuah teks GRU menjadi model deep learning dengan\npeforma terbaik disusul dengan LSTM.\nBerdasarkan penelitian dalam pengklasifikasian teks dan juga identifikasi konten\nnegatif yang ada pada platform layanan jejaring sosial sebelumnya. Penulis\nmengusulkan untuk menerapkan metode deep learning dengan model Gated Recurrent\nUnit (GRU) dalam mengidentifikasi konten yang mengandung unsur promosi judi online\nberbasis teks pada platform layanan jejaring sosial Twitter (X). Dengan begitu penelitian\nini diberi judul dengan “KLASIFIKASI PROMOSI JUDI ONLINE PADA\nKOMENTAR SIARAN LANGSUNG YOUTUBE MENGGUNAKAN ALGORITMA\nGATED RECURRENT UNIT” . Penelitian ini akan berfokus dalam menerapkan\nmachine learning untuk mengidentifikasi konten promosi judi online yang ada pada\nplatform layanan jejaring sosial.\nPenelitian Terdahulu\nNo. Penulis Judul Tahun\nA Hybrid Deep Learning GRU based\nEswara Poluru\n1. Approach for Text Classification using Word 2024\ndan Syed Husain\nEmbedding\nSocial Media Texts Classification and\n2. Tandon Ritesh Analysis Based on Large Language Models 2024\n(LLMs)\nImproving the Accuracy and Effectiveness\nof Text Classification Based on the\nEang Chanthol\n3. Integration of the Bert Model and a 2024\ndan Lee Seungjae\nRecurrent Neural Network\n(RNN_Bert_Based)\nSmith Elke, Automatic Detection of Problem-Gambling\n4. Reiter Nils dan Signs from Online Texts Using Large 2024\nPeters Jan Language Models\nMuhammad\nSam’an dan Hybrid Deep Learning Model for Youtube\n5. 2024\nKhrisna Spam Comment Detection\nImaddudin\nJuanda\nMochammad\nConstructing Gambling Reality: a Critical\nRizki,\n6. Multimodal Analysis on Online Gambling 2023\nKurniawan Eri\nAdvertisements\ndan\nHermawan Budi\nHannan Asrawi,\nLSTM and Bidirectional GRU Comparison\n7. Ema Utami dan 2023\nfor Text Classification\nAinul Yaqin\nMuhammad\nNazhif Abda\nPutera Khano, Sentiment Analysis With Long-Short Term\n7. Dewi Retno Sari, Memory (Lstm) and Gated Recurrent Unit 2023\nSaputro, Sutanto (Gru) Algorithms\ndan Wibowo\nAntoni\nMuhammad\nZulqarnain,\nRubab Sheikh,\nShahid Hussain,\nMuhammad\nText Classification Using Deep Learning\n8. Sajid, 2023\nModels: A Comparative Review\nSyed Naseem\nAbbas,\nMuhammad\nMajid dan\nUbaid Ullah\nChen Yang,\nAutomatic Detection of Pornographic and\nZheng Rongfeng,\nGambling Websites Based on Visual and\n9. Zhou Anmin, 2020\nTextual Content Using a Decision\nLiao Shan dan\nMechanism\nLiu Liang\nJohnson Kolluri,\nShaik Razia dan Text Classification Using Machine Learning\n10. 2020\nSoumya Ranjan and Deep Learning Models\nNayak\nMuhammad\nZulqarnain,\nRozaida Ghazali,\nEfficient Processing of GRU Based on\n11. Muhammad 2019\nWord Embedding for Text Classification\nGhulam Ghouse\ndan Muhammad\nFaheem Mushtaq\nZiqi Zhang,\nDetecting Hate Speech on Twitter Using a\nDavid Robinson\n12. Convolution-GRU Based Deep Neural 2018\ndan Jonathan\nNetwork\nTepper\nRumusan Masalah Kemudahan dalam berinteraksi secara langsung yang diberikan oleh platform siaran\nlangsung seperti Youtube menjadi salah satu alat yang digunakan oleh orang tidak bertanggung\njawab untuk menyebarkan konten negatif. Salah satunya adalah penyeberan promosi judi online\npada komentar siarang langsung. Hal ini dapat menyebabkan kekacauan dalam interaksi antara\npenonton dan pembuat konten. Selain itu, hal tersebut juga dapat meningkatkan jumlah pemain\njudi online. Biasanya untuk mencegah hal tersebut pembuat konten memberikan hak akses\nmoderator kepada beberapa penonton untuk menghapus komentar yang terindikasi sebagai\nkomentar judi online. Namun hal tersebut dirasa kurang efektif dan efisien dikarenakan\nketerbatasan kemampuan moderator manusia dalam memantau volume komentar dan variasi\nbahasa yang digunakan dalam promosi judi online. Oleh sebab itu diperlukan sebuah bot dengan\nhak akses moderator yang dapat mendeteksi dan menghapus komentar yang terindikasi sebagai\nkomentar promosi judi online.\nMetodologi\nGambar 1. Arsitektur Umum\n Data Collection\nDataset penelitian diperoleh melalui teknik crawling data terhadap komentar pada\nsiaran langsung YouTube dan cuitan di Twitter sebagai data tambahan. Data yang\ndiambil berfokus pada komentar ataupun cuitan dengan kalimat yang mengandung\nindikasi promosi judi online. Selain itu data yang diambil juga meliputi kalimat\nnetral sebagai kelompok kontrol. Tujuannya adalah untuk membangun model yang\ndapat secara akurat mengklasifikasikan komentar-komentar tersebut.\n Data Preprocessing\nData Preprocessing merupakan tahap untuk mempersiapkan data agar data lebih\nsiap untuk digunakan. Terdapat beberapa sub tahapan yang dilakukan pada tahap\npreprocessing. Berikut sub tahapan yang dilakukan pada tahap preprocessing:\n1. De Duplication\nProses menghilangkan data yang duplikat atau kembar dalam suatu dataset.\nTujuan utama dalam proses ini adalah untuk mengurangi noise dalam data dan\nmenghindari bias dalam analisis\n2. Labeling\nProses memberikan label pada setiap data. Dalam kasus penelitian ini data yang\nterindikasi mempromosikan judi online akan diberi label “1” sementara yang\nbukan akan diberi label “0”. Tujuan dari proses ini adalah untuk memudahkan\nmodel dalam mengklasifikasikan data.\n3. Case Folding\nProses mengubah semua huruf menjadi huruf kecil atau besar. Biasanya lebih\nsering dilakukan degan mengubah setiap karakter huruf menjadi huruf kecil.\nTujuan dari proses ini adalah untuk mengurangi variasi bentuk kata.\n4. Punctuation Removal\nProses menghapus tanda baca dari teks. Proses ini bertujuan untuk\nmempermudah proses tokenisasi.\n5. Stop Word Removal\nProses menghapus kata-kata tidak membawa banyak informasi. Proses ini\nbertujuan untuk mengurangi dimensi data dan meningkatkan efisiensi komputasi.\n6. Tokenization\nProses memecah teks menjadi unit-unit yang lebih kecil (token), biasanya kata\natau sub-kata. Proses ini bertujuan untuk penggunaan model berbasis kata\nataupun subkata\n Word Embedding\nTahapan ini merupakan tahapan untuk mengubah karakter kata kedalam bentuk\nvektor. Pada penelitian ini, model yang digunakan dalam pengaplikasian word\nembedding adalah IndoBERT\n Data Splitting\nSetelah data berhasil dibersihkan dan dipersiapkan pada tahap sebelumnya.\nSelanjutnya data akan dipecah menjadi 2 bagian yaitu data train dan data test. Data\ntrain digunakan untuk melatih model yang akan digunakan, sementara data test\ndigunakan untuk memvalidasi model yang sudah dilatih.\n Model Training\nProses pembentukan model dan pelatihan model menggunakan data test. Model\nakan dilatih agar dapat mengklasifikasi kalimat yang terindikasi sebagai kalimat\npromosi judi online dan kalimat netral. Model yang digunakan adalah penelitian ini\nadalah model Gated Recurrent Unit (GRU) yang merupakan salah satu model dalam\nmetode Deep Learning.\n Model Testing\nProses pengujian model yang sudah dibentuk dan dilatih. Pengujian dilakukan\ndengan memasukkan data test untuk melihat performa model yang telah dilatih.\n Output\nKeluaran yang diharapkan kepada model yang sudah diuji adalah identifikasi\nkalimat yang terindikasi dalam mempromosikan judi online dan kalimat yang bukan\npromosi judi online.\n Final Result\nHasil terakhir dari model yang sudah dibuat adalah implementasi model dalam\nbentuk Streambot Livechat Moderator yang dapat membatu mengelola kolom\nkomentar pada siaran langsung di platform youtube. Streambot diharapkan dapat\nmenghapus komentar secara otomatis terhadap komentar penonton yang terindikasi\ndalam mempromosikan judi online\nReferensi Akbar, M. Y., Pradekso, T., & Ulfa, N. S. (2024). PENGARUH TERPAAN IKLAN JUDI\nONLINE DI LAYANAN JEJARING SOSIAL , TINGKAT PENGAWASAN ORANG TUA ,\nDAN INTENSITAS ONLINE Ilmu Komunikasi , Fakultas Ilmu Sosial Dan Ilmu Politik ,\nUniversitas Diponegoro Minat masyarakat Indonesia dalam permainan judi online makin\nmeningk.\nBakhtiar, S. H., & Adilah, A. N. (2024). Fenomena Judi Online : Faktor, Dampak,\nPertanggungjawaban Hukum. Innovative: Journal Of Social Science Research, 4(3),\n1016–1026. https://doi.org/10.31004/innovative.v4i3.10547\nDash, M., & Howard, E. (2024). The Impact of Online Gambling on Mental Health in New\nZealand: A Comparative Study. International Journal of Scientific Research and\nManagement (IJSRM), 12(06), 1069–1080. https://doi.org/10.18535/ijsrm/v12i06.mp03\nEstriana, V., & Ratu, A. (2024). GOVERNMENT COMMUNICATION STRATEGIES IN. 3(10),\n662–670.\nFathor, K. A., Gani, F. P., & Saleh, M. Z. (2023). Fenomena Iklan Judi Online Pada Platform\nDigital Generasi Z Di Indonesia. OPTIMAL Jurnal Ekonomi Dan Manajemen, 4(1), 184–\n189. https://doi.org/10.55606/optimal.v4i1.2629\nHamid, A. (2024). Analisis kecanduan judi online di kalangan remaja masa kini. July.\nHendarto, D. H., & Handayani, R. S. (2024). Pencegahan Kejahatan Siber Terkait Distribusi\nPerjudian Online di Indonesia dalam Rangka Mewujudkan Keamanan dan Ketertiban\nMasyarakat. Jurnal Syntax Admiration, 5(5), 1542–1558.\nhttps://doi.org/10.46799/jsa.v5i5.1136\nHing, N., Cherney, L., Blaszczynski, A., Gainsbury, S. M., & Lubman, D. I. (2014). Do\nadvertising and promotions for online gambling increase gambling consumption? An\nexploratory study. International Gambling Studies, 14(3), 394–409.\nhttps://doi.org/10.1080/14459795.2014.903989\nJimmy, M. F. R., & Sumarlan, I. (2024). Audience Reception: Prevention of Online Gambling\nSite Advertisements Within The Scope of Instagram. Jurnal JTIK (Jurnal Teknologi\nInformasi Dan Komunikasi), 8(3), 619–626. https://doi.org/10.35870/jtik.v8i3.2151\nKrisna Murti, F., Haikal Muttaqin, M., & Saputra, R. (2024). Faktor Penyebab Maraknya Judi\nOnline Serta Upaya Pencegahannya Di Lingkungan Masyarakat. Jurnal Hukum Dan\nKewarganegaraan, 5(12), 1–7.\nMuhammad Zulqarnain, Rubab Sheikh, Shahid Hussain, Muhammad Sajid, Syed Naseem\nAbbas, Muhammad Majid, & Ubaid Ullah. (2023). Text Classification Using Deep\nLearning Models: A Comparative Review. Cloud Computing and Data Science, 80–96.\nhttps://doi.org/10.37256/ccds.5120243528\nRohmah, Y., & Khodijah, K. (2024). Resiko dan dampak sosial judi dan pinjaman online pada\nremaja. Dimensia: Jurnal Kajian Sosiologi, 13(1), 85–92.\nSaputra, M. Y. V., & Pranoto, E. (2023). Pencegahan Tindak Pidana Perjudian Online. (Jurnal\nHukum Dan Keadilan), 2(1), 20–30.\nSmith, E., Reiter, N., & Peters, J. (2023). Automatic detection of problem-gambling signs from\nonline texts using large language models. 1–26. http://arxiv.org/abs/2312.00804\nZhang, Z., Robinson, D., & Tepper, J. (2018). Detecting Hate Speech on Twitter Using a\nConvolution-GRU Based Deep Neural Network. In Lecture Notes in Computer Science\n(including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in\nBioinformatics): Vol. 10843 LNCS. Springer International Publishing.\nhttps://doi.org/10.1007/978-3-319-93417-4_48\nMedan, 5 November 2024\nMahasiswa yang mengajukan,\nDzakiy Dzakwan\n211402075",
  "similar_tokens": [
    "perintah",
    "centang",
    "test",
    "no",
    "bimbing",
    "atas",
    "international",
    "dampak",
    "h",
    "new",
    "main",
    "lembaga",
    "harap",
    "cnn",
    "latar",
    "bawa",
    "signifikan",
    "gani",
    "cari",
    "manfaat",
    "akses",
    "komunikasi",
    "agam",
    "sari",
    "online",
    "teknologi",
    "positif",
    "aman",
    "volume",
    "hilang",
    "efektif",
    "kembang",
    "siap",
    "tanda",
    "rumus",
    "resiko",
    "ringkas",
    "p",
    "uang",
    "daya",
    "liu",
    "pecah",
    "ambil",
    "tunjuk",
    "buat",
    "journal",
    "kumpul",
    "data",
    "pesan",
    "kelompok",
    "kandung",
    "salah",
    "akbar",
    "referensi",
    "oleh",
    "teks",
    "visual",
    "utama",
    "mahasiswa",
    "tugas",
    "de",
    "result",
    "performa",
    "increase",
    "baik",
    "svm",
    "bahasa",
    "bas",
    "hidup",
    "orang",
    "fokus",
    "uji",
    "deteksi",
    "ssi",
    "laboratorium",
    "bot",
    "identifikasi",
    "sebab",
    "sumber",
    "milik",
    "anak",
    "had",
    "otomatis",
    "habis",
    "dataset",
    "kurang",
    "ilmu",
    "e",
    "neural",
    "kendala",
    "lapor",
    "medan",
    "s",
    "implementasi",
    "websites",
    "dorong",
    "kolom",
    "kepala",
    "banyak",
    "system",
    "pola",
    "large",
    "l",
    "memory",
    "pilih",
    "final",
    "teliti",
    "manusia",
    "optimal",
    "akurat",
    "persen",
    "terus",
    "stress",
    "al",
    "bidang",
    "health",
    "and",
    "jadi",
    "teknik",
    "rizki",
    "alat",
    "hadap",
    "intensitas",
    "i",
    "tingkat",
    "kait",
    "communication",
    "rubah",
    "bukti",
    "nave",
    "untung",
    "study",
    "effectiveness",
    "digital",
    "model",
    "of",
    "judul",
    "bentuk",
    "deep",
    "language",
    "text",
    "fakultas",
    "keluar",
    "lingkung",
    "dalam",
    "batas",
    "hapus",
    "support",
    "natural",
    "algoritma",
    "management",
    "masyarakat",
    "hybrid",
    "hindar",
    "masuk",
    "improving",
    "langsung",
    "ubah",
    "n",
    "aju",
    "jurnal",
    "metode",
    "et",
    "huruf",
    "universitas",
    "dewi",
    "efisien",
    "on",
    "layan",
    "arsitektur",
    "tanggung",
    "faktor",
    "pengaruh",
    "f",
    "impact",
    "gabung",
    "nd",
    "platform",
    "batu",
    "media",
    "y",
    "output",
    "mudah",
    "balik",
    "layak",
    "fenomena",
    "analisis",
    "putus",
    "tuju",
    "akurasi",
    "butuh",
    "artificial",
    "segi",
    "cegah",
    "harta",
    "pisah",
    "upaya",
    "simpul",
    "kaji",
    "baca",
    "terima",
    "bersih",
    "buah",
    "aplikasi",
    "mana",
    "luput",
    "t",
    "v",
    "utami",
    "ka",
    "testing",
    "z",
    "distribusi",
    "tahap",
    "problem",
    "computer",
    "tua",
    "cloud",
    "label",
    "analysis",
    "proses",
    "with",
    "tindak",
    "adi",
    "the",
    "populer",
    "sub",
    "x",
    "liput",
    "muhammad",
    "nama",
    "kontrol",
    "sosial",
    "metodologi",
    "ii",
    "an",
    "tambah",
    "komputasi",
    "mampu",
    "modern",
    "using",
    "case",
    "do",
    "unggul",
    "tulis",
    "variasi",
    "research",
    "review",
    "computing",
    "r",
    "individu",
    "unit",
    "k",
    "dukung",
    "nip",
    "pinjam",
    "ratu",
    "duduk",
    "learning",
    "intelligence",
    "terap",
    "banding",
    "guna",
    "j",
    "kelola",
    "dosen",
    "usaha",
    "from",
    "juta",
    "based",
    "sebar",
    "pantau",
    "approach",
    "skor",
    "menang",
    "bangun",
    "manajemen",
    "catat",
    "hasil",
    "informasi",
    "ikut",
    "capai",
    "memvalidasi",
    "foto",
    "accuracy",
    "bahaya",
    "bagi",
    "indonesia",
    "nyata",
    "science",
    "vector",
    "ekonomi",
    "dasar",
    "gambar",
    "m",
    "d",
    "form",
    "machine",
    "efisiensi",
    "satu",
    "baru",
    "in",
    "a",
    "network",
    "skripsi",
    "pusat",
    "sulit",
    "topik",
    "aktif",
    "token",
    "interaksi",
    "bayes",
    "kenal",
    "for",
    "konten",
    "mkom",
    "budi"
  ],
  "filename": "1751526947_Exum_211402075.pdf",
  "user_id": 17
}