{
  "original_text": "FORM PENGAJUAN JUDUL\nNama : Indah Safitri\nNIM : 201402006\nJudul diajukan oleh* : Dosen\nMahasiswa\nBidang Ilmu (tulis dua bidang) : 1 . D at a S c i e n =c e and Intelligent System\n2. Multimedia\nUji Kelayakan Judul** : Diterima Ditolak\nHasil Uji Kelayakan Judul :\nCalon Dosen Pembimbing I:\nParaf Calon Dosen Pembimbing I\n(Jika judul dari dosen maka dosen tersebut berhak menjadi pembimbing I)\nCalon Dosen Pembimbing II:\nMedan, ......................................\nKa. Laboratorium Penelitian,\n* Centang salah satu atau keduanya (..................................................)\n** Pilih salah satu NIP.\nRINGKASAN JUDUL YANG DIAJUKAN\n*Semua kolom di bawah ini diisi oleh mahasiswa yang sudah mendapat judul\nJudul / Topik IMPLEMENTASI ALGORITMA A-STAR PADA ROLE PLAYING GAME\nSkripsi (RPG) BASED LEARNING DENGAN TEMA SEJARAH KEMERDEKAAN\nINDONESIA\nLatar Belakang Latar Belakang\ndan Penelitian\nTerdahulu Pendidikan sejarah memiliki peran yang sangat penting dalam membentuk nasionalisme\ndan memupuk rasa cinta tanah air. Sejarah Indonesia memiliki makna yang mendalam,\nmengandung nilai-nilai dan kekayaan budaya yang mencerminkan jati diri bangsa\nIndonesia. Dengan memahami sejarah, generasi muda Indonesia dapat menjelajahi lebih\ndalam asal-usul bangsa dan menghargai pengorbanan para pahlawan yang berjuang\ndengan gigih demi kemerdekaan Indonesia. Oleh karena itu, pendidikan sejarah di\nIndonesia seharusnya tidak hanya berfungsi sebagai pengetahuan akademis semata,\ntetapi juga sebagai sarana untuk meningkatkan kebanggaan dan penghargaan terhadap\nidentitas national, mengajarkan pemahaman mendalam mengenai permasalahan sosial,\nmeningkatkan kemampuan berpikir kritis, dan membangun kesadaran politik.\nMeskipun demikian, keberhasilan metode pembelajaran dalam mencapai tujuan ini\nmasih menjadi tantangan. Tantangan ini disebabkan oleh ketidaksesuaian metode\npembelajaran dengan perubahan dinamika pembelajaran dan perkembangan teknologi.\nImplementasi sistem pembelajaran sampai saat ini masih terpaku pada metode\npengajaran yang bersifat statis dan konvensional. Statis berarti tidak adanya perubahan\ndalam pendekatan pembelajaran dari waktu ke waktu, yang hanya terpaku pada metode\nkonvensional seperti ceramah dan mendengarkan. Sistem pembelajaran yang statis dan\nkonvensional menyebabkan siswa kurang meresapi nilai sejarah, bahkan setelah\nmempelajari pendidikan sejarah di sekolah. Kejenuhan terhadap pembelajaran yang\nmonoton, mengakibatkan siswa terlibat dalam aktivitas pasif seperti mendengarkan,\nmencatat, dan menghafal materi yang disampaikan oleh guru sehingga hasil\npembelajaran menjadi tidak maksimal.\nTantangan ini tidak hanya berdampak pada siswa, melainkan juga merambah ke\nberbagai lapisan masyarakat. Kurangnya ketertarikan untuk mempelajari dan memahami\nsejarah dapat memperkuat persepsi bahwa pembelajaran sejarah adalah kegiatan yang\nmembosankan dan kurang menarik. Akibatnya, pemahaman terhadap nilai-nilai sejarah\nmenjadi terbatas, dan masyarakat pada umumnya cenderung bersikap apatis terhadap\nwarisan sejarah Indonesia. Berbagai tantangan ini tentunya memerlukan perhatian lebih\nlanjut, oleh karena itu terdapat urgensi untuk mengembangkan metode pembelajaran\nyang bersifat dinamis dan interaktif untuk mengakomodasi perubahan dinamika\npembelajaran dan perkembangan teknologi.\nGame based learning sebagai bagian dari multimedia dengan menggabungkan unsur\npermainan atau game dalam proses pembelajaran dapat menjadi suatu langkah inovatif\nuntuk mengatasi tantangan tersebut. Melalui penggabungan materi pembelajaran sejarah\ndengan elemen permainan, game based learning mampu menciptakan pengalaman\nbelajar yang lebih interaktif dan menarik. Pendekatan ini juga dapat digunakan sebagai\nmedia pembelajaran yang dapat menciptakan daya tarik baru untuk mempelajari sejarah\ndi berbagai kalangan usia.\nTerdapat beberapa penelitian terdahulu terkait manfaat penggunaan game-based\nlearning dalam pembelajaran sejarah seperti penelitian yang berjudul “Penggunaan\nTeknik Game-based Learning dalam Pembelajaran Sejarah dan Dampaknya Terhadap\nMinat Belajar Siswa” oleh Nur Aoliyah (2023), hasil penelitiannya menunjukkan bahwa\npenggunaan game-based learning memiliki dampak positif yang signifikan dalam\nproses pembelajaran sejarah. Game-based learning juga dapat meningkatkan minat\nbelajar, tingkat partisipasi, pemahaman konsep dan motivasi intrinsik siswa. Penelitian\nsejenis juga dilakukan oleh Khuda Bakhsh, et al (2022), hasil penelitian yang berjudul\n“Effectiveness of Digital Game-based Learning Strategy in Higher Educational\nPerspectives” menunjukkan bahwa penggunaan digital game-based learning dapat\nmeningkatkan learning skills dan critical thinking skills siswa, serta meningkatkan\npartisipasi siswa dalam proses pembelajaran.\nSelain itu, penelitian terkait penggunaan game based learning dengan tema sejarah\nIndonesia juga telah banyak dilakukan. Dua dari penelitian-penelitian terkait antara\nlain adalah penelitian yang berjudul “Game Edukasi Sejarah Indonesia sebagai Media\nPembelajaran Berbasis Android” yang diteliti oleh Gemala Wahyu Ningsih (2020),\ndan penelitian yang berjudul “GSI (Game Sejarah Indonesia) dari Masa Penjajahan\nsampai Masa Kemerdekaan Indonesia berbasis Android” yang diteliti oleh Bambang\nPudjoatmodjo, et al (2016). Hasil penelitian keduanya cukup mirip yaitu game yang\nberisi materi sejarah berbentuk cerita panjang dan kuis multiple choice. Berdasarkan\npenelitian-penelitian terdahulu tersebut, penulis menganalisis bahwa penelitian-\npenelitian tersebut tidak dapat memberikan pemahaman mendalam terhadap nilai-\nnilai sejarah karena penyajian materi masih sama dengan metode konvensional.\nSehingga, berdasarkan latar belakang tersebut penulis mengajukan sebuah penelitian\ndengan menerapkan game-based learning dengan jenis Role Playing Game (RPG). RPG\ndapat memberikan pengalaman pembelajaran sejarah menjadi lebih interaktif dan\nmendalam, memungkinkan player untuk terlibat dalam sejarah, mengambil keputusan,\ndan merasakan tantangan yang dihadapi pada waktu itu. Selain itu, penggunaan elemen\npermainan seperti poin, tingkat kesulitan, dan tantangan dapat membuat pembelajaran\nmenjadi lebih menarik dan tidak membosankan. Hal ini juga dibuktikan oleh penelitian\ndari Ana Fatwatush, et al (2022) yang berjudul “Role-Playing Game (RPG) to Increase\nStudent’s Learning Motivation”. Dengan demikian, penulis mengajukan judul penelitian\n“Implementasi Algoritma A Star pada Role Playing Game (RPG) Based Learning\ndengan Tema Sejarah Kemerdekaan Indonesia”.\nPada game ini, player akan memasuki periode penjajahan hingga kemerdekaan\nIndonesia. Untuk memperoleh informasi terkait periode tersebut, player diharuskan\nberinteraksi dengan character lain termasuk tokoh pahlawan. Player akan diberikan\nbeberapa misi dan reward berupa informasi. Salah satu misinya adalah player akan\nmencari dokumen penting yang ditahan oleh penjajah di suatu markas yang berbentuk\nlabirin. Player harus menyelinap dan menghindari penjajah untuk mendapatkan\ndokumen tersebut. Algoritma A-Star diterapkan pada karakter penjajah untuk mengejar\ndan menangkap player jika ketahuan menyusup.\nPenelitian Terdahulu\nNo Penulis Judul Tahun\nPenggunaan Teknik Game-Based\nLearning dalam Pembelajaran Sejarah\n1. Nurlutfi Aoliyah 2023\ndan Dampaknya terhadap Minat Belajar\nSiswa\nKhuda Bakhsh,\nMuhammad\nHafeez,\nEffectiveness of Digital Game Based\nShumaila\n2. Learning Strategy in Higher Educational 2022\nShahzad, Bushra\nPerspectives\nNaureen,\nMuhammad\nFaisal Farid\nAna Fatwatush\nSholichah,\nGunarhadi Role-Playing Game (RPG) to Increase\n3. 2022\nGunarhadi, Student’s Learning Motivation\nAkhmad Arif\nMusadad\nSetiyani, Sri\nSumawarti, The Incredible boong gi: Educational\n4 Laela Sagita, game RPG for mathematical 2021\nDzaki understanding ability\nFadhlurrohman\nGemala Wahyu Game Edukasi Sejarah Indonesia sebagai\n5 2020\nNingsih Media Pembelajaran Berbasis Android\nHendi Implementasi Algoritma A-Star pada\n6 Hermawan, Hari Permainan Komputer Roguelike 2019\nSetiyani Berbasis Unity\nBambang\nPudjoatmodjo,\nAmir Hasanudin\nGSI (Game Sejarah Indonesia) dari Masa\nFauzi, Adam\n7 Penjajahan sampai Masa Kemerdekaan 2016\nKhairul Ikhwan,\nIndonesia berbasis Android\nIndah Wahyu\nLestari, Rizal\nWidiatmaja\nRizki Elanda, Permainan Edukatif Sejarah Perjuangan\nSiska Komala Mempertahankan Kemerdekaan\n8 2016\nSari, Wahyu Indonesia di Surabaya dan Yogyakarta\nHidayat Menggunakan RPG Maker\nRumusan Pembelajaran Sejarah Indonesia hingga saat ini masih menggunakan metode pengajaran\nMasalah yang bersifat statis dan konvensional. Statis berarti tidak adanya perubahan dalam\npendekatan pembelajaran dari waktu ke waktu, yang hanya terpaku pada metode\nkonvensional seperti ceramah dan mendengarkan. Sehingga, siswa cenderung\nmengalami pembelajaran yang monoton dan hanya terlibat dalam aktivitas pasif seperti\nmendengarkan, mencatat, dan menghafal materi yang disampaikan oleh guru. Hal ini\ntentunya berdampak pada hasil pembelajaran yang kurang maksimal dan pemahaman\nterhadap nilai-nilai sejarah pun menjadi terbatas. Oleh karena itu, dibutuhkan metode\npembelajaran Pendidikan Sejarah Indonesia yang bersifat dinamis dan interaktif dengan\npemanfaatan teknologi untuk meningkatkan pemahaman dan hasil pembelajaran sejarah\nIndonesia.\nMetodologi\nMetodologi penelitian yang digunakan adalah Multimedia Development Life Cycle\n(MDLC) sesuai dengan pendapat (Luther, 1994), yaitu suatu pendekatan yang\nterstruktur dengan tahap-tahap berikut :\n1. Concept\nPada tahap ini dilakukan perancangan konsep untuk menentukan ide dasar\ngame secara keseluruhan. Baik itu dalam menentukan target user, tujuan\npengembangan game, jenis game, cerita yang akan disajikan, karakter, dan\nplatform yang digunakan.\n2. Design\nPada tahap ini dilakukan perancangan storyboard. Storyboard game adalah\nserangkaian ilustrasi atau gambar yang disusun secara berurutan untuk\nmenceritakan alur cerita dan perkembangan permainan.\n3. Collecting Concept Materials\nTahap berikutnya adalah pengumpulan bahan atau elemen-elemen yang\nakan digunakan, termasuk pembuatan character, background, audio,\nsound effect, dan lainnya yang dapat dibuat sendiri atau dengan cara\npemanfaatan material dan asset yang sudah disediakan oleh game engine\nyang digunakan.\n4. Assembly\nPada tahap ini, seluruh material dan asset yang sudah dibuat digabungkan\nsecara bersamaan untuk membuat sebuah sistem multimedia.\n5. Testing\nPada tahap pengujian, sistem akan diuji secara teknis dan fungsional.\nTujuan dari pengujian ini adalah untuk memastikan bahwa sistem dapat\ndigunakan dan berjalan dengan baik serta sistem yang dirancang sesuai\ndengan tujuan pengembangannya.\n6. Distribution\nTahap terakhir adalah distribution, pada tahap ini sistem akan\ndidistribusikan. Distribusi sistem dapat dilakukan menggunakan flashdisk,\ndrive, ataupun online di internet via browser.\nReferensi\nAoliyah, N. 2023. Penggunaan Teknik Game-Based Learning Dalam\nPembelajaran Sejarah dan Dampaknya Terhadap Minat Belajar Siswa.\nKala Manca: Jurnal Pendidikan Sejarah, 11(1), pp. 31–36.\nBakhsh, K., et al. 2022. Effectiveness of Digital Game Based Learning Strategy in\nHigher Educational Perspectives. Journal of Education and e-Learning\nResearch, 9(4), pp. 258–268.\nElanda, R., Sari, S. & Hidayat, W. 2016. Permainan Edukatif Tentang Sejarah\nPerjuangan Mempertahankan Kemerdekaan Indonesia di Surabaya dan\nYogyakarta Menggunakan RPG Maker.\nHermawan, H. & Setiyani, H. 2019. Implementasi Algoritma A-Star Pada\nPermainan Komputer Roguelike Berbasis Unity. Jurnal Algoritma, Logika\ndan Komputasi, 2(1).\nNingsih, G. 2020. Game Edukasi Sejarah di Indonesia Sebagai Media\nPembelajaran Berbasis Android.\nPudjoatmodjo, B., et al. 2016. Game Sejarah Indonesia (GSI) : Game Tentang\nSejarah Indonesia dari Masa Penjajahan Sampai Kemerdekaan Indonesia\nBerbasis Android.\nSetiyani, S., et al. 2021. The incredible boong gi: Educational game RPG for\nmathematical understanding ability. International Journal of Education\nand Learning, 3(2), pp. 76–93.\nSholichah, A.F., Gunarhadi, G. & Musadad, A.A. 2022. Role-Playing Game\n(RPG) to Increase Student’s Learning Motivation. Journal of Education\nTechnology, 6(4), pp. 694–703.\nMedan, ......................................\nMahasiswa yang mengajukan,\n( Indah Safitri )\nNIM. 201402006",
  "similar_tokens": [
    "journal",
    "tantang",
    "sikap",
    "sama",
    "ajar",
    "collecting",
    "dekat",
    "kait",
    "tarik",
    "nilai",
    "teliti",
    "w",
    "dinamis",
    "salah",
    "of",
    "khairul",
    "national",
    "peran",
    "n",
    "ilustrasi",
    "a",
    "multiple",
    "hindar",
    "nama",
    "tingkat",
    "choice",
    "to",
    "b",
    "air",
    "pilih",
    "analis",
    "statis",
    "metodologi",
    "harga",
    "rancang",
    "form",
    "development",
    "kumpul",
    "students",
    "struktur",
    "kurang",
    "hak",
    "siswa",
    "sari",
    "mampu",
    "platform",
    "dosen",
    "motivasi",
    "rizki",
    "hadap",
    "terima",
    "teknik",
    "ana",
    "design",
    "intelligent",
    "mahasiswa",
    "teknologi",
    "informasi",
    "giat",
    "atas",
    "fungsi",
    "signifikan",
    "international",
    "engine",
    "ide",
    "usia",
    "milik",
    "ability",
    "langkah",
    "at",
    "didik",
    "reward",
    "ilmu",
    "manfaat",
    "kalang",
    "identitas",
    "putus",
    "star",
    "sri",
    "konvensional",
    "bangun",
    "alur",
    "yogyakarta",
    "interaksi",
    "et",
    "role",
    "kandung",
    "dapat",
    "via",
    "oleh",
    "batas",
    "alami",
    "maker",
    "implementasi",
    "sarana",
    "maksimal",
    "gambar",
    "target",
    "medan",
    "kolom",
    "s",
    "kembang",
    "capai",
    "terap",
    "masyarakat",
    "ubah",
    "ancang",
    "persepsi",
    "minat",
    "testing",
    "uji",
    "adam",
    "sedia",
    "masalah",
    "positif",
    "g",
    "in",
    "teknis",
    "paham",
    "metode",
    "effectiveness",
    "media",
    "main",
    "hasil",
    "komputasi",
    "internet",
    "cinta",
    "fauzi",
    "algoritma",
    "akibat",
    "h",
    "fungsional",
    "bukti",
    "ii",
    "jenis",
    "ringkas",
    "guru",
    "system",
    "tentu",
    "unity",
    "logika",
    "cerita",
    "muhammad",
    "pahlawan",
    "jurnal",
    "wahyu",
    "and",
    "kritis",
    "nip",
    "based",
    "the",
    "i",
    "nim",
    "tari",
    "ka",
    "laboratorium",
    "lestari",
    "gabung",
    "rumus",
    "online",
    "research",
    "pasuk",
    "nur",
    "tuju",
    "understanding",
    "proses",
    "bas",
    "sistem",
    "skripsi",
    "al",
    "dasar",
    "buat",
    "bidang",
    "r",
    "tahan",
    "latar",
    "dokumen",
    "sebab",
    "alam",
    "tahap",
    "juang",
    "pikir",
    "sulit",
    "dalam",
    "indonesia",
    "kuat",
    "effect",
    "android",
    "jalan",
    "layak",
    "d",
    "e",
    "ningsih",
    "susun",
    "c",
    "k",
    "ambil",
    "aju",
    "dampak",
    "calon",
    "cenderung",
    "sekolah",
    "pp",
    "for",
    "browser",
    "komputer",
    "education",
    "perhati",
    "referensi",
    "isi",
    "libat",
    "user",
    "judul",
    "guna",
    "technology",
    "centang",
    "no",
    "butuh",
    "sifat",
    "distribusi",
    "sadar",
    "cycle",
    "bentuk",
    "bahan",
    "cari",
    "bimbing",
    "sesuai",
    "elemen",
    "astar",
    "rurut",
    "dengar",
    "cipta",
    "interaktif",
    "daya",
    "learning",
    "konsep",
    "topik",
    "bangsa",
    "digital",
    "life",
    "tulis",
    "tahu",
    "saji"
  ],
  "filename": "1751798979_1751666108_Exum_201402006.pdf",
  "user_id": 17
}