{
  "original_text": "RINGKASAN JUDUL YANG DIAJUKAN\nJudul / Topik Skripsi Implementasi IndoBERT dan Transformer Encoder untuk Deteksi Ulasan Palsu pada E-Commerce\nTokopedia Berbasis Analisis Tekstual dan Perilaku Reviewer.\nLatar Belakang dan Latar Belakang\nPenelitian Terdahulu\nDalam beberapa tahun terakhir, sektor e-commerce di Indonesia telah mengalami pertumbuhan yang pesat.\nFaktor utama yang mendorong pertumbuhan ini adalah meningkatnya penetrasi internet, perubahan pola\nkonsumsi masyarakat, serta kemudahan akses terhadap layanan digital (Berijalan, 2025). Selain itu, strategi\npemasaran seperti pemberian diskon dan program gratis ongkir juga berperan signifikan dalam\nmeningkatkan loyalitas pelanggan (Manalu, et al., 2025). Platform e-commerce kini tidak hanya menjadi\ntempat transaksi jual beli, tetapi juga menghadirkan fitur inovatif seperti live shopping, sistem rekomendasi\nberbasis kecerdasan buatan (AI), serta integrasi dengan layanan logistik yang lebih efisien. Transformasi\nini tidak hanya menguntungkan konsumen, tetapi juga membuka peluang bagi Usaha Mikro, Kecil, dan\nMenengah (UMKM) untuk menjangkau pasar yang lebih luas melalui ekosistem e-commerce yang\nmendukung pemasaran digital, transaksi daring, dan distribusi yang lebih efisien.\nShopee, Tokopedia, dan TikTok Shop merupakan tiga platform e-commerce yang paling banyak digunakan\ndi Indonesia, dengan jumlah pengguna dan transaksi yang terus meningkat setiap tahunnya. Data dari\nDataboks (2024a) menunjukkan bahwa Shopee menjadi platform dengan jumlah kunjungan tertinggi,\nmencapai 237 juta kunjungan per bulan pada September 2023, meningkat sekitar 38% dibandingkan awal\ntahun. Selain itu, pada tahun 2022, Shopee membukukan Gross Merchandise Value (GMV) sebesar Rp718\ntriliun, menjadikannya salah satu platform dengan nilai transaksi terbesar di Indonesia (Databoks, 2024c).\nSementara itu, Tokopedia, yang telah berintegrasi dengan TikTok Shop, mencatat 88,9 juta kunjungan\nbulanan pada bulan yang sama. TikTok Shop, sebagai platform social commerce, memiliki 125 juta\npengguna aktif bulanan di Indonesia setelah merger dengan Tokopedia, dengan total 21 juta penjual yang\nberoperasi di dalamnya (Databoks, 2024c).\nPertumbuhan pesat platform e-commerce sejalan dengan perubahan perilaku konsumen dalam berbelanja\nonline. Banyaknya pilihan di marketplace digital, konsumen menjadi lebih selektif, dan ulasan pembeli\nmenjadi faktor utama dalam mengambil keputusan pembelian. Data SOCO (2024) menunjukkan bahwa\n77% konsumen Indonesia membaca ulasan sebelum membeli. Namun, tingginya pengaruh ulasan\ndimanfaatkan oleh oknum penjual yang membayar pihak tertentu untuk membuat ulasan palsu guna\nmeningkatkan rating produk mereka atau menjatuhkan pesaing. Di Indonesia, terdapat banyak layanan\nberbayar yang menawarkan jasa ulasan palsu, layanan ini tersedia dengan harga bervariasi, mulai dari\nRp25.000 untuk 5 produk hingga Rp66.000 untuk 15 produk (Septiani, 2023). Prosesnya melibatkan\nkomunikasi, kesepakatan konten ulasan, pembayaran, hingga unggahan ulasan palsu oleh penyedia jasa.\nUlasan palsu atau fiktif dapat dihasilkan melalui dua metode utama. Metode pertama melibatkan\nperekrutan individu untuk menulis ulasan berdasarkan skrip tertentu. Dalam kasus ini, para penulis ulasan\nsering kali tidak pernah melihat produk aslinya, tetapi tetap memberikan ulasan berbayar. Sementara itu,\nmetode kedua menggunakan teknologi berbasis komputer, seperti otomatisasi teks, untuk menghasilkan\nulasan palsu secara otomatis (Mohawes et al., 2021). Secara konvensional, jumlah ulasan berbayar yang\nditulis oleh manusia terbatas, dan pemilik perusahaan hanya dapat mempekerjakan sejumlah kecil\npenyebar spam untuk memposting ulasan palsu. Namun, kemajuan pesat dalam pembelajaran mesin\n(machine learning) dan pemrosesan bahasa alami (natural language processing atau NLP) telah\nmemungkinkan pengembangan algoritma canggih yang dapat menghasilkan ulasan palsu dalam jumlah tak\nterbatas dengan kecepatan jauh lebih tinggi dibandingkan manusia (Yin et al., 2021).\nUlasan palsu telah menjadi masalah serius di era digital. Keberadaannya tidak hanya mengancam keaslian\nlingkungan belanja online, tetapi juga menyesatkan pengguna serta berdampak negatif terhadap reputasi\npenjual dan platform e-commerce (Sun et al., 2024). Selain itu, ulasan palsu dapat merusak kepercayaan\nkonsumen terhadap sistem rating dan rekomendasi produk, menyebabkan skeptisisme yang lebih tinggi\ndalam proses pengambilan keputusan pembelian (Peña-García et al., 2024). Dampak lainnya adalah\nterdistorsinya peringkat produk akibat manipulasi algoritma pencarian di platform e-commerce, yang dapat\nsecara tidak adil menguntungkan atau merugikan suatu bisnis (Golrezaei et al., 2020). Secara ekonomi,\nulasan palsu juga dapat menyebabkan penurunan pendapatan bagi perusahaan, di mana penelitian\nmenunjukkan bahwa penurunan satu bintang dalam peringkat suatu merek dapat mengakibatkan penurunan\npendapatan sebesar 5-9% (TUFAIL et al., 2022).\nSeriusnya masalah ulasan palsu di e-commerce menuntut adanya sistem deteksi yang efektif untuk\nmelindungi pelanggan dari pemborosan uang dan waktu. Penelitian terkait deteksi ulasan palsu telah\nberkembang pesat dengan berbagai pendekatan, termasuk analisis berbasis text features, analisis perilaku\npengulas (reviewer behavioral), serta kombinasi keduanya dengan teknik deep learning. Deteksi ulasan\npalsu berbasis text features telah banyak dilakukan dalam berbagai penelitian. (Shan et al., 2021)\nmengusulkan metode analisis inkonsistensi ulasan, yang mengintegrasikan ketidaksesuaian antara rating\ndan sentimen, inkonsistensi bahasa, serta fitur sentimen untuk mendeteksi ulasan palsu. Studi ini\nmenunjukkan bahwa inkonsistensi linguistik lebih sering ditemukan dalam ulasan palsu dibandingkan\nulasan asli, sehingga meningkatkan akurasi deteksi. (Goyal et al., 2023) menggunakan XGBoost dan Extra\nTrees Classifier, yang mampu mendeteksi ulasan palsu dengan akurasi 96% pada dataset Yelp. (Nguyen,\n2023) menerapkan Support Vector Classifier (SVC) dengan TF-IDF, yang menunjukkan keandalan tinggi\ndalam membedakan ulasan palsu dan asli. Studi ini menyoroti efektivitas term weighting dan pendeteksian\nopinion spamming dalam mengidentifikasi ulasan yang tidak autentik.\nSelain analisis berbasis text features, beberapa peneliti juga memanfaatkan pendekatan berbasis graph dan\njaringan untuk menganalisis metadata serta pola perilaku pengguna. Yu et al. (2021) menggunakan Graph\nNeural Networks (GNNs) yang dikombinasikan dengan algoritma HITS untuk mengidentifikasi pola\nco-review antar pengguna yang mencurigakan, dengan tingkat akurasi mencapai 93,5%. Sementara itu, He\net al. (2022) menerapkan model network structure detection untuk menganalisis histori ulasan serta\nanomali dalam timestamp, yang menghasilkan tingkat akurasi sebesar 89,5%. Selain itu, Manaskasemsak\net al. (2023) menerapkan pendekatan Graph Partitioning untuk mendeteksi jaringan reviewer palsu\nmenggunakan metode BeGPX, yang mencapai akurasi 92,1% dalam mendeteksi hubungan mencurigakan\nantar pengguna.\nPendekatan berbasis deep learning juga telah digunakan untuk meningkatkan akurasi deteksi ulasan palsu.\nSeiring dengan perkembangan teknologi, metode berbasis neural network secara bertahap menjadi standar\ndalam deteksi ulasan palsu, dengan berbagai model sequence-based seperti Recurrent Neural Network\n(RNN), Long Short-Term Memory (LSTM), Bidirectional LSTM (BiLSTM), serta model Text-CNN yang\nbanyak digunakan dalam pemrosesan konten teks. Salah satu penelitian yang dilakukan oleh Qayyum et al.\n(2023) mengembangkan FRD-LSTM (Fake Review Detection menggunakan BiLSTM) dengan Deep\nContextualized Word Representation (DCWR), yang berhasil mencapai akurasi 97,2%, menjadikannya\nsalah satu metode dengan performa terbaik di bidang ini.\nNamun, model berbasis sequence-based memiliki beberapa keterbatasan, terutama dalam menangani\nketergantungan jangka panjang antar kata serta dalam aspek paralelisasi selama proses pelatihan. Oleh\nkarena itu, dalam beberapa tahun terakhir, penelitian telah banyak mengadopsi model BERT (Bidirectional\nEncoder Representations from Transformers) untuk mengatasi permasalahan tersebut. Model BERT\nmenggunakan encoder berbasis transformer untuk mengekstraksi word embeddings yang bersifat\nkontekstual dengan representasi yang lebih akurat. Selain itu, mekanisme self-attention dalam BERT\nmemungkinkan proses pelatihan yang lebih efisien secara paralel dibandingkan dengan pendekatan\nberbasis RNN atau LSTM.\nSalah satu studi yang dilakukan oleh Alsaad & Joshi (2024) membandingkan berbagai model transformer\ndan menemukan bahwa RoBERTa memiliki performa lebih unggul dibandingkan dengan model lain seperti\nBERT dan DistilBERT, dengan akurasi mencapai 97,1% dalam klasifikasi ulasan palsu. Namun, penelitian\ntersebut tidak mempertimbangkan review behavior sebagai faktor yang dapat digunakan dalam deteksi\nulasan palsu. Untuk mengatasi keterbatasan ini, Sun et al. (2024) mengusulkan metode yang\nmenggabungkan analisis teks dan perilaku reviewer guna meningkatkan akurasi deteksi ulasan palsu. Studi\ntersebut menunjukkan bahwa beberapa faktor perilaku seperti review burst (jumlah ulasan yang tinggi\ndalam waktu singkat), rating inconsistency, serta pola pengulangan komentar positif/negatif merupakan\nindikator kuat yang dapat digunakan dalam mendeteksi ulasan palsu. Metode yang digunakan dalam\npenelitian tersebut adalah model Fake Review Detection dengan pendekatan pengolahan teks\nmenggunakan BERT dan pengolahan review behavior menggunakan Transformer Encoder.\nMeskipun berbagai penelitian telah berhasil mengembangkan metode deteksi ulasan palsu, pendekatan\nberbasis machine learning dan deep learning tidak cukup hanya mengandalkan textual features untuk\nmendeteksi apakah sebuah ulasan bersifat manipulatif atau tidak. Penting untuk juga menganalisis\nbagaimana perilaku reviewer dan merchant dalam sistem e-commerce. Ulasan palsu sering kali dibuat oleh\nreviewer yang memiliki pola aktivitas mencurigakan, seperti memberikan banyak ulasan dalam waktu\nsingkat, menggunakan kata-kata hiperbolik, serta memiliki hubungan erat dengan merchant tertentu.\nBeberapa studi juga menunjukkan bahwa pola lain seperti harga produk, durasi produk di pasaran, serta\ninteraksi pengguna dengan sistem e-commerce dapat berkontribusi terhadap deteksi ulasan palsu.\nDalam penelitian ini, dataset yang digunakan berbasis bahasa Indonesia, sehingga diperlukan pendekatan\nyang dapat menangkap struktur linguistik dan pola perilaku pengguna dalam ekosistem e-commerce lokal.\nOleh karena itu, penelitian ini mengusulkan pendekatan yang mengombinasikan Deep Learning dengan\nIndoBERT serta Transformer Encoder untuk mendeteksi ulasan palsu dalam dataset berbahasa Indonesia\ndari platform Tokopedia. Model ini dirancang untuk tidak hanya mendeteksi ulasan palsu berdasarkan teks,\ntetapi juga untuk menganalisis perilaku reviewer, termasuk hubungan dengan merchant, serta pola interaksi\ndalam jaringan ulasan e-commerce.\nSebagai pembeda dari penelitian sebelumnya, penelitian ini juga menerapkan Aspect-Based Sentiment\nAnalysis (ABSA) untuk memahami opini pengguna terhadap aspek-aspek spesifik dari produk. Dengan\nABSA, sistem dapat mengidentifikasi ketidaksesuaian antara sentimen dalam teks ulasan dan rating yang\ndiberikan, yang merupakan indikator kuat dalam mendeteksi ulasan palsu yang dibuat secara manipulatif.\nKombinasi dari pendekatan berbasis IndoBERT, Transformer Encoder, dan ABSA diharapkan dapat\nmenghasilkan model deteksi ulasan palsu yang lebih akurat dan komprehensif dibandingkan metode\nsebelumnya.\nPenelitian Terdahulu\nNo. Penulis Judul Tahun\n1 Sun, P., Bi, W., Zhang, Y., Wang, Q., Kou, Review Detection Model 2024\nF., Lu, T., & Chen, J. Based on Comment Content\nand Review Behavior.\n2 Shan, G., Zhou, L., & Zhang, D. From conflicts and confusion 2021\nto doubts: Examining review\ninconsistency for fake review\ndetection\n3 Nguyen, L. N. An Empirical Study on Fake 2023\nReview Detection\n4 Yu, S., Ren, J., Li, S., Naseriparsa, M., & Graph learning for fake review 2021\nXia, F. detection\n5 He, S., Hollenbeck, B., Overgoor, G., Detecting fake-review buyers 2022\nProserpio, D., & Tosyali, A. using network structure:\nDirect evidence from Amazon\n6 Manaskasemsak, B., Tantisuwankul, J., & Fake review and reviewer 2021\nRungsawang, A. detection through behavioral\ngraph partitioning integrating\ndeep neural network.\n7 Goyal, N., & Goyal, D Fake Review Detection Using 2023\nEnsemble Techniques by the\nFusion of Chronology, Aspect\nand Sentiment of Reviews and\nOversampling by Smote\n8 Alsaad, M. M. B., & Joshi, H. Transformer-Based Language 2024\nDeep Learning Detection of\nFake Reviews on Online\nProducts\n9 Yin, C., Cuan, H., Zhu, Y., & Yin, Z. Improved Fake Reviews 2021\nDetection Model Based on\nVertical Ensemble\nTri-Training and Active\nLearning\nRumusan Masalah Perkembangan pesat industri e-commerce di Indonesia telah mengubah pola perilaku konsumen\ndalam mengambil keputusan pembelian. Salah satu faktor yang berperan penting dalam proses ini\nadalah ulasan produk yang ditulis oleh pengguna lain, yang menjadi sumber informasi utama bagi\ncalon pembeli. Namun, meningkatnya ketergantungan terhadap ulasan ini juga diikuti dengan\ntantangan baru, yaitu maraknya ulasan palsu yang dibuat untuk memanipulasi persepsi\nkonsumen. Ulasan palsu sering kali dibuat untuk meningkatkan popularitas suatu produk secara\ntidak wajar atau menjatuhkan reputasi pesaing, sehingga menyebabkan ketidakseimbangan dalam\npersaingan pasar. Keberadaan ulasan yang tidak autentik ini tidak hanya merugikan konsumen,\ntetapi juga menurunkan kepercayaan terhadap platform e-commerce itu sendiri. Oleh karena itu,\ndibutuhkan sistem yang dapat secara efektif mendeteksi ulasan palsu dengan mempertimbangkan\npola bahasa yang digunakan serta perilaku reviewer dalam memberikan ulasan.\nDalam upaya mengatasi masalah ini, berbagai pendekatan telah dikembangkan, mulai dari\nanalisis berbasis teks hingga analisis perilaku reviewer (reviewer behavioral analysis). Meskipun\npendekatan berbasis teks mampu mengidentifikasi pola linguistik dalam ulasan palsu, metode ini\nmasih memiliki keterbatasan dalam menangkap pola interaksi antar-pengulas dan penjual yang\ndapat mengindikasikan adanya manipulasi ulasan. Oleh karena itu, teknologi berbasis deep\nlearning. Penelitian ini bertujuan untuk mengembangkan model deteksi ulasan palsu dengan\nmenggabungkan Indo-BERT untuk analisis text features dan Transformer Encoder untuk analisis\npola perilaku reviewer. Dengan pendekatan ini, sistem yang diusulkan tidak hanya dapat\nmendeteksi ulasan palsu berdasarkan isi teks, tetapi juga mampu menganalisis hubungan dan pola\naktivitas reviewer dalam ekosistem e-commerce, sehingga memberikan solusi yang lebih akurat\ndalam menangani permasalahan ulasan manipulatif di platform seperti Tokopedia.\nMetodologi Dalam mendeteksi ulasan palsu pada e-commerce, peneliti mengombinasikan dua pendekatan\nutama: analisis fitur teks menggunakan Indo-RoBERTa dan analisis perilaku pengulas\nmenggunakan BeGP (Behavioral Graph Partitioning). Kombinasi ini memungkinkan sistem\nuntuk mengidentifikasi ulasan palsu berdasarkan pola bahasa serta hubungan dan aktivitas\npengguna. Proses deteksi ini mencakup tahapan sebagai berikut:\n1. Data Collection\nPada tahap ini dilakukan pengumpulan data ulasan yang diambil dari e-commerce\nTokopedia. Fitur data yang dikumpulkan meliputi:\na. Teks Ulasan, ulasan yang diberikan oleh pengguna mengenai pengalaman mereka\nterhadap suatu produk. Data ini digunakan untuk analisis berbasis teks guna mendeteksi\npola linguistik yang mencurigakan.\nb. Rating Produk, skor yang diberikan pengguna dalam bentuk bintang (1–5). Data ini\ndianalisis untuk menemukan ketidaksesuaian antara rating dan isi ulasan, misalnya\nulasan negatif dengan rating tinggi atau sebaliknya.\nc. ID Pengguna dan ID Merchant, informasi mengenai identitas pengguna dan\nmerchant digunakan untuk menganalisis hubungan antara reviewer dan merchant. Data\nini berguna dalam mendeteksi kemungkinan adanya aktivitas ulasan palsu yang\ndilakukan secara sistematis oleh sekelompok pengguna.\nd. Timestamp Ulasan, waktu ketika ulasan diberikan dikumpulkan untuk mendeteksi\nlonjakan aktivitas ulasan dalam waktu singkat. Adanya lonjakan ulasan dalam periode\ntertentu dapat menjadi indikasi manipulasi ulasan yang disengaja.\ne. Frekuensi Ulasan oleh Reviewer, jumlah ulasan yang diberikan oleh reviewer dalam\nperiode waktu tertentu digunakan sebagai indikator dalam mendeteksi pola aktivitas\nmencurigakan, seperti reviewer yang memberikan banyak ulasan dalam waktu singkat\natau menunjukkan pola ulasan yang tidak alami.\n2. Preprocessing Data\nPada tahap ini, data yang dikumpulkan dibersihkan dan dipersiapkan agar sesuai untuk\npemrosesan lebih lanjut. Proses ini terdiri dari dua bagian utama: Text Preprocessing dan\nBehavioral Review Preprocessing.\nA. Text Preprocessing\nTahapan dalam text processing mencakup:\na. Tokenization, memecah teks ulasan menjadi unit kata atau token agar lebih mudah\ndianalisis.\nb. Case Folding, mengonversi semua huruf menjadi huruf kecil untuk menjaga\nkonsistensi data.\nc. Stopword Removal, menghapus kata-kata umum, seperti \"dan\", \"atau\", \"dengan\".\nd. Stemming/Lemmatization, mengubah kata ke dalam bentuk dasarnya untuk\nmenghindari perbedaan makna akibat variasi kata.\ne. Filtering & Cleaning, menghapus tanda baca, angka, serta karakter khusus yang tidak\nrelevan dalam analisis teks.\nB. Behavioral Preprocessing\nBehavioral preprocessing dilakukan untuk menganalisis pola interaksi reviewer\nberdasarkan aktivitas mereka di platform. Langkah-langkahnya meliputi:\na. Behavioral Data Extraction, mengambil fitur perilaku reviewer seperti jumlah\nulasan dalam waktu tertentu, pola rating, dan hubungan dengan merchant.\nb. Normalization,menstandarisasi data perilaku agar lebih mudah dianalisis oleh\nTransformer Encoder.\n3. Textual Feature Processing menggunakan IndoBERT\nTeks ulasan diproses menggunakan IndoBERT, yang menghasilkan representasi\nsemantik dalam bentuk word embeddings. Model ini memahami konteks kata dalam\nulasan dan mampu mengenali pola linguistik yang mencurigakan.\na. Aspect-Based Sentiment Analysis (ABSA)\nSebagai pembeda utama dalam penelitian ini, ABSA diterapkan untuk menganalisis\nsentimen berdasarkan aspek tertentu dari produk (misalnya, kualitas produk, harga,\natau layanan). Dengan ABSA, sistem dapat mengidentifikasi apakah ada\nketidaksesuaian antara sentimen yang diungkapkan dalam teks ulasan dan rating yang\ndiberikan oleh pengguna.\n4. Behavioral Feature Processing dengan Transformer Encoder\nPola perilaku reviewer diproses menggunakan Transformer Encoder, yang terdiri dari\nbeberapa komponen utama:\na. Multi-Head Attention, memungkinkan model untuk fokus pada berbagai aspek\nperilaku reviewer dalam ulasan.\nb. Feed-Forward Network (FFN), memproses fitur perilaku yang telah diperoleh untuk\nmenghasilkan representasi yang lebih abstrak.\nc. Similarity Analysis, menganalisis kesamaan pola ulasan antar-reviewer guna\nmengidentifikasi kemungkinan kolusi atau sindikat ulasan palsu.\n5. Feature Fusion\nSetelah kedua fitur (tekstual dan perilaku) diproses, dilakukan Feature Fusion, yaitu\nproses penggabungan informasi dari IndoBERT dan Transformer Encoder. Tujuan dari\ntahap ini adalah untuk menggabungkan wawasan dari konten teks dan perilaku pengguna\nguna meningkatkan akurasi model dalam membedakan ulasan asli dan palsu.\n6. Final Classification\nPada tahap ini, hasil dari Indo-BERT (berbasis teks) dan Transformer Encoder (berbasis\nperilaku reviewer) digabungkan untuk meningkatkan akurasi deteksi ulasan palsu.\nOutput dari klasifikasi akhir adalah:\n- Fake Review → Jika sistem mendeteksi pola anomali dalam teks ulasan atau perilaku\nreviewer.\n- Genuine Review → Jika ulasan tidak memiliki indikasi kepalsuan.\nReferensi Alsaad, M. M. B., & Joshi, H. (2024). Transformer-Based Language Deep Learning Detection of\nFake Reviews on Online Products. Journal of Electrical Systems, 20(3), 2368-2378.\nAsaad, W. H., Allami, R., & Ali, Y. H. (2023, Oktober). Fake Review Detection Using Machine\nLearning. Revue d'Intelligence Artificielle, 37(5). 10.18280/ria.370507\nBashir, U., & Statista. (2024, October 23). Most popular categories for online purchases in\nIndonesia 2024. Statista. Retrieved March 10, 2025, from\nhttps://www.statista.com/forecasts/823409/most-popular-categories-for-online-purchases\n-in-indonesia\nBerijalan. (2025, Maret 4). Tren Belanja Online 2025: Teknologi dan Perilaku Konsumen. Tren\nBelanja Online 2025: Teknologi dan Perilaku Konsumen. Retrieved Maret 14, 2025,\nfrom\nhttps://berijalan.co.id/article-detail/tren-belanja-online-2025-teknologi-dan-perilaku-kon\nsumen\nDataboks. (2024, January 10). 5 E-Commerce dengan Pengunjung Terbanyak Sepanjang 2023 |\nDataboks. Databoks. Retrieved March 8, 2025, from\nhttps://databoks.katadata.co.id/teknologi-telekomunikasi/statistik/3c9132bd3836eff/5-e-c\nommerce-dengan-pengunjung-terbanyak-sepanjang-2023\nDataboks. (2024, March 19). TikTok Shop Gabung Tokopedia, Ini Jumlah Penggunanya |\nDataboks. Databoks. Retrieved March 8, 2025, from\nhttps://databoks.katadata.co.id/teknologi-telekomunikasi/statistik/a6be2d006205170/tikt\nok-shop-gabung-tokopedia-ini-jumlah-penggunanya\nDataboks. (2024, July 18). Shopee Dominasi Pasar E-Commerce Asia Tenggara pada 2023 |\nDataboks. Databoks. Retrieved March 8, 2025, from\nhttps://databoks.katadata.co.id/teknologi-telekomunikasi/statistik/66989de7b7168/shope\ne-dominasi-pasar-e-commerce-asia-tenggara-pada-2023\nFil’ilmi, P. R., Manalu, D. A., Tara, I. N. A., Barnanti, R., & Asral. (2025, Januari).\nPENGARUH STRATEGI DISKON TERHADAP LOYALITAS PELANGGAN DI\nPLATFORM SHOPEE. Neraca Manajemen, Ekonomi, 14(4). 10.8734/mnmae.v1i2.359\nGolrezaei, N., Manshadi, V., Schneider, J., & Sekar, S. (2020). Learning Product Rankings\nRobust to Fake Users. arXiv. https://doi.org/10.48550/arXiv.2009.05138\nGoyal, N., & Goyal, D. (2023). Fake Review Detection Using Ensemble Techniques by the\nFusion of Chronology, Aspect and Sentiment of Reviews and Oversampling by Smote.\nJournal of Harbin Engineering University, 44(6).\nhttps://www.researchgate.net/publication/372138938\nHe, S., Hollenbeck, B., Overgoor, G., Proserpio, D., & Tosyali, A. (2022). Detecting fake-review\nbuyers using network structure: Direct evidence from Amazon. Proceedings of the\nNational Academy of Sciences, 119(47). 10.1073/pnas.2211932119\nManaskasemsak, B., Tantisuwankul, J., & Rungsawang, A. (2021). Fake review and reviewer\ndetection through behavioral graph partitioning integrating deep neural network. Neural\nComputing and Applications, 35(2), 1169-1182. 10.1007/s00521-021-05948-1\nMOHAWESH, R., XU, S., TRAN, S. N., OLLINGTON, R., SPRINGER, M., JARARWEH, Y.,\n& MAQSOOD, S. (2021, April). Fake Reviews Detection: A Survey. IEEE Access.\n10.1109/ACCESS.2021.3075573\nNguyen, L. N. (2023). An Empirical Study on Fake Review Detection. TRA VINH UNIVERSITY\nJOURNAL OF SCIENCE. 10.35382/tvujs.13.6.2023.2107\nPeña-García, N., Losada-Otálora, M., Auza, D. P., & Cruz, M. P. (2024). Reviews, trust, and\ncustomer experience in online marketplaces: the case of Mercado Libre Colombia.\nFrontiers, 9, 1460321. https://doi.org/10.3389/fcomm.2024.1460321\nQayyum, H., Ali, F., Nawaz, M., & Nazir, T. (2023). FRD-LSTM: A novel technique for fake\nreviews detection using DCWR with the Bi-LSTM Method. Multimedia Tools and\nApplications, 82(20), 31505-31519. 10.1007/s11042-023-15098-2\nSeptiani, L. (2023, Desember 21). Tarif Jasa Review Produk Palsu dan Cara Mengenalinya.\nKatadata. Retrieved Maret 12, 2025, from\nhttps://katadata.co.id/digital/e-commerce/6584029461099/tarif-jasa-review-produk-palsu\n-dan-cara-mengenalinya\nShan, G., Zhou, L., & Zhang, D. (2021). From conflicts and confusion to doubts: Examining\nreview inconsistency for fake review detection. Elsevier, 144, 113513.\n10.1016/j.dss.2021.113513\nSun, P., Bi, W., Zhang, Y., Wang, Q., Kou, F., Lu, T., & Chen, J. (2024, November 4). Fake\nReview Detection Model Based on Comment Content and Review Behavior.\nElectronics, 13, 4322. https://doi.org/10.3390\nTUFAIL, H., ASHRAF, M. U., ALSUBHI, K., & ALJAHDALI, H. M. (2022). The Effect of\nFake Reviews on e-CommerceDuring and After Covid-19 Pandemic:SKL-Based Fake\nReviews Detection. IEEE Access, 10. 10.1109/ACCESS.2022.3152806\nYin, C., Cuan, H., Zhu, Y., & Yin, Z. (2021, Mei). Improved Fake Reviews Detection Model\nBased on Vertical Ensemble Tri-Training and Active Learning. ACM Transactions on\nIntelligent Systems and Technology, 12(4), 33. https://doi.org/10.1145/3450285\nYu, S., Ren, J., Li, S., Naseriparsa, M., & Xia, F. (2022). Graph learning for fake review\ndetection. Frontiers in Artificial Intelligence, 5. 10.3389/frai.2022.922589\nMedan, Maret 2025\nMahasiswa yang mengajukan,\n(Gideon Togap Hata Oloan Manurung)\nNIM.211402147",
  "similar_tokens": [
    "jaga",
    "final",
    "akses",
    "kualitas",
    "popular",
    "temu",
    "informasi",
    "negatif",
    "c",
    "f",
    "sifat",
    "in",
    "luas",
    "through",
    "studi",
    "no",
    "adopsi",
    "tumbuh",
    "masalah",
    "asli",
    "study",
    "sektor",
    "indikator",
    "j",
    "layan",
    "liput",
    "sorot",
    "integrasi",
    "besar",
    "pesat",
    "rancang",
    "atas",
    "implementasi",
    "cakup",
    "guna",
    "applications",
    "hasil",
    "to",
    "olah",
    "manusia",
    "techniques",
    "social",
    "alam",
    "mudah",
    "an",
    "maret",
    "tuju",
    "wajar",
    "kunjung",
    "for",
    "standar",
    "untung",
    "latar",
    "cepat",
    "industri",
    "libat",
    "kali",
    "from",
    "national",
    "cari",
    "konteks",
    "customer",
    "based",
    "amazon",
    "singkat",
    "dukung",
    "struktur",
    "review",
    "catat",
    "z",
    "w",
    "percaya",
    "bidang",
    "skor",
    "ikut",
    "ketidaksesuaian",
    "interaksi",
    "komunikasi",
    "milik",
    "batas",
    "platform",
    "kembang",
    "periode",
    "manfaat",
    "manajemen",
    "d",
    "h",
    "efektivitas",
    "strategi",
    "produk",
    "konsumen",
    "pola",
    "dalam",
    "teliti",
    "engineering",
    "beri",
    "banding",
    "term",
    "indonesia",
    "sistematis",
    "al",
    "wang",
    "konten",
    "unit",
    "springer",
    "ulang",
    "and",
    "reputasi",
    "ubah",
    "novel",
    "lonjak",
    "covid",
    "ringkas",
    "q",
    "nilai",
    "kombinasi",
    "tulis",
    "oktober",
    "jadi",
    "latih",
    "efektif",
    "users",
    "s",
    "sesuai",
    "analis",
    "daring",
    "retrieved",
    "tuntut",
    "hubung",
    "unggul",
    "zhou",
    "gabung",
    "trees",
    "r",
    "komprehensif",
    "e",
    "with",
    "unjung",
    "solusi",
    "chen",
    "t",
    "pecah",
    "aju",
    "capai",
    "pengaruh",
    "paham",
    "li",
    "rugi",
    "hadir",
    "juta",
    "khusus",
    "durasi",
    "beli",
    "sumber",
    "hapus",
    "wawas",
    "utama",
    "operasi",
    "tran",
    "n",
    "variasi",
    "referensi",
    "abstrak",
    "tawar",
    "usul",
    "march",
    "multimedia",
    "a",
    "jalan",
    "case",
    "u",
    "sengaja",
    "sama",
    "harap",
    "langgan",
    "using",
    "relevan",
    "medan",
    "et",
    "akurat",
    "topik",
    "sedia",
    "teknik",
    "university",
    "kenal",
    "aktif",
    "method",
    "kerja",
    "technique",
    "kontribusi",
    "xu",
    "belanja",
    "transactions",
    "zhang",
    "jual",
    "memory",
    "bersih",
    "k",
    "by",
    "era",
    "tantang",
    "total",
    "terap",
    "usaha",
    "perilaku",
    "sebab",
    "peran",
    "science",
    "kumpul",
    "rating",
    "rekomendasi",
    "timbang",
    "individu",
    "online",
    "putus",
    "bahasa",
    "dekat",
    "improved",
    "g",
    "komponen",
    "ali",
    "gantung",
    "signifikan",
    "kelompok",
    "dampak",
    "transaksi",
    "sebar",
    "intelligent",
    "merek",
    "aspek",
    "lingkung",
    "bisnis",
    "proceedings",
    "judul",
    "akibat",
    "on",
    "l",
    "bentuk",
    "tanda",
    "distribusi",
    "p",
    "bas",
    "live",
    "pilih",
    "beda",
    "nali",
    "tingkat",
    "metodologi",
    "deteksi",
    "nguyen",
    "ieee",
    "technology",
    "baik",
    "bayar",
    "kuat",
    "peringkat",
    "tahap",
    "mahasiswa",
    "buku",
    "banyak",
    "rumus",
    "otomatis",
    "isi",
    "aktivitas",
    "jangka",
    "pasar",
    "masyarakat",
    "networks",
    "y",
    "salah",
    "proses",
    "tangan",
    "buka",
    "pemrosesan",
    "v",
    "b",
    "m",
    "journal",
    "hindar",
    "angka",
    "dasar",
    "identifikasi",
    "ambil",
    "performa",
    "spesifik",
    "id",
    "i",
    "efisien",
    "weighting",
    "sciences",
    "konvensional",
    "program",
    "representasi",
    "ecommerce",
    "butuh",
    "kait",
    "fokus",
    "faktor",
    "baca",
    "teks",
    "oleh",
    "dorong",
    "harga",
    "skripsi",
    "dapat",
    "turun",
    "the",
    "collection",
    "siap",
    "alami",
    "buat",
    "ada",
    "mekanisme",
    "andal",
    "calon",
    "survey"
  ],
  "filename": "1752050792_Exum_211402147.pdf",
  "user_id": 17
}