{
  "original_text": "KEMENTERIAN PENDIDIKAN, KEBUDAYAAN, RISET, DAN\nTEKNOLOGI\nAEASITA UNIVERSITAS SUMATERA UTARA\nFAKULTAS ILMUK OMPUTER DAN TEKNOLOGI INFORMASI\nPROGRAM STUDI S1 TEKNOLOGII NFORMASI\nERA\nJalan Alumni No. 3 Gedung C, Kampus USU Padang Bulan, Medan 20 155\nTclcpon/Fax: 061-8210077 | Email: tck.informasi@usu.ac.id | Laman: htp://it.usu.ac.id\nFORM PENGAJUAN JUDUL\nNama : Erli Gurning\nNIM : 211402 123\nJuduld iajukan oleh* Dosen\nMahasiswa\nBidang Ilmu (tulis dua bidang) 1. Data Scieence and intelligent system\n2. Computer Graphics and Vision\nUji Kelayakan Judu** DiterimaDitolak\nHasil Uji Kelayakan Judul :\nDosen Pembimbing I: Annisa Fadhillah Pulungan, S.Kom., M.Kom\nParaf Do_en Pembimbing I\n(Jika judul dari dosen maka dosen tersebut berhak menjadi pembimbing I)\nDosen Pembimbing II: Rossy Nurhasannah, S.Kom., M.Kom\nMedan, 22 Januari 2025\nKa. Laboratorium Penelitian,\n* Centang salah satu atau keduanya Fanindia Purnamasari, S.TI., M.IT.\n** Pilih salah satu\nNIP, 198908172019032023\nRINGKASAN JUDUL YANG DIAJUKAN\n*Semua kolom di bawah ini diisi oleh mahasiswa yang sudah mendapat judul\nJudul / Topik IMPLEMENTASI SSD-MOBILENETV2 PADA PROSES PEMILAHAN SAMPAH\nSkripsi OTOMATIS DI INDUSTRI DAUR ULANG SAMPAH MENGGUNAKAN PROTOTYPE\nARM-ROBOT\nLatar Belakang Latar Belakang\ndan Penelitian Dewasa ini, sampah yang dihasilkan di Indonesia sangat tinggi. Berdasarkan data dari\nTerdahulu sistem Informasi Pengelolaan Sampah Nasional (SIPSN), Jumlah timbulan sampah\nIndonesia mencapai 18 juta ton pertahun dan jumlah sampah tidak terkelola mencapai 7\njuta ton pertahun. jumlah sampah yang tinggi perlu dibarengi dengan daur ulang sampah\nuntuk mengkontrol masalah lingkungan yang bisa disebabkan oleh sampah tersebut. Pada\nmasa kini sudah sangat banyak industri daur ulang sampah yang memanfaatkan sampah\nmenjadi barang yang berguna dan memiliki daya beli yang tinggi. Proses daur ulang sampah\nmemiliki siklus yang panjang, mulai dari proses pewadahan untuk memisahkan sampah\norganik dan anorganik, pengumpulan sampah dengan diangkat oleh armada pengumpulan,\nhingga pemrosesan sampah lebih lanjut di TPS. Di TPS sampah akan dipilah berupa sampah\nbasah dan sampah kering, sampah basah akan dibawa ke TPA dan sampah kering akan\ndiberikan kepada pengepul (Hariyadi et al., 2020). Namun seluruh proses pemilahan\nsampah masih dilakukan secara manual oleh tenaga manusia . Hal ini tentu menjadi\nperhatian serius mengingat keterbatasan tenaga manusia dalam memilah sampah dan resiko\npenyakit yang diderita oleh pekerja pemilah sampah. Berdasarkan data yang didapat dari\nhasil survei di tempat penampungan sampah terpadu kabupaten Malang, yang dilakukan\noleh Alma dan kawan-kawan, peluang penyakit yang paling sering dialami oleh pekerja\nadalah 58% untuk penyakit diare dan gastrointestinal dan diikuti resiko kecelakaan kerja\nyakni tergores dan terjatuh sebesar 58%, terpeleset 50%, dan tertusuk benda tajam sebesar\n47% (Alma et al., 2019).\nBerdasarkan masalah yang dihadapi, penulis mengusulkan solusi penelitian dengan\npembuatan prototype arm-robot berbasis deep learning sebagai alat untuk memilah sampah\nsecara otomatis. Sistem yang penulis usulkan menggunakan kamera RGB dan\nmikrokontroller dari visi komputer untuk mengklasifikasikan sampah yang dilatih\nmenggunakan deep learning. Selanjutnya prototype arm-robot akan mengambil sampah\ndan memasukkannya kewadah yang tepat. Sampah yang diberikan masih diletakkan secara\nmanual dan akan disortir secara otomatis oleh prototype arm-robot.\nTeknologi machine learning dan deep learning yang dapat membantu permasalahan yang\nada. Penelitian terdahulu yang dilakukan oleh Bobulski dan Kubanek (2021), Penelitian ini\nmenggunakan algoritma convolutional neural network dan membahas mengenai\nimplementasi CNN untuk mengklasifikasikan sampah plastik menjadi 4 kelas yaitu : PE-\nHD, PET, PP dan PS (Bobulski & Kubanek, 2021). Penelitian tersebut hanya menggunakan\nsampah plastik sebagai datasetnya dan membaginya kedalam 4 jenis sampah plastik dan\nkurang mewakili banyaknya jenis sampah yang perlu didaur ulang. Mendapatkan akurasi\n99,92% untuk training data dan 72% untuk testing data. Menggunakan 10 epochs, dengan\n15 layers, dan resolusi gambar menjadi 120 x 120 dan dataset sebanyak 139.720 gambar.\nPenelitian lainnya, yang dilakukan oleh Adedeji dan Wang (2019), penelitian tersebut\nmenggunakan algoritma SVM dengan mencapai akurasi testing sebesar 87%, akurasi\ntraining sebesar 94.5% , dengan 12 epochs dan mengklasifikasikan sampah kedalam 4 kelas\nyaitu : kaca, logam, kertas, dan plastik. Total dataset yang digunakan adalah 1989 gambar\ndengan ukuran 256 x 256. (Adedeji & Wang, 2019). Penelitian tersebut hanya membagi\nsampah kedalam 4 kelas dan masih belum cukup untuk merepresentasikan keberagaman\njenis sampah yang ada.\nPenelitian lainnya dilakukan oleh Kakde, Bothe, dan Paul (2019), Penelitian tersebut\nmemanfaatkan arduino, arm robot dan algoritma CNN untuk saling berinteraksi untuk\nmengklasifikasikan buah apel dan jeruk kedalam tong yang berbeda secara otomatis.\nPenelitian tersebut mendapatkan akurasi sebesar 99.22% dengan dataset 1000 gambar apel\ndan 800 gambar jeruk (Kakde et al., 2019)\nPenelitian lainnya dilakukan oleh Sundaralingam dan Ramanathan, penelitian tersebut\nkhusus mengklasifikasikan sampah plastik menjadi 6 kelas yaitu : PET, HDPE, PVC,\nLDPE, PP, PS. Model juga dilatih untuk mengenali gripper agar arm robot dapat digerakkan\nsesuai lokasi dari sampah. Penelitian tersebut menggunakan algoritma SSD-MobileNet dan\nmendapatkan average precision 0.917 dan average Recall 0.801 (Sundaralingam &\nRamanathan, 2024) Namun penelitian tersebut hanya fokus mengklasifikasikan sampah\nplastik saja.\nPenelitian selanjutnya yang dilakukan oleh Thao (2023). Penelitian tersebut menggunakan\nSSD-MobileNetV2 dan mendapatkan akurasi sebesar 99%. Dataset yang digunakan terdiri\ndari 2476 gambar pelatihan dan 204 gambar pengujian yang diklasifikasikan kedalam 3\nkelas yaitu : plastik, kertas, dan nilon (Thao, 2023). Penelitian tersebut hanya\nmengklasifikasikan sampah menjadi 3 kelas dan keberagaman dataset yang terbatas,\nsehingga masih kurang cocok digunakan untuk mengklasifikasikan sampah dikehidupan\nnyata yang sangat beragam.\nPenelitian lainnya dilakukan oleh Shinde et al, (2024). Penelitian tersebut mengintegrasikan\ndeep learning dengan arm robot yang saling terintegrasi untuk mengklasifikan sampah\nkedalam 4 kelas yang berbeda. Penelitian tersebut menggunakan CNN dan mendapatkan\nakurasi sebesar 95%. Dataset yang digunakan terdiri dari 10.000 gambar yang\ndiklasifikasikan kedalam 4 kelas yaitu: plastik, kertas, kaca dan logam. Penelitian tersebut\nmenghasilkan lengan robot yang mampu menyortir 1000 sampah dalam waktu 30 menit\n(Shinde et al., 2024). Penelitian tersebut hanya mengklasifikasikan sampah kedalam 4 kelas\ndan masih perlu dikembangkan dalam jumlah kelas serta keberagaman datasetnya.\nPenelitian lainnya dilakukan oleh Barik et al, (2021). Penelitian tersebut mengintegrasikan\narm robot dengan CNN untuk mengklasifikasikan sampah menjadi 2 kelas, yaitu : sampah\nkering dan sampah basah. Penelitian tersebut mendapatkan akurasi sebesar 84.96%.\nAdapapun dataset yang digunakan dalam penelitian tersebut berasal dari TrashNet dengan\njumlah gambar sebanyak 2579 gambar (Barik et al., 2021). Penelitian tersebut memerlukan\nperluasan dan keberagaman dataset serta diperlukannya peningkatan akurasi dari model.\nDengan demikian, penulis mengusulkan penelitian dengan judul “IMPLEMENTASI SSD-\nMOBILENETV2 PADA PROSES PEMILAHAN SAMPAH OTOMATIS DI INDUSTRI\nDAUR ULANG SAMPAH MENGGUNAKAN PROTOTYPE ARM-ROBOT”. Penelitian\nini akan membahas mengenai manfaat dari algoritma SSD-MobileNet untuk\nmengklasifikasikan jenis sampah kedalam 6 kelas yaitu : karton, kaca, logam, kertas, plastik\ndan sampah organik dan menyortirnya secara otomatis menggunakan arm robot. Penulis\nmenyarankan menggunakan algoritma MobileNetV2 karena setelah melakukan riset\nterhadap penelitian terdahulu, penulis menemukan bahwa MobileNet ini memiliki\nkompabilitas yang rendah dan ringan, sehingga algoritma ini adalah algoritma yang paling\nsesuai untuk diintegrasikan dengan arduino dan mikrokontroller sejenisnya.\nPenelitian Terdahulu\nNo. Penulis Judul Tahun\nBobulski, J., & Kubanek, Deep Learning for Plastic Waste Classification\n1. 2021\nM System\nIntelligent Waste Classification System Using\n2. Adedeji, O. & Wang, Z. 2019\nDeep Learning Convolutional Neural Network\nReal life implementation of Object Detection and\nKakde,Y.,\n3. classification Using Deep Learning and Robotic 2019\nBothe, N., & Paul, A.\narm\nSundaralingam, S., & Recyclable plastic waste segregation with deep\n4. 2024\nRamanathan, N. learning based hand-eye coordination\nAn automated waste management system using\n5. Thao, L. 2023\nartificial intelligence and robotics\nShinde, Rajeshree.,\nVasekar, Shridevi., Automated Garbage Separation using AI Based\n6. 2024\nPatil, Vaishali., Robotic Arm\nTamkhade, Jayashree\nP., Ingale, Anup.,\nKshirsagar, Ketki P.\nBarik, H., K.Tulsi,\nDevi, S., Subbulaxmi, Automatic segregate : Dry and Wet segregation\n7. 2021\nPrasad, G., & using CNN(Deep Learning) with Robotic arm\nAmbedkar, D.B.\nRumusan Masalah Permasalahan sampah menjadi masalah yang serius. Setiap tahunnya indonesia menghasilkan\njutaan ton sampah yang belum terkelola dan didaur ulang. Masa kini, semakin banyak industri\ndaur ulang sampah yang dapat mengubah sampah menjadi barang-barang yang bernilai tinggi\ndan dapat mengurangi pencemarah lingkugan yang disebabkan. Namun yang menjadi tantangan\nutama yaitu proses pemilahan sampah yang dilakukan masih bersifat manual oleh manusia.\nproses pemilahan secara manual memberikan resiko penyakit yang serius pada pekerja pemilah\nsampah. Selain hal tersebut, kapasitas sampah yang tinggi membutuhkan kecepatan dalam\nmemilah sampah yang tinggi pula. Oleh sebab itu dibutuhkan sebuah sistem yang dapat\nmelakukan proses pemilahan sampah otomatis tanpa ada atau tidaknya manusia.\nMetodologi\nTahapan Penelitian :\n1. Data collection\nPada tahap ini, dataset sampah akan dikumpulkan dan dibedakan menjadi 6 kelas yang\nberbeda yaitu : karton, kaca, logam, kertas, plastik dan sampah organik\n2. Split dataset\nDitahap ini, dataset akan dibagi lagi menjadi 3 bagian yaitu : data training untuk melatih\ndata; data validation untuk mengevaluasi performa dari model selama pelatihan dan\ntuning hyperparameter; dan testing untuk mengevaluasi performa dari model akhir\nsetelah training data.\n3. Data preprocessing\nData preprocessing akan melakukan beberapa pemrosesan pada data training dan\nvalidasi meliputi : image labeling untuk memberikan kategori sampah sesuai dengan\njenisnya; image resizing berfungsi untuk mengatur agar dataset memiliki ukuran\ndimensi gambar yang sama; image augmentasi akan menambah variasi dari data dengan\ncara merotasi, flipping, zoom, crop dan penyesuaian cahaya untuk meningkatkan\nkemampuan generalisasi dari model.\n4. Training model\nPada tahap ini, model akan dilatih dengan dataset yang sudah disiapkan sebelumya.\nTraining model akan dilakukan beberapa kali untuk mendapatkan performa model yang\npaling baik. Adapun hal yang harus diperhatikan saat melakukan traning model adalah\nlearning rate, ukuran batch, jumlah epoch, optimizer, dan lainnya.\n5. Testing\nDitahap ini, metrik evaluasi akan digunakan untuk menguji performa model dengan\nmemperhatikan metrik accuracy, precision, recall, dan f1- score.\n6. Model deployment\nDitahap ini, model akan dikonversikan ke format tensorflow Lite ataupun H5. Tujuan\ndari konversi model ke format yang ringan adalah agar model dapat dijalankan pada\nperangkat edge seperti raspberry Pi.\n7. Model diintegrasikan dengan arm robot\nKamera RGB akan dipasang untuk menangkap gambar sampah, gambar yang didapat\nakan diterjemahkan menjadi sinyal perintah untuk arm robot. Sistem kendali seperti\nMQTT maupun serial communication akan digunakan untuk menghubungkan model\ndengan penggerak arm robot.\n8. Testing integrasi arm robot dengan model\nPada tahap ini akan dilakukakn pengujian kemampuan sistem secara keseluruhan,\ntermasuk kemampuan model, arm robot, dan performa robot dalam mengklasifikasikan\nsampah.\nReferensi\nAdedeji, O., & Wang, Z. (2019). Intelligent Waste Classification System Using Deep Learning .\nProcedia Manufacturing, 607-612.\nKakde, Y., Bothe, N., & Paul, A. (2019). Real life implementation of Object Detection and\nclassification Using Deep Learning and Robotic arm. SSRN-ELSEVIER, (2018-19)\n000–000.\nSundaralingam, S., & Ramanathan, N. (2024). Recyclable plastic waste segregation with deep\nlearning based hand-eye coordination. Environmental Research Communications, 6\n045007.\nThao, L. Q. (2023). An automated waste management system using artificial intelligence and\nrobotics. Journal of Material Cycles and Waste Management, 25:3791–3800.\nBobulski, J., & Kubanek, M. (2020). Deep Learning for Plastic Waste Classification System.\nApplied Computational Intelligence and Soft Computing, 2021(1), 6626948.\nhttps://doi.org/10.1155/2021/6626948\nAlma, L. R., Ulfah, N. H., Utomo, Y., Afifah, A., Adawiyah,U., Kholifah, W. D. N., &\nMerillarosa, I. (2019). Analisis risiko bahaya pada pekerja di tempat penampungan\nsampah terpadu reduce reuse recycle (Tpst 3R)Mulyoagung Bersatu Dau Kabupaten\nMalang. Preventia: The Indonesian Journal of Public Health, 4(2),\n110.https://doi.org/10.17977/um044v4i2p110-115 [accessed Jan 22 2025].\nShinde, R., Vasekar, S., Patil, V., Tamkhade, J. P., Ingale, A., & Kshirsagar, K. P. (2024).\nAutomated Garbage Separation Using AI Based Robotic Arm. J. Electrical Systems ,\n516-529.\nHariyadi, Chaerani, A., Astawati, L. D., & Wijaya, R. A. (2020). PERENCANAAN\nTEMPAT PEMBUANGAN SAMPAH DAN PENGOLAHAN SAMPAH BERBASIS\n3R (REDUCE, REUSE, RECYCLE) DI DESA SUKADANA. Jurnal Warta Desa, e-\nISSN : 2685 – 2101.\nSistem Informasi Pengelolaan Sampah Nasional (SIPSN). (2020). Capaian Kinerja\nPengelolaan Sampah. Diakses pada 22 januari 2025 dari\nhttps://sipsn.menlhk.go.id/sipsn/\nBarik, H., K.Tulsi, Devi, S., Subbulaxmi, Prasad, G., & Ambedkar, D.B. (2021). Automatic\nsegregate : Dry and Wet segregation using CNN(Deep Learning) with Robotic arm.\nInternational journal of creative research thoughts. ISSN: 2320-2882\nMedan, 22 Januari 2025\nMahasiswa yang mengajukan,\nErli Gurning\nNIM. 211402123",
  "similar_tokens": [
    "isi",
    "liput",
    "bantu",
    "barang",
    "siklus",
    "collection",
    "usu",
    "journal",
    "wang",
    "letak",
    "fokus",
    "bas",
    "daya",
    "masuk",
    "management",
    "manfaat",
    "angkat",
    "et",
    "teliti",
    "sifat",
    "cahaya",
    "w",
    "hasil",
    "research",
    "kontrol",
    "kerja",
    "format",
    "skom",
    "augmentasi",
    "informasi",
    "j",
    "mem",
    "robot",
    "an",
    "rotasi",
    "total",
    "kali",
    "referensi",
    "buah",
    "industri",
    "d",
    "butuh",
    "dalam",
    "padang",
    "email",
    "performa",
    "sumatera",
    "graphics",
    "alat",
    "kendali",
    "pe",
    "hubung",
    "olah",
    "juta",
    "beli",
    "nama",
    "tingkat",
    "implementation",
    "the",
    "batas",
    "average",
    "medan",
    "s",
    "pasang",
    "mahasiswa",
    "dimensi",
    "tahap",
    "masalah",
    "studi",
    "siap",
    "bidang",
    "ubah",
    "pp",
    "ssd",
    "f",
    "jenis",
    "nali",
    "sebab",
    "dosen",
    "httpsdoiorg",
    "terjemah",
    "pisah",
    "satu",
    "salah",
    "aju",
    "n",
    "dasar",
    "laman",
    "basah",
    "resizing",
    "l",
    "flipping",
    "klasifikasi",
    "beda",
    "kampus",
    "wadah",
    "latih",
    "usul",
    "temu",
    "generalisasi",
    "menit",
    "ulang",
    "i",
    "hadap",
    "desa",
    "kapasitas",
    "asal",
    "luas",
    "robotics",
    "p",
    "al",
    "representasi",
    "bahas",
    "vision",
    "ukur",
    "saran",
    "based",
    "ii",
    "mkom",
    "integrasi",
    "kumpul",
    "kolom",
    "y",
    "kurang",
    "pilih",
    "communications",
    "ringkas",
    "universitas",
    "sesuai",
    "khusus",
    "mit",
    "kelas",
    "resiko",
    "using",
    "perhati",
    "nasional",
    "ambil",
    "otomatis",
    "konversi",
    "computer",
    "sakit",
    "no",
    "cocok",
    "tenaga",
    "health",
    "capai",
    "jalan",
    "bimbing",
    "r",
    "h",
    "lingkung",
    "topik",
    "timbul",
    "alami",
    "v",
    "fungsi",
    "lokasi",
    "a",
    "k",
    "milik",
    "jurnal",
    "nip",
    "metrik",
    "kembang",
    "utara",
    "agam",
    "hidup",
    "indonesian",
    "tangkap",
    "solusi",
    "tuju",
    "manual",
    "o",
    "variasi",
    "uji",
    "centang",
    "guna",
    "implementasi",
    "form",
    "akses",
    "tambah",
    "tajam",
    "ringan",
    "evaluasi",
    "and",
    "with",
    "indonesia",
    "ilmu",
    "nyata",
    "kategori",
    "judul",
    "wakil",
    "buat",
    "real",
    "nila",
    "perangkat",
    "z",
    "latar",
    "program",
    "fakultas",
    "rencana",
    "bawa",
    "interaksi",
    "international",
    "ikut",
    "q",
    "gambar",
    "rendah",
    "skripsi",
    "kamera",
    "e",
    "tantang",
    "era",
    "c",
    "banyak",
    "pemrosesan",
    "manusia",
    "kelola",
    "cepat",
    "tulis",
    "pi",
    "perintah",
    "survei",
    "kertas",
    "material",
    "rumus",
    "bagi",
    "mampu",
    "g",
    "didik",
    "layak",
    "for",
    "m",
    "intelligent",
    "lite",
    "utama",
    "metodologi",
    "atur",
    "x"
  ],
  "filename": "1752039706_Exum_211402123.pdf",
  "user_id": 17
}