{
  "original_text": "Judul Skripsi: Implementasi Convolutional Neural Network (CNN) untuk Mendeteksi dan\nMengenali Wajah Mahasiswa pada Sistem Absensi Otomatis\nPenulis: Muhammad Ryan Aditya Siregar (NIM 171401048)\nProgram Studi: S1 Ilmu Komputer, Universitas Sumatera Utara\nTahun: 2024\n1. Latar Belakang (Lengkap)\nAbsensi merupakan bagian penting dari kegiatan akademik di perguruan tinggi. Sistem absensi\nkonvensional seperti tanda tangan manual atau pemindaian kartu mahasiswa memiliki beberapa\nkelemahan, antara lain rawan kecurangan (titip absen), tidak efisien, serta menyita waktu dosen.\nDi tengah perkembangan teknologi kecerdasan buatan, terutama bidang pengenalan wajah (facial\nrecognition), muncul peluang untuk membangun sistem absensi otomatis berbasis kamera.\nConvolutional Neural Network (CNN) merupakan salah satu metode deep learning yang terbukti\nefektif dalam mendeteksi dan mengenali objek visual, termasuk wajah manusia. CNN bekerja\ndengan mengekstraksi fitur-fitur visual penting dari gambar, kemudian melakukan klasifikasi.\nDengan memanfaatkan CNN, sistem absensi dapat mengenali identitas mahasiswa secara\notomatis hanya dari gambar wajah mereka, sehingga meminimalkan potensi kecurangan dan\nmeningkatkan efisiensi proses.\nPenelitian ini bertujuan untuk mengimplementasikan CNN dalam mendeteksi dan mengenali\nwajah mahasiswa pada saat proses absensi, serta membangun prototipe sistem absensi otomatis\nyang praktis digunakan di lingkungan kampus.\n2. Tujuan Penelitian\nMenerapkan algoritma CNN untuk deteksi dan pengenalan wajah mahasiswa secara akurat.\nMembangun sistem absensi otomatis berbasis pengenalan wajah.\nMengevaluasi performa model CNN dalam mengenali wajah dari citra real-time.\n3. Ruang Lingkup dan Batasan\nDataset wajah terbatas pada sejumlah mahasiswa tertentu.\nLingkungan pengujian dilakukan di dalam ruangan dengan pencahayaan stabil.\nSistem tidak menangani deteksi spoofing (pemalsuan wajah menggunakan foto/video).\n4. Metodologi\nPengumpulan Data: Foto wajah mahasiswa dikumpulkan secara langsung dan disimpan sebagai\ndataset lokal.\nPreprocessing:\nKonversi citra ke grayscale atau RGB konsisten.\nNormalisasi ukuran citra.\nModel CNN:\nBeberapa layer konvolusi, ReLU, pooling, dan fully connected.\nPelatihan model dilakukan menggunakan dataset wajah mahasiswa.\nEvaluasi menggunakan data uji (split train/test).\nPengembangan Sistem:\nIntegrasi kamera untuk pengambilan gambar real-time.\nAbsensi dilakukan otomatis saat wajah dikenali sesuai database.\nEvaluasi:\nMetrik: akurasi deteksi, kecepatan proses, kesalahan identifikasi.\n5. Hasil Penelitian\nModel CNN mampu mendeteksi dan mengenali wajah mahasiswa dengan tingkat akurasi tinggi\n(nilai spesifik akurasi dijelaskan dalam hasil eksperimen).\nSistem absensi otomatis berjalan dengan baik, dan berhasil mencatat kehadiran berdasarkan\npengenalan wajah secara real-time.\nModel menunjukkan resistensi terhadap perubahan ekspresi wajah dan posisi kepala yang ringan,\nnamun masih sensitif terhadap pencahayaan ekstrem.\n6. Manfaat dan Implikasi\nMeningkatkan efisiensi dan kejujuran sistem absensi di kelas.\nMengurangi beban administratif dosen dalam pengelolaan presensi.\nMemberikan landasan bagi pengembangan sistem manajemen kehadiran berbasis AI di institusi\npendidikan.\n7. Kesimpulan\nCNN terbukti efektif dalam membangun sistem absensi otomatis berbasis pengenalan wajah.\nModel yang dikembangkan mampu melakukan deteksi dan klasifikasi wajah mahasiswa dengan\ntingkat akurasi yang baik. Sistem ini memberikan alternatif inovatif untuk proses absensi yang\ncepat, efisien, dan minim manipulasi. Penelitian ini membuka peluang untuk pengembangan\nlebih lanjut seperti integrasi dengan sistem akademik kampus dan pengenalan multi-wajah secara\nparalel.",
  "similar_tokens": [
    "absen",
    "tuju",
    "hasil",
    "dosen",
    "peluang",
    "kembang",
    "beban",
    "cepat",
    "aditya",
    "absensi",
    "kampus",
    "bukti",
    "hadir",
    "connected",
    "administratif",
    "bangun",
    "jalan",
    "dasar",
    "tingkat",
    "visual",
    "alternatif",
    "buat",
    "batas",
    "lingkung",
    "cahaya",
    "realtime",
    "deteksi",
    "citra",
    "curang",
    "teliti",
    "akurat",
    "bidang",
    "nali",
    "bas",
    "wajah",
    "gambar",
    "efektif",
    "integrasi",
    "kumpul",
    "efisien",
    "akademik",
    "mahasiswa",
    "kamera",
    "otomatis",
    "efisiensi"
  ],
  "filename": "exum_171401048.pdf",
  "user_id": 17
}