{
  "original_text": " \n   \n \n \n \n \n \n \n \n \n  \nFORM PENGAJUAN JUDUL  \n \nNama  : Dhani Dwi Septian Bangun   \nNIM  : 211402120  \nJudul diajukan oleh*  :          Dosen               \n             Mahasiswa   \nBidang Ilmu (tulis dua bidang)  :                      = \n \nUji Kelayakan Judul**  :         Diterima           Ditolak                                                              \nHasil Uji Kelayakan Judul :  \n             \n \n \n \n \n \n \n \n \n \n \nCalon Dosen Pembimbing I:  \nMohammad Fadly Syah Putra, M.Sc  \n(Jika judul dari dosen maka dosen tersebut berhak menjadi pembimbing I)  \nCalon Dosen Pembimbing II:  \nDr. Muhammad Anggia Muchtar, S.T., MM.IT.  \n     Medan,    November 2024  \n     Ka. Laboratorium Penelitian,   \n \n \n \n \n* Centang salah satu atau keduanya              (Fanindia Purnamasari, S.TI., M.IT ) \n** Pilih salah satu                        NIP.198908172019032023     \n1. Data Science and Intelligent System  \n2. Machine Learning  \n \nParaf Calon Dosen  Pembimbing I  \n \n   \n \n \n \nRINGKASAN JUDUL YANG DIAJUKAN  \n \n*Semua kolom di bawah ini diisi oleh mahasiswa yang sudah mendapat judul  \nJudul / Topik \nSkripsi  Implementasi Graph -Based Retrieval Augmented Generation (GraphRAG) pada Large \nLanguage Model (LLM) pada Pengembangan Chatbot Virtua l Assistant Universitas \nSumatera Utara  \nLatar Belakang \ndan Penelitian \nTerdahulu  Latar Belakang  \n \nTeknologi informasi berkembang pesat dan telah membawa dampak yang signifikan di berbagai \nbidang, termasuk bidang pendidikan. Teknologi membantu pekerjaan manusia dalam berbagai \nbidang menjadi lebih cepat terselesaikan. Di era digital ini, universitas dituntut untuk \nmenyediakan layanan informasi yang cepat, akurat,  dan   efisien   guna   memenuhi   kebutuhan   \nmahasiswa   dan   masyarakat   luas   (Khan,   2018). Universitas Sumatera Utara (USU) memiliki \nberbagai layanan berbasis website seperti portal akademik, situs resmi universitas, situs fakultas, \ndan layanan lainnya. Namun, banyaknya website yang tersedia sering kali membuat mahasiswa, \ndosen, maupun staf kesu litan mengakses informasi yang mereka butuhkan secara cepat dan \nefisien. Pengguna harus mengunjungi beberapa situs atau aplikasi berbeda untuk menemukan \ninformasi spesifik, yang dapat mengakibatkan kebingungan dan pemborosan waktu. Untuk \nmengatasi kendala ini, Universitas Sumatera Utara perlu mengembangkan solusi yang lebih \nterintegrasi dan ramah pengguna.  \n \nSalah satu alternatif yang dapat diterapkan adalah pengembangan virtual assistant berbasis \nkecerdasan buatan menggunakan chatbot. Chatbot memiliki kemampuan untuk memahami \npermintaan pengguna dan memberikan respons yang relevan dalam waktu singkat, sehingga \nmenghemat waktu dibandingkan pencarian manual melalui situs web atau mesin pencari seperti \nGoogle.  Dengan kemampuan chatbot  untuk merespons pertanyaan dengan cepat dan tepat,  \ndiharapkan  dapat  mengurangibeban  kerja  staf  administrasi  serta  meningkatkan  pengalaman \npengguna  dalam  mengakses informasi akademik (Hussain  et al., 2021 ). Salah satu penerapan \nChatbot yaitu m engguna kan Large Language Models (LLM) . LLM adalah salah satu jenis model \nAI yang dapat memproses dan menghasilkan teks bahasa. Model  pada LLM  umumnya  dilatih  \ndengan menggunakan sejumlah besar data teks dan menggunakan teknik pembelajaran \nmendalam atau deep learning  untuk mempelajari pola dan struktur bahasa  (M.U. Hadi et al, \n2021). Kehadiran  LLM sendiri menjadi sebuah   fenomena luar biasa pada beberapa tahun \nterakhir ini, tepatnya  setelah kehadiran ChatGPT yang dirilis oleh perusahaan OpenAI pada \nbulan November 2022 yang lalu. Hanya dalam kurun waktu dua bulan setelah perilisannya, pada \nJanuari 2023 jumlah  pengguna ChatGPT telah mencapai 100 juta pengguna di selu ruh dunia (Hu \n& Krystal, 2023).  \n \nHal ini mengindikasikan bahwa chatbot dapat menjadi solusi efektif untuk meningkatkan \naksesibilitas informasi, khususnya di lingkungan universitas.  Chatbot semakin popular \ndigunakan dalam bidang Pendidikan karena dapat meningkatkan interaksi antara institusi dan \npengguna. Dalam studi  yang  dilakukan  oleh  Fatima  et  al.  (2020),  ditemukan  bahwa \nchatbotdapat  membantu  mengurangi  waktu  tunggu  untuk  mendapatkan  informasi  dan  \nmenyediakan dukungan 24/7 kepada pengguna. Hal inisangat penting dalam konteks akademik, \ndi mana informasi sering kali dibutuhkan di luar jam kerja.  \n \nDalam penelitian ini, metode Graph -Based Retrieval  Augmented Generation (GraphRAG) \ndiimplementasikan untuk mendukung performa chatbot berbasis LLM.  Selain itu, pendekatan \nGraphRAG  tidak hanya meningkatkan akurasi jawaban, tetapi juga memastikan bahwa  \n   \n \n \ninformasi yang disampaikan selalu relevan dan terkini. Hal ini menjadi penting dalam \nlingkungan universitas, di mana kebutuhan informasi dapat sangat dinamis, mencakup jadwal \nakademik, pengumuman, prosedur administratif, hingga data penelitian. Dengan menerapkan \nGraphRAG, chatbot mampu mengakses dan m enghubungkan berbagai sumber data internal \nUniversitas Sumatera Utara secara efektif, sehingga memberikan pengalaman yang lebih \npersonal dan interaktif bagi penggunanya .  \n \nBerdasarkan permasalahan yang sudah diuraikan sebelumnya, maka sangat diperlukan solusi \nuntuk mengatasinya. Salah satu cara untuk meminimalisir waktu dalam penyampaian informasi \nakademik di Universitas Sumatera Utar a dengan penerapan chatbot, diharapkan dapat mengatasi \nmasalah keterlambatan dalam mengakses informasi akademik.  \n \nTerdapat penelitian terkait yang dilakukan oleh Lilit Galstyan  dan Hovhannes Martirosyan  \n(2024) yang berjudul “ SmartAdvisor University Chatbot  Spring 2024 ”. Penelitian ini \nmemanfaatkan kemampuan model pembuatan teks untuk menghadirkan chatbot penasihat \nakademik yang inovatif dan personal. Tujuan utama penelitian ini untuk mengembangkan \nsumber daya menyeluruh yang menggabungkan pengetahuan tentang universita s program studi \nuntuk mahasiswa. Penelitian ini memanfaatkan basis data vektor bersama dengan kerangka kerja \nRetrival -Augmented Generation (RAG).  \n \nPenelitian lainnya dilakukan oleh Rachmat & Kesuma (2024) yang berjudul Implementasi Large \nLanguage Models Gemini Pada Pengembangan Aplikasi  Chatbot Berbasis Android. Penelitian \nini dilakukan untuk memahami bagaimana implementasi API key Gemini . API key Gemini \ndapat dilakukan pada aplikasi AI, khususnya pada aplikasi chatbot, dan apakah aplikasi chatbot \nyang dibangun menggunakan Gemini dapat berfungsi sesuai dengan fungsionalitas Gemini LLM \nitu sendiri.  Setelah aplikasi chatbot yang dimaksud selesai dibuat dan diuji coba, didapatkan \nbahwa aplikasi chatbot yang dihasilkan aplikasi chatbot yang dihasilkan berfungsi sesuai dengan \nyang diharapkan dan mampu memanfaatkan fungsionalitas LLM Gemini.  \n \nPenelitian lainnya dilakukan oleh Julius Odede & Ingo Frommholz (2024) yang berjudul JayBot \n– Aiding University Students and Admission with an  LLM -based Chatbot . Penelitian ini \nmenyajikan JayBot yaitu sistem chatbot berbasis LLM yang bertujuan untuk  meningkatkan \npengalaman pengguna dosen, staf, calon mahasiswa dan mahasiswa di sebuah universitas di \ninggris.  \n \nPenelitian lainnya dilakukan oleh Radhakrishnan & Dias  (2023) yang berjudul Use of a ChatBot -\nBased Advising System for the  Higher -Education System . Penelitian ini memperkenalkan \nmekanisme yang layak untuk sistem pemberian saran berbasis chatbot. penelitian ini \nmenggunakan Large Language Model (LLM) yang bersifat opensource yang dikombinasikan \ndengan basis pengetahuan khusus untuk mengatasi aspek -aspek penting yang diperlukan untuk \nsistem pemberian saran berbasis chatbot, seperti personalisasi, mem ori percakapan, dan \nkemudahan pemeliharaan.  Sistem yang diusulkan menunjukkan tingkat akurasi respons sebesar \n89% yang membuktikan bahwa pendekatan baru dari arsitektur berbasis komponen ini unggul \ndalam hal kinerja jika dibandingkan dengan pendekatan serupa.  \n \nBerdasarkan dari latar belakang dan beberapa penelitian terdahulu yang telah diuraikan di atas, \ndapat ditarik kesimpulan bahwa sistem Natural Language Processing merupakan suatu solusi \nyang tepat. Maka penulis mengajukan untuk melakukan penelitian mengenai pembuatan system \n“Implementasi Graph -Based Retrieval Augmented Generation (GraphRAG) pada Large \nLanguage Model (LLM) pada Pengembangan Chatbot Virtual Assistant Universitas \nSumatera Utara”.  \n  \n   \n \n \nPenelitian Terdahulu  \nNo. Penulis  Judul  Tahun  \n1. Lilit Galstyan  dan \nHovhannes \nMartirosyan  SmartAdvisor University Chatbot  \nSpring 2024  2024 \n2. Rachmat & \nKesuma  Implementasi Large Language Models \nGemini Pada Pengembangan Aplikasi  \nChatbot Berbasis Android  2024 \n3. Leonardo  \npasquarelli ,  \nCharles  \nKoutcheme ,  \nArto Hellas  Comparing the Utility, Preference, and \nPerformance of Course Material Search  \nFunctionality and Retrieval -Augmented \nGeneration Large Language Model  \n(RAG -LLM) AI Chatbots in Information -\nSeeking Tasks  2024 \n4. Odede Ingo \nFrommholz \nJAOdede  JayBot – Aiding University Students and \nAdmission with an  LLM -based Chatbot  2024 \n5. Joni Salminen , \nSoon -gyo Jung , \nJohanne Medina , \nKholoud Aldous , \nJinan Azem , \nWaleed Akhtar , \nBernard J. Jansen  Using Cipherbot: An Exploratory Analysis \nof Student  \nInteraction with an LLM -Based Educational \nChatbot  2024  \n6. Radhakrishnan & \nDias Use of a ChatBot -Based Advising System \nfor the  \nHigher -Education System  2023   \n   \n \n \n7. Pandey & Sharma  A comparative study of retrieval -based and \ngenerative -based chatbots using  \nDeep Learning and Machine Learning  2023  \n8. Sruti Srinivasa \nRagavan, \nMohammad \nAmin Alipour  Revisiting Human Information Foraging: \nAdaptations for LLM -based Chatbots  2024  \n \nRumusan Masalah  Universitas Sumatera Utara (USU) menyediakan berbagai layanan berbasis website seperti \nportal akademik, situs resmi  universitas, dan situs fakultas. Namun, dengan banyaknya situs \nyang tersedia, sering kali mahasiswa, dosen, dan staf mengalami kesulitan dalam mengakses \ninformasi dengan cepat dan efisien. Proses pencarian informasi yang tersebar di berbagai \nplatform dapa t membingungkan pengguna dan membuang waktu yang seharusnya bisa \ndigunakan untuk tujuan lainnya. Oleh karena itu  dibutuhkan sebuah sistem chatbot berbasis \nkecerdasan buatan (AI) yang dapat menyederhanakan proses pencarian dengan memberikan \njawaban yang cepat, relevan, dan mudah diakses oleh pengguna . Penerapan teknologi ini dalam \nchatbot di lingkungan universitas dapat meningkatkan pengalaman pengguna dalam mengakses \ninformasi akademik dan administratif secara lebih cepat dan akurat.  \n \n  \n   \n \n \nMetodologi   \n \n \n1. Raw Data Sources:  Data mentah dikumpulkan dari berbagai sumber, seperti \ndokumen teks, PDF, database, atau file lainnya. Data ini biasanya tidak terstruktur \natau semi -terstruktur.  \n \n2. Data Preparation:  Data mentah dibersihkan dan diubah ke  format yang lebih \nterstruktur, seperti menghapus duplikasi, mengisi data yang hilang, atau mengatur \nulang formatnya agar siap untuk diproses lebih lanjut.  \n \n3. Information Extraction:  Informasi penting diambil dari data yang telah \ndipersiapkan menggunakan teknik seperti OCR, Natural Language Processing \n(NLP), atau ekstraksi pola tertentu. Contoh hasilnya adalah entitas seperti nama, \ntanggal, atau angka.  \n \n4. Chunking:  Data yang diekstraksi dipecah menjadi unit kecil (chunks) untuk \nmemudahkan pengolahan. Potongan -potongan ini dapat berupa kalimat, paragraf, \natau segmen teks.  \n \n5. Embedding:  Setiap potongan data diubah menjadi representasi numerik atau \nvektor menggunakan algoritma embedding. Representasi ini memungkinkan \nkomputer memahami hubungan antar data dalam bentuk matematika.  \n \n6. Vector Database:  Vektor hasil embedding disimpan dalam basis data khusus \nuntuk mendukung pencarian cepat berdasarkan kesamaan atau jarak antar vektor.  \n \n \n   \n \n \n7. Query:  Pengguna memberikan input berupa pertanyaan atau kata kunci yang ingin \ndicari informasinya dalam sistem.  \n \n8. Embedding (Query):  Pertanyaan atau query pengguna diubah menjadi vektor \nembedding menggunakan metode yang sama seperti pada data, sehingga dapat \ndibandingkan dengan data yang ada.  \n \n9. Retrieval:  Sistem membandingkan vektor query dengan vektor data dalam \ndatabase untuk menemukan data yang paling relevan. Proses ini dilakukan dengan \nmengukur kesamaan antar vektor.  \n \n10. Relevant Data:  Data yang dianggap paling relevan dengan query pengguna \ndiambil dari database untuk diproses lebih lanjut.  \n \n11. LLM(s):  Data relevan yang telah ditemukan diproses oleh model bahasa besar \n(Large Language Model), seperti GPT, untuk menghasilkan jawaban atau respons \nyang sesuai dengan konteks query.  \n \n12. Response:  Jawaban atau informasi yang telah diolah oleh model bahasa besar \ndiberikan kembali kepada pengguna dalam format yang mudah dipahami.  \nReferensi   \nKhan, M.S. (2018). Impact of Information Technology on Education Sector . International  \n          Journal of Advanced in Computer Science and Management Studies , 6(5), 1 -5  \n \nHussain, W., Shad, A. B., & Jabeen, F. (2021). Chatbots in Higher Education: A review.  \n         International Journal of Education Technology in Higher Education , 18(1), 1 -5.  \n \nFatima, S., Aslam, N., & Hussain, M. (2020). Evaluating the Performance of Chatbots in  \n        Education: A systematic Review. Journal of Education Computing Research , 58(5),  \n        1007 -1027.  \n \nM. U. Hadi, Q. Al -Tashi, R. Qureshi dan e.a., “Large Language Models: A Comprehensive  \n         Applications, Challenges, Limitations, and Future Prospects, “ TechRxiv, vol.4,  \n         September 2023, https://doi.org  \n \nMedan, 22 Januari  2025 \nMahasiswa yang mengajukan,  \n \n \n \n \n(Dhani Dwi Septian Bangun ) \n         NIM. 211402120  \n",
  "similar_tokens": [
    "t",
    "i",
    "n",
    "g",
    "k",
    "a",
    "t",
    " ",
    "s",
    "e",
    "s",
    "u",
    "a",
    "i",
    " ",
    "p",
    "e",
    "r",
    "f",
    "o",
    "r",
    "m",
    "a",
    " ",
    "i",
    "n",
    "f",
    "o",
    "r",
    "m",
    "a",
    "s",
    "i",
    " ",
    "a",
    "k",
    "a",
    "d",
    "e",
    "m",
    "i",
    "k",
    " ",
    "p",
    "i",
    "l",
    "i",
    "h",
    " ",
    "a",
    "s",
    "p",
    "e",
    "k",
    " ",
    "d",
    "a",
    "s",
    "a",
    "r",
    " ",
    "t",
    "e",
    "l",
    "i",
    "t",
    "i",
    " ",
    "a",
    "j",
    "a",
    "r",
    " ",
    "a",
    "n",
    "d",
    " ",
    "b",
    "a",
    "n",
    "t",
    "u",
    " ",
    "s",
    "t",
    "u",
    "d",
    "i",
    " ",
    "s",
    "a",
    "l",
    "a",
    "h",
    " ",
    "h",
    "a",
    "r",
    "a",
    "p",
    " ",
    "d",
    "i",
    "d",
    "i",
    "k",
    " ",
    "m",
    "a",
    "h",
    "a",
    "s",
    "i",
    "s",
    "w",
    "a",
    " ",
    "g",
    "u",
    "n",
    "a",
    " ",
    "a",
    "t",
    "a",
    "s",
    " ",
    "p",
    "e",
    "r",
    "s",
    "o",
    "n",
    "a",
    "l",
    " ",
    "d",
    "e",
    "k",
    "a",
    "t",
    " ",
    "j",
    "u",
    "d",
    "u",
    "l",
    " ",
    "b",
    "i",
    "d",
    "a",
    "n",
    "g",
    " ",
    "k",
    "e",
    "m",
    "b",
    "a",
    "n",
    "g"
  ],
  "output_path": "uploads\\results\\22\\Exum_211402143_exum_combined.pdf",
  "user_id": 22
}