{
  "original_text": "Judul Skripsi : Evaluasi Kinerja Web Server Nginx, Litespeed, dan Apache terhadap Beban \nKerja Ekstrim dengan Metode Stress Testing pada Layanan Amazon Elastic Compute Cloud \n(AWS EC2)  \nPenulis : Fajar Fakhri (NIM 171401062 ) \nProgram Studi : S1 Ilmu Komputer, Universitas Sumatera Utara  \nTahun : 2024  \n \n1. Latar Belakang (Lengkap)  \nSeiring dengan berkembangnya teknologi digital dan meningkatnya ketergantungan terhadap \nlayanan daring, kebutuhan akan sistem web yang cepat, andal, dan tahan terhadap beban kerja \ntinggi menjadi sangat penting. Website dan web aplikasi modern melayani ribuan hingga jutaan \npermintaan pengguna setiap harinya, terutama pada sektor komersial, pendidikan, maupun \npemerintahan.  \nWeb server bertugas sebagai jembatan antara klien dan ko nten situs web, dan performa web \nserver sangat menentukan kualitas layanan pengguna. Nginx, Apache, dan LiteSpeed adalah tiga \nweb server populer yang banyak digunakan karena masing -masing memiliki karakteristik \nperforma, konfigurasi, dan efisiensi yang ber beda. Namun, belum banyak studi komparatif yang \nsecara objektif menguji ketiga web server tersebut dalam kondisi beban kerja ekstrim , terutama \ndalam konteks implementasi cloud modern seperti Amazon Web Services Elastic Compute \nCloud (AWS EC2) . \nUntuk menilai performa web server secara adil, dilakukan pendekatan stress testing , yakni \nmetode pengujian yang memberikan beban kerja berlebih untuk mengetahui seberapa kuat dan \nresponsif sistem terhadap tekanan yang tinggi. Penelitian ini bertujuan menge valuasi performa \nketiga web server berdasarkan beberapa parameter utama seperti response time, error rate, \nthroughput, data sent, dan data received  dalam lingkungan uji yang seragam menggunakan \nAWS EC2.  \n \n2. Tujuan Peneli tian \n Mengevaluasi dan membandingkan performa Nginx, LiteSpeed, dan Apache \nmenggunakan metode stress testing.  \n Menentukan web server yang paling optimal digunakan dalam kondisi beban kerja \nekstrim.  \n Menyediakan panduan teknis dalam pemilihan web server berbas is cloud untuk skenario \nimplementasi nyata.  \n \n3. Batasan dan Lingkup Penelitian   Pengujian hanya dilakukan pada tiga web server: Nginx, LiteSpeed, dan Apache.  \n Platform uji menggunakan instansi virtual AWS EC2.  \n Beban kerja d ikendalikan dengan tools seperti Apache JMeter.  \n Pengujian dilakukan dalam skenario berulang dengan kondisi jaringan dan spesifikasi \ninstansi yang seragam.  \n \n4. Metodologi  \n Perancangan Infrastruktur Uji : Deploy instansi AWS  EC2 dengan konfigurasi yang \nidentik.  \n Instalasi dan Konfigurasi : Masing -masing web server diatur untuk menerima beban \nkerja dari Apache JMeter.  \n Stress Testing : Melibatkan permintaan HTTP secara simultan dalam jumlah besar untuk \nmengukur performa server.  \n Pengukuran Parameter : \no Response Time : Kecepatan server merespons permintaan.  \no Error Rate : Persentase permintaan gagal.  \no Throughput : Jumlah request per detik.  \no Data Sent/Received : Total volume data keluar/masuk.  \n \n5. Hasil Penel itian  \n LiteSpeed  menunjukkan performa terbaik dari sisi error rate , dengan jumlah permintaan \ngagal paling sedikit.  \n Apache  memiliki keunggulan dalam efisiensi bandwidth dengan data sent dan received \npaling kecil.  \n Nginx  unggul dalam beberapa aspek throughput , tetapi memiliki hasil yang fluktuatif \ntergantung skenario uji.  \n Perbandingan menunjukkan bahwa masing -masing web server memiliki keunggulan \ntersendiri tergantung kebutuhan sistem dan jenis beban kerja.  \n \n6. Manfaat Penel itian  \n Memberikan referensi teknis berbasis data untuk pengembang dan administrator sistem \ndalam memilih web server.  \n Mendorong efisiensi layanan web pada platform cloud seperti AWS dengan memilih \narsitektur server yang optimal.  \n Menambah literatur pengujian performa sistem berbasis cloud yang masih terbatas di \nranah akademik.   \n7. Kesimpulan  \nKetiga web server yang diuji memiliki performa yang baik namun dengan keunggulan yang \nberbeda. LiteSpeed u nggul dalam stabilitas error, Apache lebih efisien dalam penggunaan \nbandwidth, dan Nginx memiliki performa throughput yang kompetitif. Pemilihan web server \nterbaik sangat bergantung pada kebutuhan spesifik sistem , seperti fokus pada kestabilan, \nefisiensi d ata, atau kecepatan layanan. Penelitian ini berhasil menunjukkan pentingnya pengujian \nstress secara komprehensif sebelum implementasi layanan skala besar.  \nJudul Skripsi: Evaluasi Kinerja Web Server Nginx, Litespeed, dan Apache terhadap Beban Kerja Ekstrim \ndengan Metode Stress Testing pada Layanan Amazon Elasti c Compute Cloud (AWS EC2)  \nPenulis: Fajar Fakhri (NIM 171401062)  \nProgram Studi: S1 Ilmu Komputer, Universitas Sumatera Utara  \nTahun: 2024  \n \n1. Latar Belakang (Lengkap)  \nSeiring dengan berkembangnya teknologi digital dan meningkatnya ketergantungan terhadap lay anan \ndaring, kebutuhan akan sistem web yang cepat, andal, dan tahan terhadap beban kerja tinggi menjadi \nsangat penting. Website dan web aplikasi modern melayani ribuan hingga jutaan permintaan pengguna \nsetiap harinya, terutama pada sektor komersial, pendid ikan, maupun pemerintahan.  \n \nWeb server bertugas sebagai jembatan antara klien dan konten situs web, dan performa web server \nsangat menentukan kualitas layanan pengguna. Nginx, Apache, dan LiteSpeed adalah tiga web server \npopuler yang banyak digunakan karen a masing -masing memiliki karakteristik performa, konfigurasi, dan \nefisiensi yang berbeda. Namun, belum banyak studi komparatif yang secara objektif menguji ketiga web \nserver tersebut dalam kondisi beban kerja ekstrim, terutama dalam konteks implementasi cl oud modern \nseperti Amazon Web Services Elastic Compute Cloud (AWS EC2).  \n \nUntuk menilai performa web server secara adil, dilakukan pendekatan stress testing, yakni metode \npengujian yang memberikan beban kerja berlebih untuk mengetahui seberapa kuat dan resp onsif sistem \nterhadap tekanan yang tinggi. Penelitian ini bertujuan mengevaluasi performa ketiga web server \nberdasarkan beberapa parameter utama seperti response time, error rate, throughput, data sent, dan \ndata received dalam lingkungan uji yang seragam m enggunakan AWS EC2.  \n \n2. Tujuan Penelitian  Mengevaluasi dan membandingkan performa Nginx, LiteSpeed, dan Apache menggunakan metode \nstress testing.  \n \nMenentukan web server yang paling optimal digunakan dalam kondisi beban kerja ekstrim.  \n \nMenyediakan panduan teknis dalam pemilihan web server berbasis cloud untuk skenario implementasi \nnyata.  \n \n3. Batasan dan Lingkup Penelitian  \nPengujian hanya dilakukan pada tiga web server: Nginx, LiteSpeed, dan Apache.  \n \nPlatform uji menggunakan instansi virt ual AWS EC2.  \n \nBeban kerja dikendalikan dengan tools seperti Apache JMeter.  \n \nPengujian dilakukan dalam skenario berulang dengan kondisi jaringan dan spesifikasi instansi yang \nseragam.  \n \n4. Metodologi  \nPerancangan Infrastruktur Uji: Deploy instansi AWS EC2 den gan konfigurasi yang identik.  \n \nInstalasi dan Konfigurasi: Masing -masing web server diatur untuk menerima beban kerja dari Apache \nJMeter.  \n \nStress Testing: Melibatkan permintaan HTTP secara simultan dalam jumlah besar untuk mengukur \nperforma server.  \n \nPenguku ran Parameter:  \n \nResponse Time: Kecepatan server merespons permintaan.   \nError Rate: Persentase permintaan gagal.  \n \nThroughput: Jumlah request per detik.  \n \nData Sent/Received: Total volume data keluar/masuk.  \n \n5. Hasil Penelitian  \nLiteSpeed menunjukkan performa terbaik dari sisi error rate, dengan jumlah permintaan gagal paling \nsedikit.  \n \nApache memiliki keunggulan dalam efisiensi bandwidth dengan data sent dan received paling kecil.  \n \nNginx unggul dalam beberapa aspek throughput, tet api memiliki hasil yang fluktuatif tergantung \nskenario uji.  \n \nPerbandingan menunjukkan bahwa masing -masing web server memiliki keunggulan tersendiri \ntergantung kebutuhan sistem dan jenis beban kerja.  \n \n6. Manfaat Penelitian  \nMemberikan referensi teknis berbas is data untuk pengembang dan administrator sistem dalam memilih \nweb server.  \n \nMendorong efisiensi layanan web pada platform cloud seperti AWS dengan memilih arsitektur server \nyang optimal.  \n \nMenambah literatur pengujian performa sistem berbasis cloud yang ma sih terbatas di ranah akademik.  \n \n7. Kesimpulan  \nKetiga web server yang diuji memiliki performa yang baik namun dengan keunggulan yang berbeda. \nLiteSpeed unggul dalam stabilitas error, Apache lebih efisien dalam penggunaan bandwidth, dan Nginx memiliki perfo rma throughput yang kompetitif. Pemilihan web server terbaik sangat bergantung pada \nkebutuhan spesifik sistem, seperti fokus pada kestabilan, efisiensi data, atau kecepatan layanan. \nPenelitian ini berhasil menunjukkan pentingnya pengujian stress secara kom prehensif sebelum \nimplementasi layanan skala besar.  ",
  "similar_tokens": [
    "j",
    "u",
    "d",
    "u",
    "l",
    " ",
    "a",
    "t",
    "u",
    "r",
    " ",
    "a",
    "r",
    "s",
    "i",
    "t",
    "e",
    "k",
    "t",
    "u",
    "r",
    " ",
    "c",
    "e",
    "p",
    "a",
    "t",
    " ",
    "t",
    "e",
    "n",
    "t",
    "u",
    " ",
    "i",
    "l",
    "m",
    "u",
    " ",
    "k",
    "o",
    "n",
    "d",
    "i",
    "s",
    "i",
    " ",
    "s",
    "i",
    "m",
    "p",
    "u",
    "l",
    " ",
    "b",
    "a",
    "n",
    "d",
    "i",
    "n",
    "g",
    " ",
    "a",
    "p",
    "l",
    "i",
    "k",
    "a",
    "s",
    "i",
    " ",
    "i",
    "n",
    "f",
    "r",
    "a",
    "s",
    "t",
    "r",
    "u",
    "k",
    "t",
    "u",
    "r",
    " ",
    "b",
    "a",
    "s",
    " ",
    "d",
    "a",
    "s",
    "a",
    "r",
    " ",
    "h",
    "a",
    "s",
    "i",
    "l",
    " ",
    "j",
    "e",
    "n",
    "i",
    "s"
  ],
  "output_path": "uploads\\results\\17\\exum_171401085_exum_combined.pdf",
  "user_id": 17
}