{
  "original_text": "Judul Skripsi: Implementasi Algoritma Floyd Warshall dalam Mencari Jarak Terpendek Rumah\nSakit di Kota Medan\nPenulis: Surya Andika Ramadani Ginting (NIM 171401030)\nProgram Studi: S1 Ilmu Komputer, Universitas Sumatera Utara\nTahun: 2024\n________________________________________\n1. Latar Belakang (Lengkap)\nPelayanan kesehatan merupakan kebutuhan fundamental masyarakat yang harus tersedia dengan\ncepat dan tepat, terutama dalam kondisi darurat. Kota Medan sebagai salah satu kota besar di\nIndonesia memiliki banyak fasilitas kesehatan, termasuk rumah sakit dengan berbagai tipe dan\nlayanan. Namun, keberadaan fasilitas ini tidak selalu menjamin kemudahan akses, terutama\nketika masyarakat tidak mengetahui lokasi rumah sakit terdekat dari posisinya saat itu.\nDalam situasi kegawatdaruratan, waktu tempuh menuju rumah sakit menjadi faktor kritis yang\ndapat berdampak langsung pada keselamatan pasien. Oleh karena itu, penting untuk memiliki\nsistem yang dapat secara cepat menentukan rute atau jarak terpendek menuju rumah sakit\nterdekat dari titik pengguna. Permasalahan ini termasuk dalam domain pencarian shortest path\ndalam teori graf.\nSalah satu algoritma terkenal yang digunakan untuk menyelesaikan masalah pencarian jalur\nterpendek secara menyeluruh (dari semua simpul ke semua simpul) adalah algoritma Floyd-\nWarshall. Algoritma ini bekerja pada representasi graf berbentuk matriks, dan sangat cocok\nuntuk jaringan statis seperti peta rumah sakit di kota.\nPemilihan Floyd-Warshall juga didasarkan pada efisiensinya dalam memproses semua\nkemungkinan rute, dibandingkan algoritma lain yang lebih cocok untuk satu titik asal ke satu\ntujuan. Hal ini penting karena sistem yang dibangun perlu mampu memberikan informasi jalur\nterpendek antar semua rumah sakit, bukan hanya dari satu titik ke satu titik.\nPenelitian ini bertujuan untuk mengimplementasikan algoritma Floyd-Warshall dalam bentuk\naplikasi desktop, menggunakan bahasa pemrograman Python, guna membantu masyarakat Kota\nMedan mengakses layanan kesehatan dengan lebih cepat dan efisien. Hasil sistem ini diharapkan\njuga dapat dijadikan referensi dalam pengembangan sistem informasi geografis dan manajemen\ntanggap darurat kota.\n________________________________________\n2. Tujuan Penelitian\nMenerapkan algoritma Floyd-Warshall untuk mencari jarak terpendek antar rumah sakit di Kota\nMedan.\nMembangun aplikasi desktop yang dapat memvisualisasikan hasil pencarian jalur secara\ninteraktif.\nMemberikan solusi praktis bagi pengguna dalam memilih rumah sakit terdekat, khususnya dalam\nkondisi darurat.\n________________________________________\n3. Batasan Masalah\nFokus pada pencarian jarak terpendek antar rumah sakit berdasarkan koordinat (graf berbobot).\nTidak membahas data real-time lalu lintas.\nImplementasi menggunakan Python dan aplikasi berbasis desktop.\n________________________________________\n4. Metodologi\nRepresentasi graf: Data jarak antar rumah sakit dikonversi ke dalam matriks bobot.\nAlgoritma utama: Floyd-Warshall diterapkan untuk menghitung jarak minimum antar semua\npasangan rumah sakit.\nPengembangan sistem:\nKonversi koordinat lokasi ke dalam format matriks.\nFlowchart sistem & antarmuka pengguna.\nVisualisasi jalur dan peta rumah sakit.\nPengujian: Validasi sistem berdasarkan akurasi jalur yang dihasilkan dan efisiensi waktu\nkomputasi.\n________________________________________\n5. Hasil Penelitian\nAplikasi berhasil menghitung dan menampilkan jarak terpendek dari satu rumah sakit ke lainnya\ndi Kota Medan.\nSistem memberikan informasi dalam bentuk peta dan matriks jarak yang mudah dipahami.\nFloyd-Warshall terbukti efisien dan akurat untuk konteks jaringan rumah sakit kota yang tidak\nterlalu besar.\n________________________________________\n6. Manfaat dan Implikasi\nMembantu masyarakat dalam mengambil keputusan cepat terkait fasilitas kesehatan.\nDapat digunakan oleh instansi seperti Dinas Kesehatan atau layanan darurat kota.\nBerpotensi dikembangkan menjadi sistem navigasi darurat berbasis web atau mobile dengan\ntambahan data lalu lintas.\n________________________________________\n7. Kesimpulan\nAlgoritma Floyd-Warshall mampu menyelesaikan permasalahan pencarian rute terpendek antar\nrumah sakit di Kota Medan secara efisien. Sistem yang dikembangkan dapat digunakan secara\npraktis oleh pengguna dan bersifat fleksibel untuk diterapkan di kota lain dengan penyesuaian\ndata.\n________________________________________\nJika sudah sesuai, aku akan lanjutkan dengan exum skripsi dari NIM 171401021 selanjutnya.\nSiap ya?\nYou said:\niyaaa\nChatGPT said:\nBerikut adalah executive summary lengkap untuk skripsi selanjutnya:\n________________________________________\n📱 Executive Summary (Versi Lengkap & Terstruktur)\nJudul Skripsi: Analisis Sentimen Masyarakat Terhadap Aplikasi PLN Mobile Menggunakan\nMetode Naïve Bayes dan Support Vector Machine\nPenulis: Novi Yolanda Siregar (NIM 171401021)\nProgram Studi: S1 Ilmu Komputer, Universitas Sumatera Utara\nTahun: 2024\n________________________________________\n1. Latar Belakang (Lengkap)\nPLN Mobile merupakan aplikasi digital yang dikembangkan oleh PT PLN (Persero) untuk\nmempermudah masyarakat dalam mengakses layanan kelistrikan seperti pembayaran tagihan,\npengaduan gangguan, hingga pemantauan konsumsi listrik. Seiring perkembangan teknologi dan\ndigitalisasi pelayanan publik, aplikasi ini menjadi salah satu strategi PLN untuk meningkatkan\nkepuasan pelanggan.\nNamun demikian, keberhasilan aplikasi tidak hanya dilihat dari sisi fungsionalitasnya, tetapi juga\ndari persepsi dan pengalaman pengguna yang dapat tercermin melalui opini mereka di media\nsosial, forum, atau kolom ulasan di Google Play Store. Sentimen masyarakat terhadap aplikasi\nini sangat penting untuk diketahui, guna mengevaluasi layanan serta mengambil keputusan\npengembangan sistem ke depan.\nAnalisis sentimen berbasis teks merupakan salah satu cabang dari Natural Language Processing\n(NLP) yang digunakan untuk mengklasifikasikan opini masyarakat ke dalam kategori positif,\nnegatif, atau netral. Untuk itu, digunakan pendekatan klasifikasi teks berbasis pembelajaran\nmesin (machine learning), seperti Naïve Bayes dan Support Vector Machine (SVM), dua\nalgoritma populer yang mampu memberikan hasil klasifikasi yang efisien pada dataset berukuran\nbesar dan tidak terstruktur.\nPenelitian ini berfokus pada analisis sentimen masyarakat terhadap aplikasi PLN Mobile, dengan\ntujuan mengetahui kecenderungan opini pengguna serta mengevaluasi kinerja dua algoritma\nklasifikasi teks yang berbeda.\n________________________________________\n2. Tujuan Penelitian\nMengumpulkan dan mengolah data opini masyarakat terhadap aplikasi PLN Mobile dari media\nsosial dan Google Play.\nMelakukan preprocessing teks untuk kebutuhan klasifikasi.\nMembangun model klasifikasi sentimen menggunakan Naïve Bayes dan Support Vector\nMachine.\nMembandingkan kinerja kedua algoritma dalam hal akurasi dan efektivitas klasifikasi.\n________________________________________\n3. Ruang Lingkup dan Batasan\nSumber data terbatas pada review dan komentar pengguna di Google Play Store dan media\nsosial.\nBahasa yang digunakan adalah Bahasa Indonesia.\nKategori sentimen dibatasi pada: positif, negatif, dan netral.\n________________________________________\n4. Metodologi\nPengumpulan data: Scraping ulasan pengguna dari Google Play Store terkait aplikasi PLN\nMobile.\nPreprocessing:\nTokenisasi\nCase folding\nStopword removal\nStemming (menggunakan Sastrawi)\nKlasifikasi:\nNaïve Bayes: probabilistik berdasarkan frekuensi kata.\nSVM: pemisahan optimal antar kelas berdasarkan margin maksimal.\nEvaluasi Model:\nMenggunakan Confusion Matrix untuk memperoleh akurasi, presisi, recall, dan f1-score.\nDibandingkan performa kedua algoritma.\n________________________________________\n5. Hasil Penelitian\nKedua algoritma mampu mengklasifikasikan sentimen dengan cukup baik.\nSVM menunjukkan performa lebih tinggi dibandingkan Naïve Bayes dalam hal akurasi.\nSentimen masyarakat terhadap PLN Mobile sebagian besar bersifat positif, namun tetap terdapat\nmasukan negatif yang dapat dijadikan bahan evaluasi bagi pengembang aplikasi.\n________________________________________\n6. Manfaat dan Implikasi\nMemberikan insight kepada PLN tentang persepsi masyarakat terhadap layanan digital mereka.\nMembantu manajemen dalam perbaikan dan pengembangan aplikasi berbasis kebutuhan\npengguna.\nMenjadi studi awal penerapan NLP dalam sektor pelayanan publik Indonesia.\n________________________________________\n7. Kesimpulan\nAnalisis sentimen menggunakan Naïve Bayes dan SVM dapat diterapkan secara efektif untuk\nmenilai opini masyarakat terhadap aplikasi PLN Mobile. Hasil klasifikasi menunjukkan\nkecenderungan sentimen pengguna serta menginformasikan performa terbaik dari metode SVM\nuntuk kasus ini. Penelitian ini dapat diperluas dengan menambah data dari platform lain dan\nmenggunakan pendekatan deep learning di masa depan.",
  "similar_tokens": [
    "titik",
    "pln",
    "media",
    "darurat",
    "performa",
    "bas",
    "mobile",
    "teks",
    "bahasa",
    "sehat",
    "efisien",
    "opini",
    "layan",
    "jarak",
    "skripsi",
    "guna",
    "negatif",
    "fasilitas",
    "kota",
    "butuh",
    "cepat",
    "bantu",
    "nave",
    "matriks",
    "informasi",
    "tuju",
    "nim",
    "masyarakat",
    "jalur",
    "lengkap",
    "kembang",
    "hasil",
    "aplikasi",
    "indonesia",
    "banding",
    "rumah",
    "cari",
    "sakit",
    "teliti",
    "terap",
    "medan",
    "desktop",
    "sentimen",
    "pendek",
    "salah",
    "dasar",
    "play"
  ],
  "filename": "exum_171401030.pdf",
  "user_id": 17
}