{
  "original_text": "FORM PENGAJUAN JUDUL\nNama : Nadya Ruth Enina Purba\nNIM : 211402154\nJudul diajukan oleh* : Dosen\n✓ Mahasiswa\nBidang Ilmu (tulis dua bidang) : 1. D a t a S=c ience\n2. Machine Learning\nUji Kelayakan Judul** : Diterima Ditolak\nHasil Uji Kelayakan Judul :\nCalon Dosen Pembimbing I:\nParaf Calon Dosen Pembimbing I\nAde Sarah Huzaifah, S.Kom., M.Kom.\nCalon Dosen Pembimbing II:\nFanindia Purnamasari, S.TI., M.IT.\nMedan, ......................................\nKa. Laboratorium Penelitian,\n* Centang salah satu atau keduanya Fanindia Purnamasari, S.TI., M.IT.\n** Pilih salah satu NIP. 198908172019032023\nRINGKASAN JUDUL YANG DIAJUKAN\n*Semua kolom di bawah ini diisi oleh mahasiswa yang sudah mendapat judul\nJudul / Topik Klasifikasi Popularitas Konten Media Sosial TikTok Berdasarkan Pola Interaksi dan\nSkripsi Sentimen Pengguna Menggunakan Indonesia Sentiment Lexicon (InSet Lexicon) dan\nLong Short-Term Memory (LSTM)\nLatar Belakang Latar Belakang\ndan Penelitian\nTerdahulu TikTok merupakan platform media sosial yang memungkinkan pengguna untuk membuat dan\nmembagikan video singkat, baik dengan maupun tanpa musik. Sejak kemunculannya, TikTok\nmengalami pertumbuhan pesat dan menjadi salah satu aplikasi dengan jumlah pengguna\nterbanyak di dunia. Namun, pada 3 Juli 2018, TikTok sempat diblokir di Indonesia karena\nberbagai laporan mengenai konten yang dianggap tidak sesuai. Satu minggu kemudian, aplikasi\nini kembali dibuka setelah melakukan perbaikan, termasuk penghapusan konten negatif dan\npenerapan batasan usia serta mekanisme keamanan.\nPerkembangan TikTok semakin pesat pada masa pandemi COVID-19, di mana kebijakan\npembatasan sosial membuat masyarakat lebih banyak menghabiskan waktu di rumah. TikTok\nmenjadi salah satu platform hiburan utama yang digunakan oleh berbagai kalangan untuk\nmengekspresikan kreativitas mereka melalui konten video. Lonjakan pengguna ini\nmenyebabkan peningkatan jumlah unggahan serta interaksi dalam platform, yang turut\nmendorong munculnya penelitian mengenai pola keterlibatan pengguna dan faktor yang\nmempengaruhi popularitas suatu konten. (Rizka, et al., 2021)\nBerbagai penelitian sebelumnya telah membahas tren penggunaan TikTok, termasuk dalam\naspek kesehatan, kreativitas, dan kesadaran sosial. Namun, penelitian yang berfokus pada\nklasifikasi popularitas konten TikTok berdasarkan pola interaksi pengguna dan analisis sentimen\nkomentar pengguna masih terbatas (Purba, K. R., & Ramli, R., 2023). Sebagian besar penelitian\nhanya menilai popularitas dari jumlah interaksi secara langsung, tanpa mempertimbangkan\npersepsi pengguna terhadap suatu video. Padahal, sentimen pengguna dapat memberikan\nwawasan tambahan mengenai bagaimana suatu konten diterima, apakah popularitasnya bersifat\npositif atau justru kontroversial.\nPenelitian ini bertujuan untuk mengklasifikasikan popularitas video TikTok berdasarkan pola\ninteraksi dan analisis sentimen menggunakan InSet Lexicon dan LSTM. Model yang\ndikembangkan akan mempertimbangkan jumlah likes, komentar, dan shares sebagai indikator\nengagement, serta menggunakan InSet (Indonesian Sentiment Lexicon) untuk mengevaluasi\nsentimen komentar pengguna (Desi et al, 2021). Dengan pendekatan ini, diharapkan dapat\ndiperoleh pemahaman yang lebih mendalam mengenai faktor-faktor yang berkontribusi terhadap\npopularitas suatu konten TikTok, sekaligus memberikan wawasan bagi kreator konten dan\nplatform dalam mengelola tren interaksi digital.\nPenelitian Terdahulu\nNo. Penulis Judul Tahun\nDesi Musfiroh,\nUlfa Khaira, Analisis Sentimen terhadap Perkuliahan\n1. Pradita Eko Daring di Indonesia dari Twitter Dataset 2021\nPrasetyo Utomo, Menggunakan InSet Lexicon\nTri Suratno\nThe analysis of TikTok posts of Malaysian\nK.R. Purba dan\n2. influencers: post categorization and 2023\nR. Ramli\nstrategies to improve popularity\nTsai, Min-Jen dan Predicting online news popularity based on\n3. 2022\nYou-Qing Wu machine learning\nHybrid Machine Learning Approach for\nJeon, H., Seo, W.,\nPopularity Prediction of Newly Released\n4. Park, E., dan 2020\nContents of Online Video Streaming\nChoi, S.\nServices\nCarta, S., Podda,\nA. S., Recupero,\n5. Popularity Prediction of Instagram Posts 2020\nD. R., Saia, R.,\ndan Usai, G.\nRumusan Masalah Dengan meningkatnya jumlah unggahan di platform ini, diperlukan metode yang dapat\nmengelompokkan video ke dalam kategori popularitas secara objektif dan akurat. Penelitian ini\nbertujuan untuk mengklasifikasikan popularitas konten TikTok berdasarkan pola interaksi\npengguna, yaitu jumlah likes, komentar, dan shares yang diterima setiap video. Penelitian ini\nmenggunakan model Long Short-Term Memory (LSTM) untuk mengklasifikasikan popularitas\nvideo TikTok berdasarkan kombinasi pola interaksi pengguna. Untuk menganalisis sentimen\npengguna, penelitian ini menggunakan Indonesia Sentiment Lexicon (InSet Lexicon) yang\ndiambil dari komentar suatu konten. Sentimen komentar dapat memberikan wawasan tambahan\nmengenai bagaimana suatu video diterima, apakah popularitasnya bersifat positif, netral, atau\nnegatif.\nMetodologi\nKeterangan:\nProses klasifikasi popularitas konten TikTok diawali dengan menentukan parameter data\nyang akan dikumpulkan. Akuisisi data dilakukan melalui API TikTok, mencakup jumlah\nlike, komentar, dan share, yang kemudian disimpan dalam format database API.\nSelanjutnya, dilakukan tahap normalisasi data yang meliputi pembersihan teks dari\nkarakter spesial, URL, dan emoji, serta tokenisasi, penghapusan stopword. Untuk analisis\nsentimen menggunakan InSet Lexicon yang mengkategorikan kata dalam bentuk positif,\nnegatif, dan netral; dan vektorisasi untuk mengubah teks menjadi representasi numerik.\nSetelah itu, fitur-fitur utama seperti jumlah interaksi dan sentimen dihitung sebagai\nvariabel input untuk model. Data kemudian dibagi menjadi tiga bagian yaitu training\n(80%), validation (10%), dan testing (10%).\nModel Long Short-Term Memory (LSTM) digunakan untuk memproses data, dengan\nembedding layer untuk konversi teks, LSTM layer untuk analisis pola interaksi yang\ndilihat dari jumlah like dan share, dan dense layer dengan softmax sebagai output untuk\nmengklasifikasikan tingkat popularitas ke dalam kategori rendah, sedang, atau tinggi.\nEvaluasi model dilakukan menggunakan metrik akurasi, precision, recall, dan F1-score,\nserta analisis confusion matrix. Nantinya output akan berbentuk tabel yang menampilkan\nkategori tiap video seperti sangat populer, populer, populer dengan sentimen negatif, agak\npopuler, dan tidak populer.\nReferensi Musfiroh, D., Khaira, U., Utomo, P. E. P., & Suratno, T. (2021). Analisis Sentimen\nterhadap Perkuliahan Daring di Indonesia dari Twitter Dataset Menggunakan\nInSet Lexicon: Sentiment Analysis of Online Lectures in Indonesia from Twitter\nDataset Using InSet Lexicon. MALCOM: Indonesian Journal of Machine\nLearning and Computer Science, 1(1), 24-33.\nPurba, K. R., & Ramli, R. (2023, July). The analysis of TikTok posts of Malaysian\ninfluencers: post categorization and strategies to improve popularity.\nIn International Conference on Green Energy, Computing and Intelligent\nTechnology (GEn-CITy 2023) (Vol. 2023, pp. 270-276). IET.\nTsai, M. J., & Wu, Y. Q. (2022). Predicting online news popularity based on machine\nlearning. Computers and Electrical Engineering, 102, 108198.\nJeon, H., Seo, W., Park, E., & Choi, S. (2020). Hybrid machine learning approach for\npopularity prediction of newly released contents of online video streaming\nservices. Technological Forecasting and Social Change, 161, 120303.\nCarta, S., Podda, A. S., Recupero, D. R., Saia, R., & Usai, G. (2020). Popularity prediction\nof instagram posts. Information, 11(9), 453.\nMedan, 7 Maret 2025\nMahasiswa yang mengajukan,\nNadya Ruth Enina Purba\nNIM. 211402154",
  "similar_tokens": [
    "tuju",
    "positif",
    "video",
    "sentimen",
    "wawas",
    "interaksi",
    "kategori",
    "prediction",
    "dosen",
    "sifat",
    "sentiment",
    "and",
    "konten",
    "purba",
    "terima",
    "ramli",
    "indonesia",
    "klasifikasi",
    "salah",
    "komentar",
    "dasar",
    "online",
    "twitter",
    "judul",
    "tiktok",
    "posts",
    "long",
    "pola",
    "popularitas",
    "based",
    "teks",
    "lexicon",
    "teliti",
    "popularity",
    "bidang",
    "carta",
    "calon",
    "sosial",
    "memory",
    "aplikasi",
    "negatif",
    "inset",
    "bimbing",
    "mahasiswa",
    "platform",
    "populer",
    "guna"
  ],
  "filename": "Exum_211402154.pdf",
  "user_id": 17
}