{
  "original_text": "Judul Skripsi: Analisis Sentimen Pengguna Terhadap Aplikasi Shopee Menggunakan Metode\nNaïve Bayes dan K-Nearest Neighbor\nPenulis: Muhammad Iqbal Siregar (NIM 171401017)\nProgram Studi: S1 Ilmu Komputer, Universitas Sumatera Utara\nTahun: 2024\n1. Latar Belakang (Lengkap)\nShopee merupakan salah satu platform e-commerce terbesar di Asia Tenggara, termasuk\nIndonesia. Dalam aktivitas transaksi digital, Shopee menyediakan layanan seperti belanja online,\npembayaran digital (ShopeePay), pengiriman barang, serta berbagai promosi. Namun,\nkesuksesan suatu aplikasi tidak hanya ditentukan oleh jumlah pengguna, melainkan juga oleh\ntingkat kepuasan dan persepsi mereka terhadap layanan yang diberikan.\nDengan tingginya jumlah ulasan yang masuk melalui Google Play Store, forum online, dan\nmedia sosial, opini masyarakat terhadap Shopee menjadi sumber data berharga yang dapat\ndimanfaatkan untuk mengetahui sentimen atau perasaan pengguna. Sentimen ini dapat digunakan\noleh perusahaan untuk memperbaiki kualitas aplikasi, merancang strategi pemasaran, dan\nmempertahankan loyalitas pengguna.\nUntuk menganalisis opini tersebut, metode analisis sentimen berbasis machine learning\ndigunakan. Penelitian ini secara khusus menggunakan dua metode klasifikasi populer dalam text\nmining, yaitu Naïve Bayes dan K-Nearest Neighbor (KNN). Keduanya diaplikasikan pada data\nteks ulasan pengguna untuk menentukan kecenderungan sentimen menjadi tiga kelas: positif,\nnegatif, dan netral.\n2. Tujuan Penelitian\nMelakukan klasifikasi sentimen terhadap opini pengguna aplikasi Shopee menggunakan metode\nNaïve Bayes dan K-Nearest Neighbor.\nMembandingkan performa kedua algoritma dalam mengklasifikasikan opini berdasarkan akurasi\ndan metrik evaluasi lainnya.\nMemberikan rekomendasi algoritma terbaik untuk kasus klasifikasi sentimen aplikasi e-\ncommerce.\n3. Ruang Lingkup dan Batasan\nData ulasan pengguna diperoleh dari Google Play Store.\nBahasa data adalah Bahasa Indonesia.\nSentimen dikategorikan menjadi: positif, negatif, dan netral.\nTidak dilakukan analisis aspek (aspect-based sentiment).\n4. Metodologi\nData Collection: Mengambil ulasan aplikasi Shopee dari Google Play Store.\nPreprocessing:\nCase folding, tokenisasi, stopword removal, dan stemming menggunakan library Sastrawi.\nModel Klasifikasi:\nNaïve Bayes: Berdasarkan probabilitas kata dan frekuensi kemunculan.\nKNN: Menggunakan jarak antar fitur teks (misal: Cosine similarity).\nEvaluasi:\nConfusion Matrix\nMetrik: Akurasi, Precision, Recall, dan F1-score\nSplit data training dan testing menggunakan beberapa rasio untuk perbandingan kinerja.\n5. Hasil Penelitian\nNaïve Bayes dan KNN berhasil mengklasifikasikan opini pengguna ke dalam tiga kelas\nsentimen.\nDari hasil evaluasi, algoritma Naïve Bayes menunjukkan akurasi yang lebih stabil dan lebih\ntinggi dibandingkan KNN.\nMayoritas opini pengguna terhadap aplikasi Shopee bersifat positif, menunjukkan kepuasan\nterhadap fitur dan layanan Shopee, walaupun tetap ditemukan sejumlah keluhan.\n6. Manfaat dan Implikasi\nMemberikan gambaran umum persepsi masyarakat terhadap aplikasi Shopee.\nMenyediakan pendekatan berbasis data untuk pengambilan keputusan dalam pengembangan\naplikasi dan strategi layanan.\nMenjadi referensi awal untuk penerapan klasifikasi sentimen dalam konteks aplikasi digital\nlainnya.\n7. Kesimpulan\nPenerapan metode Naïve Bayes dan K-Nearest Neighbor mampu memberikan hasil klasifikasi\nyang baik terhadap opini pengguna Shopee. Dari perbandingan yang dilakukan, Naïve Bayes\nmemiliki keunggulan dalam hal akurasi dan efisiensi proses klasifikasi. Penelitian ini\nmembuktikan bahwa teknik machine learning dapat digunakan untuk menganalisis opini publik\nterhadap aplikasi digital secara efektif dan bermanfaat bagi pengambilan keputusan bisnis.",
  "similar_tokens": [
    "forum",
    "klasifikasi",
    "temu",
    "online",
    "program",
    "implikasi",
    "siregar",
    "sentiment",
    "aspek",
    "media",
    "studi",
    "gambar",
    "masyarakat",
    "shopee",
    "indonesia",
    "simpul",
    "tinggi",
    "belanja",
    "guna",
    "kelas",
    "platform",
    "frekuensi",
    "jarak",
    "negatif",
    "layan",
    "tingkat",
    "asa",
    "folding",
    "judul",
    "kualitas",
    "tuju",
    "cosine",
    "rasio",
    "milik",
    "muhammad",
    "cenderung",
    "probabilitas",
    "efektif",
    "mining",
    "masuk",
    "tentu",
    "positif",
    "oleh",
    "metrik",
    "referensi",
    "populer",
    "pasar",
    "shopeepay",
    "teks",
    "ulas",
    "puas",
    "collection",
    "tenggara",
    "bayar",
    "universitas",
    "metodologi",
    "sentimen",
    "opini",
    "bukti",
    "persepsi",
    "e",
    "tulis",
    "muncul",
    "sifat",
    "play",
    "performa",
    "hasil",
    "promosi",
    "loyalitas",
    "terap",
    "rancang",
    "tahan",
    "unggul",
    "utara",
    "stabil",
    "efisiensi",
    "commerce",
    "aplikasi",
    "skripsi",
    "bas",
    "nim",
    "netral",
    "kirim",
    "dasar",
    "salah",
    "iqbal",
    "kembang",
    "neighbor",
    "khusus",
    "teliti",
    "rekomendasi",
    "aktivitas",
    "transaksi",
    "strategi",
    "ambil",
    "publik",
    "bisnis",
    "kategori",
    "latar",
    "konteks",
    "analis",
    "keluh",
    "putus",
    "ilmu",
    "manfaat",
    "nave",
    "sosial",
    "besar",
    "sumatera",
    "harga",
    "banding",
    "lengkap",
    "s",
    "dekat",
    "library",
    "usaha",
    "tokenisasi",
    "teknik",
    "similarity",
    "asia",
    "sukses",
    "sedia",
    "mayoritas",
    "baik",
    "ruang",
    "barang",
    "lingkup",
    "bahasa",
    "case",
    "sumber",
    "removal",
    "batas"
  ],
  "filename": "exum_171401017.pdf",
  "user_id": 17
}