{
  "original_text": "Judul: Analisis Perbandingan Kompresi Algoritma Lempel Ziv Storer Szymanski dan Algoritma Boldi Vigna\nζ3 Code terhadap File Teks\nPenulis: Jeremy Michael Sinaga – 171401087\nTahun: 2024\nProgram Studi: S-1 Ilmu Komputer, Universitas Sumatera Utara\nLatar Belakang:\nDi era digital, pengiriman data melalui internet sangat krusial, namun seringkali terkendala oleh\nkecepatan akses jaringan, terutama untuk file berukuran besar. Salah satu solusi untuk mengatasi\nmasalah ini adalah dengan menerapkan teknik kompresi data guna memperkecil ukuran file sebelum\ndikirimkan.\nTujuan:\nMenganalisis dan membandingkan performa dua algoritma kompresi data, yaitu Lempel Ziv Storer\nSzymanski (LZSS) dan Boldi Vigna ζ3 Code, dalam hal efisiensi waktu proses, rasio kompresi, dan\ndekompresi pada file teks.\nMetode:\nMelakukan uji coba kompresi terhadap berbagai file teks menggunakan dua algoritma berbeda.\nMengukur dan membandingkan compression ratio, waktu proses kompresi, serta waktu proses\ndekompresi.\nSistem dirancang dan diimplementasikan menggunakan pseudocode, flowchart, serta pengujian grafis\nuntuk menganalisis kinerja masing-masing algoritma.\nHasil:\nAlgoritma LZSS unggul dalam proses dekompresi dan efektif untuk data berpola berulang.\nAlgoritma Boldi Vigna lebih cepat dalam proses kompresi dan unggul untuk data dengan variasi byte\ntunggal.\nPemilihan algoritma tergantung pada karakteristik data yang ingin dikompresi.\nKesimpulan:\nKedua algoritma memiliki keunggulan masing-masing, dan efektivitas penggunaannya tergantung pada\nstruktur data yang dikompresi. LZSS cocok untuk data repetitif, sementara Boldi Vigna lebih baik untuk\ndata dengan banyak variasi karakter.\nKata Kunci: Kompresi Data, LZSS, Boldi Vigna, Algoritma, Dekompresi, File Teks\nSelanjutnya\nAku akan lanjutkan membuat EXUM untuk skripsi berikutnya, yaitu:\n171401088 – Agussalim Helmi: Analisis Perbandingan WP dan WSM untuk Bibit Mangrove\nTunggu sebentar ya.\nBerikut adalah executive summary (EXUM) untuk skripsi ketiga:\nExecutive Summary\nJudul: Analisis Perbandingan Weighted Product dan Weighted Sum Model untuk Penentuan Bibit\nMangrove Terbaik di Kabupaten Batu Bara\nPenulis: Agussalim Helmi – 171401088\nTahun: 2024\nProgram Studi: S-1 Ilmu Komputer, Universitas Sumatera Utara\nLatar Belakang:\nRestorasi dan peremajaan hutan mangrove memerlukan pemilihan bibit berkualitas tinggi yang tahan\nterhadap hama dan penyakit serta memiliki pertumbuhan optimal. Dalam proses pemilihannya,\ndiperlukan sistem pengambilan keputusan berbasis komputer untuk meningkatkan akurasi dan efisiensi.\nTujuan:\nMenganalisis dan membandingkan dua metode pengambilan keputusan multi-kriteria, yaitu Weighted\nProduct (WP) dan Weighted Sum Model (WSM), dalam menentukan bibit mangrove terbaik.\nMetode:\nMenggunakan parameter penilaian terhadap sampel bibit mangrove seperti pertumbuhan, ketahanan,\ndan kualitas media tanam.\nSistem dirancang menggunakan bahasa pemrograman PHP dan database MySQL.\nNilai akhir bibit dihitung berdasarkan metode WP (dengan Vektor S) dan WSM (dengan Vektor V),\nkemudian dibandingkan.\nPengujian dilakukan terhadap data bibit dari Kelompok Tani Mangrove Batu Bara.\nHasil:\nNilai perhitungan WP sebesar 0.0122512 dan WSM sebesar 5 pada bibit yang sama.\nKedua metode memberikan hasil konsisten dalam menentukan bibit terbaik, namun dengan perbedaan\npendekatan matematis.\nSistem dapat menampilkan peringkat dan hasil rekomendasi secara otomatis berdasarkan metode yang\ndipilih.\nKesimpulan:\nSistem pendukung keputusan yang dibangun berhasil membantu dalam menentukan bibit mangrove\nterbaik. Baik metode WP maupun WSM memiliki efektivitas yang tinggi dan dapat digunakan\nbergantung pada kebutuhan komputasi dan karakteristik data.\nKata Kunci: Mangrove, Sistem Pendukung Keputusan, Weighted Product, Weighted Sum Model, Multi\nCriteria Decision Making",
  "similar_tokens": [
    "vigna",
    "helm",
    "milik",
    "hasil",
    "tulis",
    "banding",
    "efektivitas",
    "analis",
    "bara",
    "uji",
    "lzss",
    "pilih",
    "rancang",
    "batu",
    "tentu",
    "kunci",
    "kompresi",
    "dasar",
    "dukung",
    "judul",
    "ilmu",
    "sum",
    "putus",
    "teks",
    "simpul",
    "lempel",
    "boldi",
    "dekompresi",
    "nilai",
    "baik",
    "latar",
    "weighted",
    "bibit",
    "agussalim",
    "file",
    "karakteristik",
    "exum",
    "code",
    "product",
    "tumbuh",
    "mangrove",
    "program",
    "wsm",
    "ambil",
    "executive",
    "efisiensi"
  ],
  "filename": "exum_171401087.pdf",
  "user_id": 17
}