{
  "original_text": "RINGKASAN JUDUL YANG DIAJUKAN\n*Semua kolom di bawah ini diisi oleh mahasiswa yang sudah mendapat judul\nJudul / Topik SISTEM REKOMENDASI JURUSAN KULIAH BERDASARKAN PERFORMA\nSkripsi AKADEMIK, MINAT BAKAT, DAN ASPEK PSIKOLOGI SISWA MENGGUNAKAN\nMETODE HYBRID RECOMMENDATION\nLatar Belakang Latar Belakang\ndan Penelitian\nTerdahulu Pendidikan tinggi merupakan tahapan penting dalam pengembangan karier dan potensi\nindividu. Pemilihan jurusan kuliah yang tepat menjadi salah satu faktor krusial yang dapat\nmenentukan keberhasilan akademik maupun profesional seseorang di masa depan. Namun,\nproses pemilihan jurusan seringkali dilakukan tanpa pertimbangan yang matang, baik oleh\nsiswa itu sendiri maupun oleh pihak yang terlibat dalam proses pembimbingan, seperti orang\ntua dan guru. Tidak jarang, keputusan pemilihan jurusan didasarkan semata-mata pada faktor\neksternal seperti tren pasar kerja, pengaruh lingkungan sosial, atau keinginan keluarga, tanpa\nmempertimbangkan aspek personal siswa secara menyeluruh.\nStudi menunjukkan sekitar 87% mahasiswa di Indonesia merasa tidak cocok dengan jurusan\nyang mereka pilih. Banyak mahasiswa memilih jurusan tanpa mempertimbangkan minat dan\nbakat mereka (Zulfikar, 2021). Fenomena dalam kesalahan pemilihan jurusan kuliah dapat\nmemunculkan dampak negatif yang bisa menghambat prestasi akademik serta kesejahteraan\npsikologis mahasiswa.\nPermasalahan tersebut berdampak pada banyaknya kasus ketidaksesuaian antara jurusan yang\ndipilih dengan kemampuan, minat, dan karakter individu, yang pada akhirnya dapat\nmenyebabkan rendahnya motivasi belajar, penurunan performa akademik, hingga peningkatan\nangka dropout di perguruan tinggi. Oleh karena itu, diperlukan suatu pendekatan yang\nkomprehensif dan objektif dalam membantu siswa menentukan pilihan jurusan yang sesuai\ndengan potensi dan karakteristik pribadinya.\nKesalahan memilih jurusan kuliah tidak hanya mengakibatkan ketidakcocokan antara\npemikiran mahasiswa dan mata kuliah yang dipelajari, namun juga berimplikasi pada motivasi\nbelajar, kepuasan hidup, kemampuan untuk mengatasi stres, dan keseluruhan pengalaman\ndalam perkuliahan mereka. Penelitian yang dilakukan oleh (Arifin et al., 2020) menunjukkan\nbahwa hampir 50% mahasiswa Teknik Informatika merasa tidak cocok dengan jurusan mereka\nyang menyebabkan sebanyak 62.5% mahasiswa merasa putus asa dengan proses belajar dalam\nperkuliahannya.\nDi sisi lain, perkembangan teknologi informasi telah mendorong pemanfaatan sistem\nrekomendasi (recommender system) dalam mendukung proses pengambilan keputusan di\nberbagai bidang, termasuk bidang pendidikan. Sistem rekomendasi dapat memberikan saran\npersonal berdasarkan data dan pola preferensi. Terdapat dua pendekatan umum dalam sistem\nrekomendasi, yaitu content-based filtering, yang menganalisis karakteristik pengguna, dan\ncollaborative filtering, yang memanfaatkan informasi dari pengguna lain dengan karakteristik\nserupa (Adomavicius & Tuzhilin, 2005). Namun, masing-masing metode memiliki\nketerbatasan tersendiri. Content-based filtering sering mengalami masalah overspecialization,\nsementara collaborative filtering rentan terhadap cold-start problem.\nUntuk mengatasi keterbatasan tersebut, pendekatan Hybrid Recommendation System mulai\nbanyak dikembangkan. Metode ini menggabungkan kelebihan dari content-based dan\ncollaborative filtering, sehingga menghasilkan rekomendasi yang lebih akurat dan relevan.\nMenurut penelitian oleh Ghauth & Abdullah (2010), metode hybrid mampu meningkatkan\nperforma sistem rekomendasi dalam konteks pendidikan dengan mempertimbangkan baik\nkarakteristik pengguna maupun pola dari pengguna lain. Studi lain oleh Setiawan et al. (2021)\njuga menunjukkan bahwa sistem hybrid mampu memberikan rekomendasi jurusan kuliah yang\nlebih sesuai dengan profil siswa jika dibandingkan dengan pendekatan tunggal.\nStudi oleh Romero et al. (2024) membuktikan bahwa sistem hybrid yang menggabungkan CF,\nCBF, dan genetic algorithm mampu meningkatkan akurasi rekomendasi\nhingga 31.2% dibanding metode tunggal. Ini menunjukkan potensi sistem rekomendasi dalam\nmembantu siswa memilih jurusan yang sesuai berdasarkan performa akademik dan minat\nmereka.\nBerdasarkan pemaparan tersebut, dapat disimpulkan bahwa pengembangan sistem\nrekomendasi jurusan kuliah berbasis Hybrid Recommendation, yang mempertimbangkan\nperforma akademik, minat dan bakat, serta psikologi siswa, merupakan pendekatan yang\nrelevan dan potensial untuk membantu siswa dalam mengambil keputusan yang tepat. Sistem\nini tidak hanya dapat meningkatkan kecocokan antara individu dan jurusan yang dipilih, tetapi\njuga berkontribusi dalam peningkatan kualitas pendidikan dan pengembangan sumber daya\nmanusia yang lebih optimal.\nPenelitian Terdahulu\nNo. Penulis Judul Tahun\nSistem Rekomendasi Program Studi untuk\nMuthi Ishlah\nSiswa SMA Sederajat Menggunakan\nRizky, Ibnu\n1. Metode Hybrid Recommendation dengan 2020\nAsror, Yusza\nContent Based Filtering dan Collaborative\nReditya Murti\nFiltering\nFemas Aji\nSaputra,\nAnalisis Dampak Kesalahan Pemilihan\nAdityawarman\n2. Jurusan terhadap Prestasi Akademik dan 2024\nAdityawarman,\nKesejahteraan Psikologis Mahasiswa\nSalwa Rahman\nNursyabani\nNuru Aini,\nImplementasi Metode Hybrid\nMuchamad Arif,\nRecommendation untuk Sistem\n3. Zulfah Binti 2024\nRekomendasi Mitra MSIB di Prodi\nToyibah, Irka Tri\nPendidikan Informatika\nAgustin\nIndra Jayanti\nDamanik, Yesni Penerapan Tes Psikotest Untuk Mengetahui\n4. Riana Damanik, Minat dan Bakat pada Siswa SMA Negeri 1 2024\nRisjunardi Pematang Bandar\nDamanik\nSistem Rekomendasi Program Studi\nJamilatul Aisyiah, Menggunakan Metode Hybrid\n5. 2023\nLaili Cahyani Recommendation (Studi Kasus: MAN\nSumenep)\nRumusan Masalah Pemilihan jurusan kuliah merupakan keputusan krusial yang dipengaruhi oleh beragam faktor,\ntermasuk performa akademik siswa, minat dan bakat, serta aspek psikologis. Ketidaksesuaian\ndalam pemilihan jurusan dapat mengakibatkan penurunan prestasi akademik, peningkatan\nrisiko drop out, dan berdampak negatif pada perkembangan karier siswa. Meskipun sistem\nrekomendasi telah banyak dikembangkan, akurasi dan relevansi rekomendasi masih menjadi\ntantangan utama, terutama karena kompleksitas faktor-faktor yang perlu dipertimbangkan.\nPenelitian ini bertujuan untuk mengatasi tantangan tersebut dengan mengembangkan sistem\nrekomendasi jurusan kuliah yang lebih komprehensif. Sistem ini akan didasarkan pada metode\nhybrid recommendation yang mengintegrasikan data performa akademik, hasil pengukuran\nminat dan bakat, serta profil psikologis siswa. Dengan mempertimbangkan ketiga aspek ini\nsecara bersamaan, diharapkan sistem mampu memberikan rekomendasi yang lebih personal\ndan sesuai dengan potensi unik setiap siswa. Melalui pengembangan sistem rekomendasi yang\nlebih akurat dan relevan, penelitian ini diharapkan dapat memberikan kontribusi signifikan\ndalam membantu siswa membuat keputusan yang lebih tepat terkait pilihan jurusan kuliah.\nPada akhirnya, hal ini diharapkan dapat meningkatkan kualitas pendidikan, mengurangi tingkat\nketidaksesuaian jurusan, dan mempersiapkan sumber daya manusia yang lebih kompeten dan\nsesuai dengan bidang yang diminati.\nMetodologi\nReferensi Adomavicius, G., & Tuzhilin, A. (2005). Toward the next generation of recommender\nsystems: A survey of the state-of-the-art and possible extensions. IEEE\nTransactions on Knowledge and Data Engineering, 17(6), 734-749.\nArifin, Z., et al. (2020). Pengaruh Ketidaksesuaian Jurusan Kuliah terhadap Motivasi\nBelajar Mahasiswa Teknik Informatika. Jurnal Pendidikan dan Teknologi\nInformasi, 12(1), 45-52.\nGhauth, K. I., & Abdullah, N. A. (2010). Learning materials recommendation using\ngood learners’ ratings and content-based filtering. Educational Technology\nResearch and Development, 58(6), 711-727.\nRomero, J., et al. (2024). Improving Hybrid Recommendation Systems with Genetic\nAlgorithms: A Case Study in Educational Contexts. Journal of Artificial\nIntelligence in Education, 34(2), 123-145.\nSetiawan, H., et al. (2021). Implementasi Hybrid Recommendation System untuk\nPemilihan Jurusan Kuliah Berdasarkan Profil Siswa. Jurnal Teknologi Informasi\ndan Komputer, 15(3), 89-97.",
  "similar_tokens": [
    "hybrid",
    "sesuai",
    "informasi",
    "akademik",
    "siswa",
    "potensi",
    "pilih",
    "dasar",
    "teliti",
    "rekomendasi",
    "karakteristik",
    "bakat",
    "kuliah",
    "studi",
    "harap",
    "guna",
    "atas",
    "minat",
    "recommendation",
    "collaborative",
    "putus",
    "tingkat",
    "performa",
    "faktor",
    "jurus",
    "aspek",
    "ketidaksesuaian",
    "filtering",
    "ajar",
    "and",
    "bantu",
    "salah",
    "didik",
    "mahasiswa",
    "timbang",
    "damanik",
    "motivasi",
    "personal",
    "individu",
    "dekat",
    "psikologis",
    "judul",
    "bidang",
    "kembang",
    "informatika"
  ],
  "filename": "Exum_211402143.pdf",
  "user_id": 22
}