{
  "original_text": "Executive Summary\nJudul: Penerapan Metode Forward Chaining pada Sistem Penentuan Banjir Berbasis Web dengan\nMenggunakan Model View Controller\nPenulis: T. Arifah Inayyah – 171401085\nTahun: 2024\nProgram Studi: S-1 Ilmu Komputer, Universitas Sumatera Utara\nLatar Belakang:\nBanjir merupakan bencana alam yang sering terjadi dan membawa kerugian signifikan terhadap\nmanusia dan infrastruktur. Diperlukan sistem cerdas berbasis web yang dapat mengidentifikasi\njenis banjir secara cepat dan akurat guna meminimalisasi dampaknya.\nTujuan:\nMembangun sistem pakar berbasis web untuk menentukan jenis banjir (banjir bandang, banjir\nrob, banjir genangan) dengan metode inferensi Forward Chaining dan arsitektur Model-View-\nController (MVC).\nMetode:\nMenggunakan pendekatan Forward Chaining untuk penarikan kesimpulan berbasis aturan.\nData lingkungan seperti curah hujan, tinggi muka air, kecepatan aliran, dan kondisi tanah\ndikumpulkan sebagai input.\nSistem dibangun dengan arsitektur MVC agar pemisahan logika aplikasi dan antarmuka\npengguna lebih terstruktur.\nHasil:\nSistem dapat menentukan jenis banjir secara otomatis berdasarkan fakta dan aturan yang sudah\nditentukan. Validasi menunjukkan hasil akurasi 100% saat dibandingkan dengan perhitungan\nmanual menggunakan Excel.\nKesimpulan:\nPenerapan metode Forward Chaining dalam sistem penentuan jenis banjir berbasis web efektif\ndalam memberikan hasil yang akurat dan cepat. Arsitektur MVC mendukung pengembangan\nsistem yang terstruktur dan mudah dipelihara.\nKata Kunci: Banjir, Sistem Pakar, Forward Chaining, MVC, Web",
  "similar_tokens": [
    "struktur",
    "kondisi",
    "banding",
    "infrastruktur",
    "tentu",
    "efektif",
    "pakar",
    "bas",
    "rugi",
    "hasil",
    "dasar",
    "judul",
    "arifah",
    "air",
    "ilmu",
    "curah",
    "pelihara",
    "cerdas",
    "mvc",
    "akurat",
    "simpul",
    "atur",
    "arsitektur",
    "controller",
    "jenis",
    "cepat",
    "kumpul",
    "genang",
    "kunci",
    "terap",
    "bandang",
    "bencana",
    "aplikasi",
    "antarmuka",
    "bangun",
    "fakta",
    "excel",
    "hujan",
    "alir",
    "chaining",
    "inferensi",
    "forward",
    "dampak",
    "executive",
    "banjir",
    "alam"
  ],
  "filename": "exum_171401085.pdf",
  "user_id": 17
}