{
  "original_text": "Judul Skripsi: Klasifikasi Opini Mas yarakat terhadap Layanan Bank Syariah Indonesia (BSI) \nMenggunakan Support Vector Machine dan Naïve Bayes  \nPenulis: Muhammad Daffa Putra Ramadhan (NIM 171401045)  \nProgram Studi: S1 Ilmu Komputer, Universitas Sumatera Utara  \nTahun: 2024  \n \n1. Latar Belakang (Leng kap) \nBank Syariah Indonesia (BSI) merupakan hasil merger dari tiga bank syariah milik BUMN, yaitu \nBRI Syariah, BNI Syariah, dan Bank Syariah Mandiri. Sejak resmi beroperasi tahun 2021, BSI \nmenjadi salah satu lembaga keuangan syariah terbesar di Indonesia. Dalam era digital seperti \nsekarang, opini masyarakat terhadap layanan perbankan dapat dengan mudah ditemukan melalui \nmedia sosial dan ulasan aplikasi, seperti Google Play Store.  \n \nMengetahui persepsi masyarakat sangat penting bagi BSI sebagai bank digital, terutama untuk \nmemperbaiki kualitas layanan dan memahami kepuasan nasabah. Namun, opini publik yang \nmasif, tidak terstruktur, dan dalam bentuk teks bebas menjadikan analisis manual menjadi tidak \nefisien.  \n \nOleh karena itu, diperlukan pendekatan otomatis ber basis Text Mining dan Machine Learning \nuntuk melakukan klasifikasi opini secara sistematis. Dua algoritma klasifikasi teks yang populer, \nyaitu Support Vector Machine (SVM) dan Naïve Bayes (NB), digunakan dalam penelitian ini \nuntuk mengklasifikasikan opini ke dalam tiga kategori: positif, negatif, dan netral.  \n \n2. Tujuan Penelitian  \nMembangun sistem klasifikasi opini masyarakat terhadap layanan BSI secara otomatis.  \n \nMembandingkan performa algoritma SVM dan Naïve Bayes dalam mengklasifikasikan sentimen \nteks. \n \nMenyediakan hasil klasifikasi sebagai masukan evaluasi layanan perbankan digital BSI.  \n \n3. Ruang Lingkup dan Batasan  Data opini diambil dari review pengguna aplikasi BSI Mobile di Google Play Store.  \n \nHanya opini dalam Bahasa Indonesia yang dianalisis.  \n \nSentimen dikategorikan secara sederhana ke dalam tiga kelas: positif, negatif, dan netral.  \n \n4. Metodologi  \nPengumpulan Data:  \n \nScraping review pengguna aplikasi BSI Mobile dari Google Play Store.  \n \nPreprocessing:  \n \nCase folding, tokenisasi, stopword removal, s temming (menggunakan Sastrawi).  \n \nPembobotan Fitur:  \n \nMenggunakan TF -IDF untuk mengubah teks menjadi vektor numerik.  \n \nModel Klasifikasi:  \n \nNaïve Bayes: Menggunakan pendekatan probabilistik.  \n \nSVM: Menggunakan hyperplane untuk memisahkan kelas sentimen.  \n \nEvalua si Model:  \n \nConfusion Matrix   \nMetrik evaluasi: akurasi, precision, recall, dan F1 -score.  \n \n5. Hasil Penelitian  \nNaïve Bayes dan SVM sama -sama mampu mengklasifikasikan opini masyarakat dengan tingkat \nakurasi yang cukup baik.  \n \nSVM memberikan akurasi yang lebih tinggi dibandingkan Naïve Bayes pada dataset yang \ndigunakan.  \n \nMayoritas opini pengguna terhadap layanan BSI bersifat positif, namun terdapat sejumlah ulasan \nnegatif terkait performa aplikasi dan layanan digital banking.  \n \n6. Manfaat dan Implikasi  \nMemberikan insight penting kepada pihak BSI tentang persepsi masyarakat terhadap layanannya.  \n \nMenjadi dasar pengambilan keputusan dalam peningkatan kualitas aplikasi dan layanan.  \n \nMenunjukkan potensi penerapan machine learning dalam  monitoring brand sentiment sektor \nkeuangan syariah.  \n \n7. Kesimpulan  \nPenggunaan algoritma SVM dan Naïve Bayes untuk klasifikasi opini masyarakat terhadap BSI \nterbukti efektif. SVM menunjukkan performa klasifikasi yang lebih unggul, khususnya dalam \nmenangani  data opini yang kompleks. Sistem klasifikasi ini dapat dikembangkan lebih lanjut \nuntuk analisis real -time dan integrasi dengan sistem pengambilan keputusan perusahaan.  ",
  "similar_tokens": [
    "j",
    "u",
    "d",
    "u",
    "l",
    " ",
    "m",
    "e",
    "d",
    "i",
    "a",
    " ",
    "b",
    "a",
    "h",
    "a",
    "s",
    "a",
    " ",
    "t",
    "e",
    "l",
    "i",
    "t",
    "i",
    " ",
    "d",
    "a",
    "s",
    "a",
    "r",
    " ",
    "b",
    "a",
    "i",
    "k",
    " ",
    "i",
    "n",
    "d",
    "o",
    "n",
    "e",
    "s",
    "i",
    "a",
    " ",
    "v",
    "e",
    "k",
    "t",
    "o",
    "r",
    " ",
    "s",
    "o",
    "s",
    "i",
    "a",
    "l",
    " ",
    "h",
    "a",
    "s",
    "i",
    "l"
  ],
  "output_path": "uploads\\results\\17\\Exum_201402068_exum_combined.pdf",
  "user_id": 17
}