{
  "original_text": "Judul Skripsi: Implementasi Algoritma Ant Colony Optimization dalam Menentukan Rute \nTerbaik Pengiriman Barang pada Ekspedisi J&T Express Medan  \nPenulis: Rendi  Saputra (NIM 171401049)  \nProgram Studi: S1 Ilmu Komputer, Universitas Sumatera Utara  \nTahun: 2024  \n \n1. Latar Belakang (Lengkap)  \nDalam era e -commerce dan layanan pengiriman yang semakin berkembang, efektivitas dan \nefisiensi pengiriman barang menjadi aspek kru sial bagi perusahaan logistik. Salah satu \npermasalahan utama dalam operasional pengiriman adalah penentuan rute terbaik untuk armada \nkurir dalam mengantarkan paket ke berbagai lokasi. Penentuan rute yang tidak optimal dapat \nmenyebabkan waktu pengiriman yan g lebih lama, peningkatan konsumsi bahan bakar, serta \nbiaya operasional yang membengkak.  \n \nJ&T Express sebagai salah satu perusahaan ekspedisi besar di Indonesia, termasuk di Kota \nMedan, menghadapi tantangan serupa. Volume pengiriman yang tinggi dan cakupan  wilayah \nyang luas mengharuskan sistem penjadwalan dan rute pengiriman yang cerdas dan adaptif. Oleh \nkarena itu, dibutuhkan solusi berbasis komputasi untuk menyelesaikan masalah ini secara efisien.  \n \nAnt Colony Optimization (ACO) adalah algoritma optimasi b erbasis perilaku semut dalam \nmencari jalur terpendek menuju sumber makanan. ACO sangat cocok diterapkan pada \npermasalahan Travelling Salesman Problem (TSP), yaitu penentuan rute optimal untuk \nmengunjungi sejumlah titik tanpa pengulangan dan kembali ke titi k awal dengan jarak minimum.  \n \nSkripsi ini bertujuan untuk mengimplementasikan algoritma ACO guna membantu J&T Express \nMedan dalam menentukan rute pengiriman barang yang optimal, dengan harapan dapat \nmeminimalkan total jarak tempuh dan waktu pengantaran.  \n \n2. Tujuan Penelitian  \nMengimplementasikan algoritma ACO untuk menentukan rute pengiriman barang terbaik.  \n \nMembangun aplikasi berbasis desktop yang mampu menghitung dan menampilkan rute optimal.  \n Mengurangi total jarak dan waktu tempuh kurir dalam proses dist ribusi barang.  \n \n3. Ruang Lingkup dan Batasan  \nStudi kasus hanya difokuskan pada rute pengiriman dari satu kantor J&T di Kota Medan.  \n \nTitik pengiriman dibatasi pada sejumlah alamat yang telah ditentukan.  \n \nTidak memperhitungkan kondisi lalu lintas atau waktu layanan di lokasi pelanggan.  \n \n4. Metodologi  \nPengumpulan Data:  \n \nLokasi titik pengantaran (koordinat) diinput secara manual.  \n \nJarak antar lokasi dihitung menggunakan metode Euclidean Distance.  \n \nAlgoritma A nt Colony Optimization (ACO):  \n \nParameter utama: jumlah semut, iterasi, konstanta penguapan feromon (ρ), dan bobot pengaruh \njarak dan feromon (α, β).  \n \nSemut akan menjelajahi rute dan memperbarui jejak feromon berdasarkan kualitas jalur.  \n \nPembangunan Aplikas i: \n \nMenggunakan bahasa pemrograman Python atau Java.  \n \nTampilan visual graf dan hasil rute terpendek ditampilkan dalam antarmuka pengguna.  \n Evaluasi:  \n \nMengukur total jarak yang dihasilkan oleh rute ACO dan membandingkan dengan rute \nacak/manual.  \n \n5. Hasil Penelitian  \nSistem berhasil menghasilkan rute dengan jarak lebih pendek dibandingkan metode rute tetap \natau acak.  \n \nACO secara konsisten menemukan solusi rute optimal dalam waktu komputasi yang singkat.  \n \nPerubahan parameter (misalnya jumlah semut da n iterasi) memengaruhi hasil kualitas rute, di \nmana peningkatan iterasi dapat menghasilkan jalur yang lebih baik.  \n \nPenggunaan ACO terbukti efektif untuk menyelesaikan masalah rute pengiriman barang dalam \nskala menengah.  \n \n6. Manfaat dan Implikasi  \nMengurangi  jarak tempuh kurir, menurunkan biaya operasional logistik.  \n \nDapat digunakan sebagai dasar sistem penjadwalan rute otomatis untuk perusahaan ekspedisi.  \n \nMembantu pengambilan keputusan berbasis data dalam logistik perkotaan (urban logistics).  \n \n7. Kesimpulan  \nAnt Colony Optimization merupakan solusi yang tepat untuk menyelesaikan permasalahan rute \npengiriman pada layanan ekspedisi seperti J&T Express. Dengan pendekatan berbasis \nkecerdasan kolektif, algoritma ini mampu menemukan rute yang lebih efisien dan hema t sumber \ndaya. Pengembangan lebih lanjut dapat dilakukan dengan menambahkan parameter waktu, \nkondisi lalu lintas, atau integrasi dengan sistem navigasi digital.  ",
  "similar_tokens": [
    "i",
    "l",
    "m",
    "u",
    " ",
    "h",
    "a",
    "s",
    "i",
    "l",
    " ",
    "p",
    "u",
    "t",
    "u",
    "s",
    " ",
    "s",
    "i",
    "m",
    "p",
    "u",
    "l",
    " ",
    "t",
    "e",
    "n",
    "t",
    "u",
    " ",
    "p",
    "r",
    "o",
    "g",
    "r",
    "a",
    "m",
    " ",
    "t",
    "u",
    "l",
    "i",
    "s",
    " ",
    "b",
    "a",
    "n",
    "d",
    "i",
    "n",
    "g",
    " ",
    "e",
    "f",
    "e",
    "k",
    "t",
    "i",
    "v",
    "i",
    "t",
    "a",
    "s",
    " ",
    "b",
    "a",
    "i",
    "k",
    " ",
    "l",
    "a",
    "t",
    "a",
    "r",
    " ",
    "d",
    "a",
    "s",
    "a",
    "r",
    " ",
    "j",
    "u",
    "d",
    "u",
    "l",
    " ",
    "a",
    "m",
    "b",
    "i",
    "l",
    " ",
    "e",
    "f",
    "i",
    "s",
    "i",
    "e",
    "n",
    "s",
    "i"
  ],
  "output_path": "uploads\\results\\17\\exum_171401087_exum_combined.pdf",
  "user_id": 17
}