{
  "original_text": "FORM PENGAJUAN JUDUL\nNama : Citra Wahyuni Amri\nNIM : 201402021\nJudul diajukan oleh* : Dosen\n✓ Mahasiswa\nBidang Ilmu (tulis dua bidang) : M a c hi n e L e a =rn ing\nUji Kelayakan Judul** : Diterima Ditolak\nHasil Uji Kelayakan Judul :\nCalon Dosen Pembimbing I : Dedy Arisandi, S.T., M.Kom\nParaf Calon Dosen Pembimbing I\n(Jika judul dari dosen maka dosen tersebut berhak menjadi pembimbing I)\nCalon Dosen Pembimbing II : Ade Sarah Huzaifah S.Kom., M.Kom\nMedan, ......................................\nKa. Laboratorium Penelitian,\n* Centang salah satu atau keduanya (Fanindia Purnamasari, S.TI., M.IT )\n** Pilih salah satu NIP. 198908172019032023\nRINGKASAN JUDUL YANG DIAJUKAN\nJudul / Topik CHATBOT INTERAKTIF LAYANAN INFORMASI PADA KLINIK HEWAN\nSkripsi MENGGUNAKAN ALGORITMA LONG SHORT-TERM MEMORY (LSTM) DAN\nNAMED ENTITY RECOGNITION\nLatar Belakang Latar Belakang\ndan Penelitian Seiring dengan perkembangan teknologi, chatbot telah menjadi salah satu solusi yang\nTerdahulu menjanjikan untuk menyediakan layanan informasi yang lebih interaktif dan mudah diakses.\nChatbot adalah program komputer yang menggunakan Natural Language Processing (NLP)\nsebagai bagian dari kecerdasan buatan untuk menanggapi pesan pengguna melalui teks atau\nsuara. NLP adalah cabang kecerdasan buatan yang memungkinkan sistem untuk memahami teks\natau perkataan seperti manusia. Aplikasi NLP mencakup perangkat pintar yang dapat\nmendengar dan merespons perintah manusia, mesin pencarian yang memberikan informasi, dan\nchatbot yang merespons pengguna dengan cepat dan baik (Adamopoulou & Moussiades, 2020).\nDalam pemeliharaan hewan, terdapat beberapa hal yang harus diperhatikan salah satunya adalah\nkesehatan hewan tersebut. Tempat yang mendukung kebutuhan akan perawatan ini adalah klinik\nhewan (Fitriana & Kristania, 2021). Klinik hewan tidak hanya menjadi tempat untuk merawat\nhewan yang sakit, tetapi juga menjadi sumber informasi dan edukasi tentang perawatan yang\ntepat bagi hewan peliharaan. Dengan berkonsultasi ke klinik hewan, pemilik hewan dapat\nmemperoleh panduan tentang nutrisi, vaksinasi, pencegahan penyakit, dan tindakan medis yang\ndiperlukan untuk menjaga kesehatan hewan peliharaan mereka. Namun, berdasarkan\nwawancara terhadap Kepala Bidang Pelayanan UPT Klinik Hewan yang dikelola oleh Dinas\nKetahanan Pangan dan Peternakan Provinsi Sumatera Utara, pelayanan informasi yang terbatas\nkepada pemilik hewan di klinik menjadi masalah yang serius.\nKeterbatasan informasi bisa mencakup kurangnya edukasi kepada pemilik hewan tentang\nperawatan yang tepat, penanganan setelah tindakan klinis, atau bahkan sulitnya untuk\nmenghubungi klinik untuk konsultasi lebih lanjut. Jumlah pertanyaan yang tinggi, keterbatasan\nsumber daya manusia, dan waktu layanan yang terbatas menjadi tantangan bagi klinik untuk\ndapat menyediakan informasi yang real-time kepada pemilik hewan. Hal ini dapat\nmengakibatkan ketidakpastian bagi pemilik hewan tentang kondisi kesehatan hewan peliharaan\nmereka, serta menghambat upaya mereka untuk memberikan perawatan yang optimal. Selain\nitu, keterbatasan ini juga dapat mempersulit proses pengambilan keputusan yang penting terkait\ndengan perawatan hewan, yang pada akhirnya dapat memengaruhi kesejahteraan hewan\ntersebut. Kurangnya aksesibilitas informasi ini juga membuat kualitas pelayanan klinik dinilai\nkurang baik dalam menyediakan kebutuhan para pemilik hewan.\nUntuk mengatasi masalah tersebut, diperlukan suatu media interaktif dan informatif pada klinik\nhewan dengan menggunakan chatbot. Berbagai penelitian telah dilakukan untuk\nmengimplementasikan chatbot dalam pelayanan informasi, diantaranya adalah penelitian\nberjudul “Web-based chatbot for Frequently Asked Queries (FAQ) in Hospitals” (Mittal et al,\n2021). Penelitian ini mengembangkan chatbot berbasis web untuk merespon pertanyaan terkait\nketersediaan dokter, waktu operasi, dan informasi darurat di rumah sakit. Chatbot tersebut\nmampu menjadi media komunikasi yang cepat untuk pasien dan pegawai rumah sakit serta\nmembantu mengurangi keramaian antrian di rumah sakit. Penelitian lainnya dengan judul\n“Implementasi Long Short-Term Memory pada Chatbot Informasi Akademik Teknik\nInformatika Unila” (Wintoro et al, 2022) bertujuan untuk mengimplementasikan algoritma Long\nShort-Term Memory (LSTM) dalam pembuatan chatbot informasi akademik. Long Short-Term\nMemory (LSTM) adalah model yang sangat cocok untuk memproses urutan kata dalam kalimat\ndan sering digunakan untuk tugas-tugas seperti kategorisasi teks dan penerjemahan mesin.\nLSTM merupakan salah satu jenis dari jaringan saraf tiruan berulang Recurrent Neural Network\n(RNN) yang dilengkapi dengan gerbang untuk mengatasi masalah gradien yang biasa terjadi\npada RNN konvensional. Dengan menggunakan informasi dari data historis dan saat ini secara\nbersamaan, LSTM dapat membuat prediksi dengan lebih akurat dan efisien. Dari 100 data uji\nyang diberikan, chatbot pada penelitian ini menghasilkan akurasi sebesar 99%.\nPenelitian oleh Fajari dan Baizal (2022) yang berjudul “Chatbot-Based Culinary Tourism\nRecommender System Using Named Entity Recognition” melihat bahwa cukup banyak\nwisatawan kuliner di kota Bandung kesulitan untuk menentukan wisata kuliner, sehingga\ndibutuhkan sistem rekomendasi berbasis chatbot. Penelitian ini dibangun dengan menggunakan\nNamed Entity Recognition (NER) yang menghasilkan skor usability testing pada aspek\nrekomendasi, yaitu 85.7%. NER adalah sebuah teknik dalam Natural Language Processing\n(NLP) yang dipakai untuk mengekstrak entitas seperti nama, lokasi, tindakan, dan lain-lain.\nPeran NER sangat penting dalam menangani berbagai masalah seperti ekstraksi informasi dan\npengembangan sistem penjawab pertanyaan. Dalam penelitian ini, NER dimanfaatkan untuk\nmengekstrak entitas dari input pengguna, seperti nama pengguna dan nama makanan dalam\npercakapan.\nDengan latar belakang tersebut, pada penelitian ini metode LSTM dan NER digabungkan untuk\nmendapatkan hasil yang baik dalam pengembangan chatbot. Dataset yang digunakan\nmerupakan kumpulan data dari Klinik Hewan Dinas Ketahanan Pangan dan Peternakan Provinsi\nSumatera Utara yang meliputi informasi umum tentang klinik, prosedur perawatan, dokter yang\nbertugas, fasilitas dan sumber daya pendukung, serta penanganan setelah tindakan klinis.\nPenelitian ini memiliki relevansi khusus karena bertujuan untuk mengatasi hambatan yang\ndihadapi pemilik hewan peliharaan dan staf klinik hewan.\nPenelitian Terdahulu\nNo. Penulis Judul Tahun Keterangan\nPenelitian ini mengembangkan\nWeb-based chatbot berbasis web untuk\nchatbot for merespon pertanyaan terkait\n1. Mittal et al Frequently Asked 2021 ketersediaan dokter, waktu operasi,\nQueries (FAQ) in dan informasi darurat di rumah sakit.\nHospitals Chatbot tersebut mampu menjadi\nmedia komunikasi yang cepat untuk\npasien dan pegawai rumah sakit\nserta membantu mengurangi\nkeramaian antrian di rumah sakit.\nPenelitian ini mengimplementasikan\nImplementasi sistem Chatbot menggunakan\nChatbot pemrosesan bahasa alami (NLP)\nKesehatan Kucing melalui kerangka Dialogflow untuk\nMelalui memberikan saran tentang perawatan\nHaryanto dan Dialogflow dan dasar kucing. Hasil penelitian ini\n2. 2024\nSaefurrahman Telegram untuk menunjukkan bahwa penerapan\nPemberian Chatbot melalui Dialogflow\nInformasi memiliki potensi besar dalam\nPenyakit dan membantu pemilik kucing dalam\nPerawatan merawat dan menangani penyakit\npada kucing.\nPenelitian ini membuat chatbot yang\nmenggunakan data dari Cornell\nIntelligent\nMovie Dialog Corpus yang berisi\nChatbot Adapted\nbanyak koleksi percakapan fiksi\nfrom Question\nkaya metadata yang diambil dari\n3. Anki et al and Answer 2021\nnaskah film. Berdasarkan penerapan\nSystem Using\nmodel Long Short-Term Memory\nRNN-LSTM\n(LSTM) ke dalam chatbot\nModel\ndidapatkan nilai akurasi rata-rata\n0.994869.\nPenelitian ini bertujuan untuk\nImplementasi mengimplementasikan algoritma\nLong Short-Term Long Short-Term Memory (LSTM)\nMemory pada dalam pembuatan chatbot informasi\n4. Wintoro et al 2022\nChatbot Informasi akademik. Dari 100 data uji yang\nAkademik Teknik diberikan, chatbot pada penelitian\nInformatika Unila ini menghasilkan akurasi sebesar\n99%.\nPenelitian ini bertujuan untuk\nPerformance mengevaluasi kinerja chatbot\nAnalysis and berbasis Long Short-Term Memory\nDevelopment of (LSTM) dalam menjawab\nQnA Chatbot pertanyaan tentang istilah gaul\n5. Khatib et al 2023\nModel Using bahasa Indonesia. Hasil dari\nLSTM in penelitian ini model chatbot LSTM\nAnswering dapat memberikan jawaban yang\nQuestions baik dengan akurasi dan presisi yang\ntinggi.\nChatbot-Based Penelitian ini mengangkat masalah\nCulinary Tourism mengenai banyaknya wisatawan\nRecommender kuliner di kota Bandung kesulitan\nSystem Using untuk menentukan wisata kuliner,\nNamed Entity sehingga dibutuhkan sistem\nFajari dan Recognition rekomendasi berbasis chatbot.\n6. 2022\nBaizal Penelitian ini dibangun dengan\nmenggunakan Named Entity\nRecognition (NER) yang\nmenghasilkan skor usability testing\npada aspek rekomendasi sebesar\n85.7%.\nRumusan Klinik hewan menjadi tempat dengan fasilitas yang mendukung dalam perawatan kesehatan\nMasalah hewan peliharaan. Namun, pelayanan informasi yang terbatas di klinik hewan dapat menjadi\nmasalah serius bagi para pemilik hewan peliharaan. Hal ini dapat mengakibatkan ketidakpastian\nbagi para pemilik hewan tentang kondisi kesehatan hewan peliharaan mereka, serta\nmenghambat upaya mereka untuk memberikan perawatan yang optimal. Selain itu, hal ini juga\nmembuat kualitas pelayanan pada klinik hewan dinilai rendah. Media yang biasanya digunakan\nuntuk pelayanan informasi di klinik hewan adalah chat serta telepon pribadi dengan admin dan\ndokter. Namun, dengan jumlah pertanyaan yang tinggi, keterbatasan sumber daya manusia, dan\nwaktu untuk menjawab yang terbatas membuat banyaknya pertanyaan yang tidak direspon. Oleh\nsebab itu, perlu dikembangkan suatu media interaktif dan dapat diakses kapanpun untuk\nmenyediakan layanan informasi pada klinik hewan.\nMetodologi\nTahapan Penelitian :\n1. Collecting Data\nDataset pada penelitian ini dikumpulkan melalui wawancara dengan staf pelayanan\nklinik hewan dan dokter yang bertugas. Dataset berupa pertanyaan dan jawaban yang\nsering ditanyakan calon pasien maupun pasien yang berkaitan dengan informasi\nprosedural pada klinik hewan, kesehatan dan perawatan hewan peliharaan.\n2. Preprocessing\nPada tahap preprocessing, input yang diberikan oleh pengguna akan diolah dengan\nmelakukan 4 tahapan, yaitu tokenization, di mana teks dibagi menjadi token atau kata-\nkata individual, case folding untuk mengkonversi semua huruf menjadi huruf kecil,\nstopword removal menghapus kata-kata umum yang tidak memberikan informasi\nsignifikan, dan stemming untuk mengubah bentuk kata menjadi kata dasar atau tahap\nmencari akar dari tiap kata.\n3. NER Model\nModel NER diaplikasikan untuk mengidentifikasi dan menandai entitas tertentu dalam\nteks, seperti jenis perawatan, nama tindakan klinis, dan nutrisi.\n4. Word Embedding\nProses word embedding mengonversi setiap kata dalam teks menjadi vektor numerik. Ini\nmembantu model memahami representasi semantik kata.\n5. Model Training\nModel dilatih dengan algoritma LSTM untuk pemahaman konteks dan pola dalam\npercakapan chatbot. Berguna untuk menyimpan dan memahami urutan kata dalam teks\npercakapan.\n6. Testing\nPada tahap ini dilakukan pengujian model yang telah dilatih. Pengujian dilakukan\ndengan mengamati hasil akurasi dari data yang telah dimodelkan dan mengamati\nperforma dari kemampuan model dalam menjawab input berupa pertanyaan dari user.\n-Referensi Adamopoulou, E., & Moussiades, L. (2020). An Overview of Chatbot Technology. Artificial\nIntelligence Applications and Innovations, 584, 373 - 383.\nAnki, P., Bustamam, A., Al-Ash, H.S., & Sarwinda, D. (2021). Intelligent Chatbot Adapted from\nQuestion and Answer System Using RNN-LSTM Model. Journal of Physics: Conference Series,\n1844.\nFajari, A.N., & Baizal, A. (2022). Chatbot-based Culinary Tourism Recommender System Using\nNamed Entity Recognition. JIPI (Jurnal Ilmiah Penelitian dan Pembelajaran Informatika).\nFitriana, S., & Kristania, Y.M. (2021). Perancangan Sistem Informasi Klinik Hewan Berbasis\nAndroid. EVOLUSI : Jurnal Sains dan Manajemen.\nHaryanto, I.D., & Saefurrahman, S. (2024). Implementasi Chatbot Kesehatan Kucing Melalui\nDialogflow dan Telegram untuk Pemberian Informasi Penyakit dan Perawatan. JTIM : Jurnal\nTeknologi Informasi dan Multimedia.\nKhatib, J., Dalam, S., Padang, I., Ilyas, M.A., Khaqiqi, T., Harani, N.H., & Prianto, C. (2023).\nPerformance Analysis and Development of QnA Chatbot Model Using LSTM in Answering\nQuestions. Indonesian Journal of Computer Science.\nMittal, M., Battineni, G., Singh, D., Nagarwal, T., & Yadav, P. (2021). Web-based chatbot for\nFrequently Asked Queries (FAQ) in Hospitals. Journal of Taibah University Medical Sciences,\n16, 740 - 746.\nWintoro, P.B., Hermawan, H., Muda, M.A., & Mulyani, Y. (2022). Implementasi Long Short-\nTerm Memory pada Chatbot Informasi Akademik Teknik Informatika Unila. EXPERT: Jurnal\nManajemen Sistem Informasi dan Teknologi.\nMedan, 07 Mei 2024\nMahasiswa yang mengajukan,\n(Citra Wahyuni Amri)\nNIM. 201402021",
  "similar_tokens": [
    "informasi",
    "tuju",
    "milik",
    "hasil",
    "teks",
    "media",
    "sakit",
    "bantu",
    "rumah",
    "batas",
    "sehat",
    "teliti",
    "bas",
    "implementasi",
    "layan",
    "interaktif",
    "salah",
    "judul",
    "guna"
  ],
  "filename": "Exum_201402021.pdf",
  "user_id": 17
}