{
  "original_text": "FORM PENGAJUAN JUDUL\nNama : Rasyid Hafiz\nNIM : 181402099\nJudul diajukan oleh* : Dosen\nMahasiswa\nBidang Ilmu (tulis dua bidang) : - M u l t i=m edia\n- Computer System\nUji Kelayakan Judul** : Diterima Ditolak\nHasil Uji Kelayakan Judul :\nDosen Pembimbing I: Ade Sarah Huzaifah S.Kom., M.Kom\nParaf Dosen Pembimbing I\n(Jika judul dari dosen maka dosen tersebut berhak menjadi pembimbing I)\nDosen Pembimbing II: Dedy Arisandi S.T., M.Kom.\nMedan, 9 Juni 2024\nKa. Laboratorium Penelitian,\n* Centang salah satu atau keduanya (Dr. Jos Timanta Tarigan S.Kom., M.Sc)\n** Pilih salah satu NIP. 198501262015041001\nRINGKASAN JUDUL YANG DIAJUKAN\n*Semua kolom di bawah ini diisi oleh mahasiswa yang sudah mendapat judul\nJudul / Topik Integrasi Heuristic Evaluation dan Agile UX dalam peningkatan User Experience pada\nSkripsi Website Universitas Sumatera Utara\nLatar Belakang Latar Belakang\ndan Penelitian\nMunculnya internet telah merevolusi cara kita berkomunikasi, mengakses informasi, dan\nTerdahulu\nmenjalankan bisnis (Rigdon, 2023). Sejak awal kemunculannya, internet telah mengalami\npertumbuhan yang meroket, dengan jumlah pengguna di seluruh dunia yang meningkat pesat\n(Stackscale, 2023). Peningkatan penggunaan internet ini dibarengi dengan peningkatan\nketerjangkauan internet di masyarakat (We Are Socials, 2022). Situs web berfungsi sebagai\nantarmuka antara pengguna dan beragam sumber daya yang tersedia di internet (Casalegno,\n2014), menyediakan platform untuk penyebaran informasi, e-commerce (Rigdon, 2023),\ninteraksi sosial (Casalegno, 2014; Castells, 2014), dan sebagainya. Seiring dengan terus\nberkembang dan meluasnya internet, peran situs web akan semakin signifikan, dengan semakin\nmeningkatnya penekanan pada pengalaman pengguna, dan aksesibilitasnya (Sohaib et al.,\n2011).\nDesain Pengalaman Pengguna (UX Design) yang merupakan bagian dari ranah ilmu Teknologi\nInformasi, membahas tentang pengembangan aplikasi dan sistem TI dengan fokus pada\npengguna, yang mencakup pemahaman desain, pengembangan pola pikir yang mengakui\npentingnya pengguna, metodologi, penerapan kriteria evaluasi dan standar, serta analisis\npengguna dan tugas, faktor manusia, ergonomi, aksesibilitas standar, desain pengalaman, dan\npsikologi kognitif (Mutiara et al., 2023). berfokus kepada bagaimana produk tersebut berlaku\ndan digunakan oleh pengguna yang berhubungan dan membutuhkannya (Plonka et al., 2014).\nWebsite yang baik menurut prinsip User Experience (UX) dan Human Computer Interaction\n(HCI) adalah web yang mengutamakan kebutuhan dan preferensi penggunanya (Sohaib et al.,\n2011). Arsitektur fitur dan keputusan yang dibuat tentang layar, langkah, alur, tata letak,\nproses, organisasi, dan menu (Levitt, n.d.) menjadi kunci utama website yang baik. Website\nyang baik harus dimuat dengan cepat, memiliki konten yang jelas dan ringkas, serta dapat\ndiakses oleh semua pengguna (Sohaib et al., 2011), termasuk penyandang disabilitas.\nResponsivitas website terhadap berbagai ukuran layar juga penting untuk memastikan konten\nditampilkan secara optimal di perangkat apa pun (Almeida & Monteiro, 2017; Punchoojit &\nHongwarittorrn, 2017). HCI berperan penting dalam memastikan website mudah digunakan,\nefisien, dan dapat diakses oleh semua orang (Blandford, 2019; Peters et al., 2018).\nPenerapannya dapat dilihat pada navigasi yang jelas, umpan balik yang tepat, aksesibilitas, dan\ndesain responsif (Stephanidis et al., 2019).\nUniversitas, dalam upaya peningkatan reputasi dan penyebaran informasi, harus menyediakan\npengalaman daring yang menarik dan ramah pengguna bagi beragam pemangku kepentingan\n(Chapleo et al., 2011). Didirikan pada tahun 1952 (Universitas Sumatera Utara, n.d.-a),\nUniversitas Sumatera Utara (USU) sebagai salah satu institusi pendidikan tertua di Indonesia\n(Dewantari, 2022), memiliki sejarah yang kaya dalam menyediakan peluang pendidikan dan\npenelitian bereputasi di berbagai disiplin ilmu (Runtung et al., 2018; Sinar et al., 2015).\nSebagai universitas yang berfokus pada inovasi dan kolaborasi (Sinar et al., 2015), penting\nbahwa USU memiliki website yang baik dan berfungsi sebagai pusat informasi untuk\nmemperluas komunikasi, dan kolaborasi. Hal ini sejalan dengan program rektor Prof. Dr.\nMuryanto Amin, S.Sos, M.Si, Transformation Towards the Ultimate yang melanjutkan tujuan\nuntuk menjadi universitas berstandar internasional berciri keunggulan lokal (Runtung et al.,\n2018). Indikator terukur dari internasionalisasi ini adalah masuk dalam jajaran universitas top\n500 World University Rank (WUR) atau biasa disebut sebagai World Class\nUniversity(Universitas Sumatera Utara, n.d.-b). Parameter yang digunakan untuk\npemeringkatan universitas, dapat dirangkum atas Reputasi Akademik, Reputasi lulusan,\nKualitas pengajaran (dinyatakan dengan rasio mahasiswa terhadap dosen), Mahasiswa\nInternasional dan Dosen Internasional (Universitas Sumatera Utara, n.d.-b). Peningkatan\nreputasi akademik melalui peningkatan branding USU dan pengenalan USU ke dunia\ninternasional melalui web yang lebih menarik, diharapkan akan lebih mudah dalam penyebaran\ninformasi tentang USU ke dunia internasional dan akan membuat reputasinya meningkat\n(Universitas Sumatera Utara, n.d.-b).\nUX Design sebagai salah-satu dari total 19 essential IT Domains (Sabin et al., 2017),dapat\nmenjadi solusi bagi permasalahan ini. Tidak hanya mengaplikasikan user-centered design dan\nteknik terkait yang bertujuan untuk meningkatkan usabilitas dan relevansi pengalaman\npengguna dalam korporasi, UX Design juga berguna dalam mengevaluasi dan\nmengartikulasikan user-centered design ke dalam standar yang tersedia di industri (Sabin et\nal., 2017). Agile UX adalah metodologi desain dan pengembangan yang mengintegrasikan\nprinsip Agile dengan praktik desain Pengalaman Pengguna (UX) (Levitt, n.d.). Agile UX\nmenekankan pengembangan berulang, umpan balik berkelanjutan, dan kolaborasi antar tim\nlintas fungsi (Plonka et al., 2014). Agile UX bertujuan untuk menciptakan produk dan layanan\nyang berpusat pada pengguna, mudah beradaptasi, dan responsif terhadap perubahan\nkebutuhan dan preferensi. Pendekatan ini sangat berguna dalam konteks pengembangan\nproduk digital, dimana kebutuhan pengguna dan tren pasar dapat berubah dengan cepat\n(Plonka et al., 2014).\nUX Design sangat penting secara terus menerus diiterasi dan ditingkatkan, dikarenakan\npreferensi pengguna dan lingkungan secara teknis berubah dari waktu ke waktu agar lebih\nrelevan bagi pengguna (Ahmad et al., 2024), kondisi web USU saat ini perlu dievaluasi\npeningkatannya sesuai dengan standar heuristik dan standar usability. Selain itu, dalam rangka\nmendukung tujuan Universitas menuju internasionalisasi atau Transformation Towards the\nUltimate, desain situs web Universitas Sumatera Utara perlu ditingkatkan, baik dari segi\narsitektur informasi, maupun interaksinya, untuk mendukung penyebaran informasi yang\nberkaitan dengan universitas. Agile UX adalah metode yang dapat diterapkan dalam proses\ndesain ulang situs web Universitas Sumatera Utara. Tidak hanya sifatnya yang berulang,\nberpusat pada pengguna, dan kolaboratif, Agile UX memungkinkan pendekatan proyek yang\nlebih fleksibel dan adaptif, memungkinkan tim merespons umpan balik dan perubahan\npersyaratan dengan cepat (Hinderks, 2019). Hal ini sangat penting dalam konteks desain ulang\nsitus web Universitas Sumatera Utara, dimana kebutuhan dan preferensi pemangku\nkepentingan dapat berubah seiring berjalannya waktu. Dalam upaya mengintegrasikan UX di\nlingkungan Agile, desainer bertanggung jawab untuk memastikan bahwa situs web memenuhi\nkebutuhan penggunanya serta selaras dengan identitas dan nilai-nilai universitas, serta\nterstandarisasi internasional.\nPenelitian Terdahulu\nNo. Penulis Judul Tahun\nDoes Website Usability Impact Webometrics Ranking of\nUniversity? dampak dari kegunaan situs web terhadap peringkat\nYeni Anistyasari;\nwebometrics Sampel penelitian adalah 75 situs web dari\nAri Kurniawan;\nuniversitas-universitas di Indonesia. Untuk pengumpulan data,\n1. 2021\nShintami Chusnul beberapa instrumen penelitian digunakan dalam bentuk checker\nonline. Data dianalisis dengan menggunakan Structural Equation\nHidayati\nModeling. Hasil penelitian menunjukkan pemeringkatan situs web\nuniversitas berdasarkan kriteria usability memberikan hasil yang\nsignifikan sama dengan hasil pemeringkatan dengan tiga standar\nyang dikeluarkan oleh Webometrics.\nExploring the relationship between web presence and\nweb usability for universities: A case study from Turkey\nmengevaluasi usabilitas lima universitas Turki berdasarkan\nSerhat Peker,\nperingkat web presence dari Webometrics Juli 2012. Melalui tes\nSeyma\npengguna dan kuesioner dengan 20 peserta, dilakukan evaluasi\n2. Kucukozer- 2016\nCavdar, untuk meranking situs web universitas berdasarkan usabilitas.\nKursat Cagiltay Analisis Kendall’s τ menunjukkan korelasi positif yang signifikan\nantara web presence dan usabilitas situs web. Ini menunjukkan\nbahwa meningkatkan usabilitas situs web universitas akan\nmeningkatkan web presence-nya, dan sebaliknya.\nUSER EXPERIENCE DESIGN (UX DESIGN) IN A\nWEBSITE DEVELOPMENT Website redesign Studi ini\nbertujuan untuk mengimplementasikan pendekatan pengalaman\n3. 2016\npengguna untuk sebuah desain situs web. Tujuan lain dari\nMariia Orlova\npenelitian ini adalah untuk menyelidiki perilaku orang yang\nberhubungan dengan desain web. Produk yang didesain ulang\nadalah perusahaan bernama rusia Positive Communications.\nThe Effectiveness of Website Design in Higher Education\nRecruitment Thesis komunikasi ini mengeksplorasi efektivitas\nelemen visual dan estetika dalam situs web universitas untuk\n4. 2016\nmerekrut calon mahasiswa. Perlu untuk menjaga desain tetap\nFatemeh Bordbar\nsederhana dengan penggunaan gambar yang sesuai dan informasi\nterkait yang tertata dengan baik dan mudah ditemukan, serta sistem\nnavigasi yang mudah digunakan.\nIntroduction to special issue on Agile UX: challenges,\nsuccesses and barriers to improvement Desain produk\nEva-Maria Schön, konvensional (misalnya Waterfall) sebagai metodologi berbasis\nTiago Silva da\nrencana tidak cocok untuk masalah yang lebih kompleks. Semakin\n5. Silva, Andreas 2023\npopulernya metode-metode sebagai pendekatan utama dalam\nHinderks, Helen\nbeberapa tahun terakhir mengindikasikan pergeseran linear menuju\nSharp, Jörg\nThomaschewski, cara kerja yang lebih kolaboratif dan berulang, yang menekankan\nfleksibilitas dan kemampuan beradaptasi dalam proses desain.\nTidak ada tren yang jelas yang muncul terkait dengan 'Agile UX'\ndengan kesimpulan bahwa bidang ini relatif baru, serta kurangnya\nkonsensus dan aplikasi.\nIntegrating UX work with agile development through\nAlisa Ananjeva, user stories: An action research study in a small software\ncompany meneliti bagaimana integrasi pekerjaan UX dengan\nJohn Stouby\n6. pengembangan Agile dapat ditingkatkan dalam konteks perusahaan 2020\nPersson, Anders Software-as-a-Service (SaaS) kecil di Denmark.User Story yang\nterlalu panjang menyiratkan adanya masalah dalam kolaborasi dan\nBruun\nkepercayaan, sementara cerita pengguna yang ringkas dan\nmusyawarah meningkatkan integrasi pekerjaan UX dengan\npengembangan yang tangkas.\nA methodology for integrating user experience methods\nand techniques into agile software development\n7. Andreas Hinderks 2019\nmetodologi mengintegrasikan UX method ke Agile software\ndevelopment.dengan menggabungkan metodologi yang sudah ada,\ndengan mempertimbangkan incremental di lingkungan Agile\nUsability Evaluation on Website E-Fishery using Heuristic\nEvaluation. mengevaluasi usabilitas situs start-up E-Fishery\nAzzahra, S. S.,\nsecara heuristic dengan 3 evaluator spesialisasi, penilaian\n8. Mar’ah, M., & 2022\nmengggunakan tingkat frekuensi, serta menerapkan 8 dari 10\nMaharani, T. prinsip Nielsen. Persentase tertinggi ditemukan pada prinsip\ndesain heuristik H7 sebesar 46%, 0% pada H2 dan H3. H7 menjadi\ntingkat evaluasi tertinggi dengan tingkat frekuensi 5.\nHeuristic evaluation of postgraduate management\ninformation system interface evaluasi heuristik sistem\ninformasi untuk mahasiswa pascasarjana di Universitas\nFanindia\nKebangsaan Fakultas Sains Informasi dan Teknologi (FTSM)\n9. Purnama Sari, 2015\nUniversitas Kebangsaan Malaysia. menunjukkan bahwa mahasiswa\nNoraidah Sahari enggan menggunakan sistem tersebut. masalah utama yang didapat\ndari evaluasi heuristik adalah kontrol dan kebebasan pengguna, dan\nmasalah keandalan yang melanggar prinsip desain\nkegunaan/antarmuka pengguna.\nMIRFA A Web Usability Evaluation Model for Higher Education\nProviding Universities of Asia Mengevaluasi kegunaan situs\nMANZOOR,\n10. 2012\nweb pendidikan tinggi di Asia dan menghasilkan \"Model Evaluasi\nWALAYAT\nKegunaan Web\" (WUEM). Survei online menggunakan Google\nHUSSAIN\nForms mengumpulkan tanggapan siswa tentang kegunaan web.\nSepuluh universitas teknik teratas di Asia dievaluasi menggunakan\nWUEM. Hasilnya menunjukkan bahwa meskipun situs-situs ini\ncukup baik dalam struktur informasi dan navigasi, mereka lemah\ndalam aksesibilitas. WUEM menawarkan alat efektif bagi\npengembang web untuk meningkatkan kegunaan situs akademik\ndengan fokus pada fitur-fitur utama.\nStandardized Questionnaires for User Experience\nEvaluation: A Systematic Literature Review Proceeding\nIgnacio Díaz- tentang studi yang menggunakan questioner standar UX,\nOreiro, Gustavo penggunaan populer menggunakan UEQ dan AttrakDiff pada\n2017-2018, sample size median 20 participant, 38,5% dari studi\n11. López, Luis 2019\nyang ditinjau menggunakan kuesioner evaluasi UX standar sebagai\nQuesada, Luis A.\nsatu-satunya metode evaluasi. Sebanyak 61,5% dari studi primer\nGuerrero\nyang tersisa (340 studi) menggunakan antara satu hingga lima\nmetode pelengkap, di antaranya adalah kuesioner kegunaan SUS,\ndari total 120 studi yang dianalisis.\nMeasuring Machine Translation User Experience\n(MTUX): A Comparison between AttrakDiff and User\nVicent Briva-\nExperience Questionnaire Mengevaluasi Machine Translation\n12. Iglesias, Sharon 2023\nmenggunakan metode Attrakdiff dan UEQ, dengan 15 penerjemah\nO’Brien\nprofesional, jurnal menyarankan penggunaan Kuesioner\nPengalaman Pengguna (UEQ).\nPenerapan Metode Think Aloud untuk Evaluasi\nMedika Sulistiya,\nUsability pada Website Dinas Pendidikan dan\nZainul Mu, Sri\nKebudayaan Kota MNO Penerapan Metode Think Aloud\n13. Rahayu Natasia, 2021\nuntuk Evaluasi Usability pada Website Dinas Pendidikan dan\nMuhammad Kebudayaan Kota MNO. Penerapan Metode Think Aloud untuk\nYusuf Evaluasi Usability pada Website Dinas Pendidikan dan\nKebudayaan Kota MNO\nNatural Thumb Zone on Smartphone with One-Handed\nInteraction: Effects of Thumb Length and Screen Size\nHyo Chang Kim, Studi menginvestigasi natural thumb zone pada one held device\n14. 2019\ndengan ukuran 4.7 in., 5.1 in., 5.2 in. Menggunakan heatmap\nYong Gu Ji\nmethod. Daerah paling bawah dan daerah kiri atas layar sentuh\nsmartphone umumnya tidak termasuk dalam zona ibu jari alami,\nterlepas dari kelompok panjang ibu jari.\nThe role of responsive design in web development\nmengeksplorasi keuntungan dan keterbatasan utama dari desain\nweb responsif. Dengan pendekatan kuantitatif, kuesioner diisi oleh\n181 profesional industri untuk mengidentifikasi alasan adopsi\nFernando\ndesain responsif dan keterbatasan yang dihadapi.Pengalaman\n15. Almeida, José pengguna yang baik dan peningkatan aksesibilitas adalah 2017\nMonteiro keuntungan utama. Keterbatasan utama kompatibilitas dengan\nperamban web lama, waktu muat yang lebih lama, dan kesulitan\nmengoptimalkan pengalaman pengguna. Persepsi tentang\nkeuntungan dan keterbatasan desain responsif berbeda antara\nprofesional berpengalaman dan pengembang freelance.\nRumusan Masalah Dalam proses perancangan ulang website official Universitas Sumatera Utara, terdapat\nbeberapa permasalahan yang perlu diatasi untuk mencapai tujuan implementasi brand dan,\npeningkatan UX. Adapun rumusan masalah dari penelitian ini adalah “Bagaimana integrasi\nHeuristic Evaluation dan Agile UX digunakan sebagai pendekatan perancangan website\nUniversitas Sumatera Utara”.\nBatasan Masalah • Pada metode heuristic evaluation, evaluasi akan menggunakan aspek Heuristik\nNielsen (Nielsen, 1994)\n• Perancangan design system berdasarkan standard W3C (World Wide Web Consortium,\n2023)\n• Usability testing dilakukan untuk mengevaluasi aspek Usability dan Usefulness\n(Hartson & Pyla, 2019)\n• Attrakdiff akan membandingkan desain lama dan baru berdasarkan aspek pragmatis\ndan hedonis (Briva-Iglesias & O’Brien, 2023)\nMetodologi Proyek ini bertujuan untuk meredesain website Universitas Sumatera Utara, yang memiliki\nbanyak kasus penggunaan, alur, dan fitur. Tugas saya adalah menciptakan dan\nmengimplemeitasikan desain baru untuk versi responsif dari website tersebut. Dalam\npenelitian ini, penulis mengimplementasikan metodologi Agile UX (Hinderks, 2019) dan akan\nmelakukan tahap-tahap berikut:\nGambar 1: Arsitektur Umum\n1. Planning & Discoveries: Tahapan ini meliputi pemahaman kebutuhan bisnis dan\ndesain Universias Sumatera Utara, serta evaluasi heuristik dengan Shneiderman's 8\nGolden Rules, Norman's 7 Principles, dan Nielsen's 10 Heuristics kepada produk yang\nsudah ada. Evaluasi heuristik dipilih karena membantu memahami kebutuhan\npemangku kepentingan dan kondisi dunia nyata, serta menawarkan fleksibilitas dan\nefisiensi tinggi. Pada penelitian pengguna, pembuatan user story dilakukan dengan\nringkas agar memotong waktu pengembangan (Ananjeva et al., 2020). Penulis juga\nmengevaluasi arsitektur informasi dengan membandingkan konten website instansi\nlain yang berada di pemeringkatan.\n2. User Stories & Sprint Planning: berdasarkan luaran sebelumnya, selanjutnya akan\nmendefenisikan aspek UX yang dapat diimprovisasi, mendefinisikan sprint dan\ntimeline, dan membuat user stories berdasarkan aspek UX dan hasil heuristik.\n3. Design & Improvement: Pada proses prototyping, penulis akan improvisasi design\nsystem, layout, interaction dan menghasilkan luaran design system, information\narchitecture, dan high fidelity prototype. Aspek aksesibilitas mengikuti standar\nWCAG untuk memastikan website dapat diakses secara universal (World Wide Web\nConsortium, 2023). Dan menggunakan pendekatan Atomic Design (Frost, n.d.),\n4. Evaluation Prototype: Selanjutnya metode evaluasi prototype akan dilakukan dengan\nheuristic evaluation checklist. Heuristic Evaluation checklist dilakukan agar desain\nwebsite memenuhi kriteria sesuai dengan stakeholder Universitas Sumatera Utara dan\nUX expert.\n5. Implementation: pada proses ini, implementasi desain akan dilakukan pada produk\nakhir berupa website\n6. Product Evaluation: Pada proses pengujian produk jadi, penulis akan mengumpulkan\numpan balik dari pengguna tentang pengalaman mereka menggunakan cara:\na. Usability Testing dengan metode Think-A-Loud bertujuan untuk mengidentifikasi\ndan menyelesaikan masalah kegunaan (usability) dalam desain produk atau\nlayanan. Fokusnya adalah pada bagaimana pengguna berinteraksi dengan produk\ndan seberapa mudah mereka dapat menyelesaikan tugas-tugas tertentu (Punchoojit\n& Hongwarittorrn, 2017). Kelebihan testing ini dilakukan untuk Mengidentifikasi\nmasalah praktis yang menghalangi pengguna dalam menyelesaikan tugas.\nMemberikan wawasan langsung dan konkret yang dapat digunakan untuk\nperbaikan desain. Output yang diharapkan adalah:\n1. Laporan yang mengidentifikasi masalah usability spesifik, rekomendasi\nperbaikan, dan wawasan tentang bagaimana pengguna berinteraksi dengan\nproduk.\n2. Metrik Kinerja, Termasuk tingkat keberhasilan tugas, waktu penyelesaian\ntugas, dan tingkat kesalahan pengguna.\nb. Accessibility Evaluation, Verifikasi hasil audit dengan pemeriksaan manual untuk\nmemastikan elemen-elemen kritis seperti alternatuf text, dan contrast ratio.\nc. AttrakDiff, bertujuan untuk mengukur persepsi pengguna terhadap aspek\nemosional dan estetika dari desain produk atau layanan. Fokusnya adalah pada\nbagaimana pengguna merasakan kualitas produk, baik secara pragmatis maupun\nhedonis (Briva-Iglesias & O’Brien, 2023). Kelebihan dari metode evaluasi ini adalah\nMemberikan wawasan mendalam tentang dimensi emosional dan estetika dari\ndesain, dan membantu memahami bagaimana pengguna merasakan kualitas\nproduk di luar aspek kegunaan. Output yang diharapkan adalah:\n1. Peta Dua Dimensi: Menampilkan persepsi pengguna terhadap kualitas\npragmatis dan hedonis produk, serta daya tarik keseluruhan.\n2. Wawasan Emosional dan Estetika: Memberikan wawasan tentang bagaimana\npengguna merasakan kualitas produk dari perspektif emosional dan estetika.\n7. Iteration & Improvement: Sprint akan selesai pada proses ini. ketika luaran evaluasi\ntidak sesuai dengan kebutuhan pengguna, iterasi akan dilakukan kembali. Dan jika ada\nkeinginan untuk meningkatkan kembali produk, maka iterasi ke-n sprint akan\ndilakukan.\nReferensi Ahmad, S., Singari, R. M., & Bhandarkar, S. L. (2024). User Experience Design And Its Impact On\nHuman Psychology. Educational Administration: Theory …, 30(5), 4798–4808.\nhttps://doi.org/10.53555/kuey.v30i5.3702\nAlmeida, F., & Monteiro, J. (2017). The role of responsive design in web development. Webology,\n14(2), 48–65.\nAnanjeva, A., Persson, J. S., & Bruun, A. (2020). Integrating UX work with agile development through\nuser stories: An action research study in a small software company. Journal of Systems and\nSoftware, 170, 110785. https://doi.org/10.1016/j.jss.2020.110785\nBlandford, A. (2019). HCI for health and wellbeing: Challenges and opportunities. International\nJournal of Human Computer Studies, 131(June), 41–51.\nhttps://doi.org/10.1016/j.ijhcs.2019.06.007\nBriva-Iglesias, V., & O’Brien, S. (2023). Measuring Machine Translation User Experience (MTUX): A\nComparison between AttrakDiff and User Experience Questionnaire. Proceedings of the 24th\nAnnual Conference of the European Association for Machine Translation, EAMT 2023, 335–344.\nCasalegno, F. (2014). Designing Connections. In J. Fox (Ed.), Change: 19 Key Essays on How the\nInternet Is Changing Our Lives (2014th ed., pp. 166–189). BBVA.\nhttps://www.bbvaopenmind.com/en/articles/designing-connections/\nCastells, M. (2014). The Impact of the Internet on Society: A Global Perspective. In J. Fox (Ed.),\nChange: 19 Key Essays on How the Internet Is Changing Our Lives (2014th ed., pp. 126–147).\nBBVA. https://www.bbvaopenmind.com/en/articles/the-impact-of-the-internet-on-society-a-\nglobal-perspective/\nChapleo, C., Durán, M. V. C., & Díaz, A. C. (2011). Do UK universities communicate their brands\neffectively through their websites? Journal of Marketing for Higher Education, 21(1), 25–46.\nhttps://doi.org/10.1080/08841241.2011.569589\nDewantari, T. S. (2022). Profil dan Informasi Lengkap Universitas Sumatera Utara (USU).\nhttps://www.brainacademy.id/blog/universitas-sumatera-utara-usu\nFrost, B. (n.d.). Atomic Design Methodology. Atoms, molecules, organisms, templates, and pages. In B.\nFrost (Ed.), Atomic Design. Retrieved June 13, 2024, from\nhttps://atomicdesign.bradfrost.com/chapter-2/\nHartson, R., & Pyla, P. (2019). The UX Book : Agile UX Design for a Quality User Experience (Second\nEdi). Katey Birtcher.\nHinderks, A. (2019). A methodology for integrating user experience methods and techniques into agile\nsoftware development. In CAiSE 2019 Doctoral Consortium Chairs (Ed.), Proceedings of the\nDoctoral Consortium Papers Presented at the 31st International Conference on Advanced\nInformation Systems Engineering (CAiSE 2019) (Vol. 2370, Issue 2370, pp. 31–42).\nLevitt, D. (n.d.). What Is Agile UX and How to Manage It | Toptal®. Retrieved May 28, 2024, from\nhttps://www.toptal.com/product-managers/agile/agile-ux-design-explained\nMutiara, A. B., Sukmana, H. T., Prihandoko, Solikin, Kusumasari, T. F., Handayani, H. H., Syafitri, D.,\nSuherlan, E., Tyas, Z. A., Septiawan, N. A., Ginardi, R. V. H., Isnanda, R. G., Muhardi, & Arifin,\nS. (2023). Kurikulum Bidang Infokom Berbasis OBE/KKNI/SKKNI Versi 1.0 Program Studi\nTeknologi Informasi. APTIKOM.\nNielsen, J. (1994). Enhancing the explanatory power of usability heuristics. Conference on Human\nFactors in Computing Systems - Proceedings, 152–158. https://doi.org/10.1145/191666.191729\nPeters, D., Calvo, R. A., & Ryan, R. M. (2018). Designing for motivation, engagement and wellbeing in\ndigital experience. Frontiers in Psychology, 9(MAY), 1–15.\nhttps://doi.org/10.3389/fpsyg.2018.00797\nPlonka, L., Sharp, H., Gregory, P., & Taylor, K. (2014). UX design in agile: a DSDM case study.\nLecture Notes in Business Information Processing. https://doi.org/10.1007/978-3-319-06862-6\nPunchoojit, L., & Hongwarittorrn, N. (2017). Usability Studies on Mobile User Interface Design\nPatterns: A Systematic Literature Review. In Advances in Human-Computer Interaction (Vol.\n2017). https://doi.org/10.1155/2017/6787504\nRigdon, S. (2023). How Has the Internet Changed Communication in Business? (J. Fox, Ed.). BBVA.\nhttps://www.vonage.com/resources/articles/how-the-internet-changed-communication-in-business/\nRuntung, Rosmayati, Siregar, M. F. G., Nasution, M. K. M., Syam, B., Sihombing, L., Farhat, Siregar,\nG. A., Yoel, C., Suryanto, D., Siregar, A. R., Hasugian, J., Bangun, H., Ambarita, H., Wibowo, R.\nP., Ediwarman, Fadli, Dalimunthe, M. L., Sinulingga, E. P., … Muchtar, M. A. (2018). Rencana\nStrategis USU 2020-2024 (p. 83). Universitas Sumatera Utara.\nSabin, M., Alrumaih, H., Impagliazzo, J., Lunt, B., Zhang, M., Byers, B., Newhouse, W., Paterson, B.,\nPeltsverger, S., Tang, C., Veer, G. van der, & Viola, B. (2017). Information Technology Curricula\n2017: Curriculum Guidelines for Baccalaureate Degree Programs in Information Technology. In\nInformation Technology Curricula (2017th ed.). Association for Computing Machinery (ACM)\nIEEE Computer Society (IEEE-CS). https://doi.org/10.1145/3173161\nSinar, T., Lumbanraja, P., Salbiah, Widayati, D., Sitorus, R., Soeprapto, I., Suryanto, D., Ambarita, H.,\nHakim, L., Lubis, S., Iskandarini, Nasution, H., Wirjosentono, B., Zulkarnain, I., Sihombing, P.,\nHasugian, J., Janahar, I., Nazaruddin, Purba, E., … Siregar, M. (2015). Rencana Jangka Panjang\nUSU 2015–2039. Universitas Sumatera Utara.\nSohaib, O., Hussain, W., & Badini, M. K. (2011). User Experience (UX) and the Web Accessibility\nStandards. IJCSI (International Journal of Computer Science Issues), 8(3), 584–587.\nStackscale. (2023). The Internet: evolution and growth statistics.\nhttps://www.stackscale.com/blog/internet-evolution-statistics/\nStephanidis, C., Salvendy, G., Antona, M., Chen, J. Y. C., Dong, J., Duffy, V. G., Fang, X., Fidopiastis,\nC., Fragomeni, G., Fu, L. P., Guo, Y., Harris, D., Ioannou, A., Jeong, K. ah (Kate), Konomi, S.,\nKrömker, H., Kurosu, M., Lewis, J. R., Marcus, A., … Zhou, J. (2019). Seven HCI Grand\nChallenges. International Journal of Human-Computer Interaction, 35(14), 1229–1269.\nhttps://doi.org/10.1080/10447318.2019.1619259\nUniversitas Sumatera Utara. (n.d.-a). Sejarah Universitas Sumatera Utara. Retrieved June 9, 2024, from\nhttps://www.usu.ac.id/id/sejarah\nUniversitas Sumatera Utara. (n.d.-b). Transformation towards Ultimate, Strategi USU Menuju World\nClass University. Retrieved June 9, 2024, from https://www.usu.ac.id/id/transformation-towards-\nultimate,-strategi-usu-menuju-world-class-university\nWe Are Socials. (2022). MORE THAN 5 BILLION PEOPLE NOW USE THE INTERNET.\nhttps://wearesocial.com/hk/blog/2022/04/more-than-5-billion-people-now-use-the-internet/\nWorld Wide Web Consortium. (2023). Web Content Accessibility Guidelines (WCAG) 2.2. W3C\nRecommendation. https://www.w3.org/TR/WCAG22/\nMedan, 27 Juni 2024\nMahasiswa yang mengajukan,\n(Rasyid Hafiz)\nNIM. 181402099",
  "similar_tokens": [
    "informasi",
    "utama",
    "the",
    "tuju",
    "hasil",
    "user",
    "dosen",
    "sumatera",
    "evaluasi",
    "and",
    "kembang",
    "situs",
    "dekat",
    "produk",
    "dasar",
    "judul",
    "aspek",
    "tingkat",
    "httpsdoiorg",
    "metodologi",
    "utara",
    "teliti",
    "universitas",
    "usu",
    "standar",
    "alam",
    "website",
    "experience",
    "development",
    "for",
    "mudah",
    "mahasiswa",
    "studi",
    "butuh",
    "information",
    "guna"
  ],
  "filename": "Salinan_181402099-Executive_Summary.pdf",
  "user_id": 17
}