{
  "original_text": "FORM PENGAJUAN JUDUL\nNama : Asruri Salwa Asy Syifa\nNIM : 201402083\nJudul diajukan oleh* : Dosen Foto Terbaru\nMahasiswa\nBidang Ilmu (tulis dua bidang) : M u l tim e d i a , =C omputer Graphics and Vision\nUji Kelayakan Judul** : Diterima Ditolak\nHasil Uji Kelayakan Judul :\nCalon Dosen Pembimbing I: Mohammad Fadly Syah Putra, M.Sc\nParaf Calon Dosen Pembimbing I\n(Jika judul dari dosen maka dosen tersebut berhak menjadi pembimbing I)\nCalon Dosen Pembimbing II: Annisa Fadhillah Pulungan, S.Kom, M.kom\nMedan, 14 Mei 2024\nKa. Laboratorium Penelitian,\n* Centang salah satu atau keduanya (Jos Timanta Tarigan S.Kom., M.Sc.)\n** Pilih salah satu NIP. 198501262015041001\nRINGKASAN JUDUL YANG DIAJUKAN\n*Semua kolom di bawah ini diisi oleh mahasiswa yang sudah mendapat judul\nJudul / Topik Penerapan Pedagogic Agent dan Virtual Reality Dalam Pembelajaran Hewan &\nSkripsi Bioma Pada Anak Autis\nLatar Belakang Latar Belakang\ndan Penelitian\nTerdahulu Autisme, atau Gangguan Spektrum Autisme (ASD), adalah suatu kondisi\ngangguan perkembangan saraf yang memengaruhi cara seseorang dalam berkomunikasi\ndan berinteraksi dengan orang lain di sekitarnya (Eka Sari et al. 2020). Gangguan\nSpektrum Autisme (ASD) yang merupakan gangguan perkembangan saraf ditandai oleh\nkesulitan yang persisten dalam berkomunikasi maupun interaksi sosial di berbagai\nkonteks seperti berteman, mereka mungkin juga memiliki minat yang sangat kuat pada\nhal-hal tertentu, atau aktivitas yang terbatas dan repetitif. Gejala-gejala autisme ini\nbiasanya terlihat pada periode perkembangan awal atau sebelum usia 3 tahun dan dapat\nmenyebabkan gangguan yang signifikan dalam fungsi sosial, pekerjaan, atau bidang-\nbidang penting lainnya dalam kehidupan sehari-hari (Rini Ekawati et al. 2021).\nKarakteristik lain yang mungkin muncul pada penderita autisme adalah kesulitan\nbelajar, kesulitan dengan keterampilan motoric, hipersensitivitas atau hiposensitivitas\nsensorik, dan juga masalah Kesehatan mental (Amalia Sari et al. 2019).\nAnak yang mengidap autisme sering kali menghadapi berbagai rintangan dalam\npembelajaran mereka. Salah satu yang paling umum adalah kesulitan fokus. Mereka\nmudah teralihkan perhatiannya oleh hal-hal di sekitar, sehingga sulit untuk\nberkonsentrasi pada tugas yang sedang dikerjakan. Hal ini dapat membuat mereka sulit\nuntuk mengikuti pelajaran dan menyelesaikan tugas (Rini Indrati et al. 2022).\nTantangan-tantangan ini dapat membuat anak autis merasa frustrasi dan tertinggal dari\nteman-teman sekelasnya. Namun, dengan strategi yang tepat, mereka dapat belajar dan\nberkembang seperti anak-anak lain (Budi Prasetyo et al. 2017).\nProses eksplorasi menjadi salah satu elemen penting bagi anak autis dalam\nmempelajari dunia di sekitarnya dan mengasah kemampuan motorik, sensorik, serta\nkognitif mereka. Penelitian menunjukkan bahwa anak autis yang mendapat kesempatan\nlebih banyak untuk menjelajah menunjukkan perkembangan yang lebih baik dalam\nberbagai aspek, seperti komunikasi, interaksi sosial, dan perilaku (S. Weinberg et al.\n2010). Anak autis memerlukan pendekatan belajar yang berbeda dengan anak-anak pada\numumnya. Mereka mungkin lebih baik dalam belajar dengan cara yang konkret dan\nvisual, sehingga konsep abstrak seperti matematika dan sains dapat menjadi sangat sulit\nbagi mereka (Budi Prasetyo et al. 2017).\nPendekatan ini dikenal sebagai gamification, bertujuan untuk meningkatkan\nmotivasi dan keterlibatan individu dalam berbagai konteks. Gamification dan Virtual\nReality (VR) adalah dua teknologi yang dapat digabungkan dalam terapi anak autis untuk\nmenciptakan pengalaman belajar yang imersif dan interaktif dengan cara permainan\nedukasi VR (Dian Puspita Sari et al. 2018). Dalam konteks pembelajaran anak autis,\npenggabungan teknologi ini merupakan pilihan yang tepat untuk anak autis dapat belajar\nmelalui eksplorasi (Rini Indrati et al. 2022). Teknologi VR dapat menciptakan dunia\nvirtual yang memungkinkan penggunanya bebas untuk mengeksplorasi dan menjelajah\ndengan cara yang baru dan inovatif (J. Lanier, 2011).\nSalah satu pembelajaran yang dapat digunakan dalam penggabungan\nGamification dan Virtual Reality (VR) adalah pembelajaran hewan dan bioma,\nPembelajaran hewan dan bioma merupakan salah satu topik penting dalam pendidikan\nanak usia dini. Dimana pembelajarannya berfokus untuk mengetahui pengetahuan\nmengenai hewan, contohnya seperti mengetahui di habitat mana hewan tersebut tinggal\ndan makanan apa yang dikonsumsi dengan menggunakan konsep gamification yang\nakan diterapkan melalui kuis interaktif dan untuk validasi real-time pada saat mereka\nberinteraksi dengan kartu VR, anak autis dapat memperoleh pengetahuan tentang hewan,\nhabitatnya, dan makanannya dengan cara yang menyenangkan dan imersif (Dini\nAndriani et al. 2023).\nNamun, Virtual Reality saja tidak cukup untuk memberikan pengalaman belajar\nyang optimal bagi anak-anak dengan ASD (Mesa-Gresa et al. 2018). Di sinilah\nPedagogic Agent berperan, Pedagogic Agent adalah karakter virtual yang dapat\nberinteraksi dengan pengguna (Graesser & Person, 2023). Karakter virtual ini berfungsi\nsebagai pemandu interaktif, mentor, dan teman, mengubah lingkungan VR menjadi\nruang belajar yang menarik dan personal. Pedagogic Agent meningkatkan VR dari\nsekadar teknologi menjadi alat pembelajaran yang transformatif, terutama bagi individu\ndengan ASD. Kemampuan mereka untuk mempersonalisasi, membimbing, dan\nmendukung pengguna menjadikan mereka aset berharga dalam lanskap pendidikan\nberbasis VR (Parsons & Beggiato, 2024).\nPedagogic agent hadir dalam dua bentuk utama yaitu 2D dan 3D. Bentuk 2D\nbiasanya berupa karakter animasi kartun yang sederhana dan mudah dipahami,\nsedangkan bentuk 3D menawarkan pengalaman yang lebih realistis dan interaktif. Untuk\nberkomunikasi dengan anak autis, pedagogic agent dapat menggunakan voiceover, teks,\natau kombinasi keduanya (Prof. Dr. Rini Widayati, 2021). Pedagogic agent tidak hanya\nmemberikan informasi secara pasif, tetapi juga dapat berinteraksi dengan anak autis\nsecara aktif. Interaksi ini dapat dilakukan dengan berbagai cara seperti menjawab\npertanyaan, memberikan penjelasan yang mudah dipahami, memberikan umpan balik\npositif, dan memberikan motivasi untuk belajar. Interaksi ini dapat dilakukan secara\nvisual, audio, atau kombinasi keduanya tergantung kebutuhan dan preferensi anak autis\n(Dr. Budi Setiawan, 2020). Agar interaksi dengan anak autis lebih efektif dan personal,\npedagogic agent menggunakan algoritma multimedia dan alur pembelajaran yang\ndirancang khusus untuk berinteraksi dengan anak autis. Algoritma multimedia pada\npedagogic agent bekerja dengan cara menggabungkan berbagai elemen multimedia,\nseperti video, gambar, audio, dan teks, untuk menciptakan pengalaman belajar yang\nimersif dan interaktif. Algoritma ini mempertimbangkan berbagai faktor, seperti\nmenentukan bagaimana mereka berinteraksi dengan anak autis, pengetahuan anak autis,\ngaya belajar anak autis, dan tujuan pembelajaran. (Dr. Yanti Nurhayati, 2019).\nBerdasarkan penelitian yang dilakukan oleh (Saadatzi, 2016). Penelitian ini\nmeneliti penerapan pembelajaran dari agen pedagogik otonom, pengenalan suara\notomatis, dan penundaan waktu konstan untuk mengajarkan bacaan kata pada\npandangan pertama kepada dewasa muda dengan gangguan spektrum autisme. Para\npeneliti menggunakan desain multiple baseline simultan antar partisipan untuk\nmengevaluasi efektivitas intervensi dan melakukan pemeriksaan pasca-perawatan untuk\nmenilai pemeliharaan dan generalisasi pembelajaran. Ruang kelas virtual dan agen\npedagogik ditampilkan di layar komputer. Peserta duduk di kursi dan langsung\nmenghadap layar yang diletakkan di meja dengan ketinggian yang sesuai dengan\npandangan mereka. Kata-kata ditampilkan dengan font Arial 90 poin dan kontras tinggi\nuntuk memastikan keterlihatan. Karena guru siswa berjenis kelamin perempuan, maka\npenelitian ini memprogram agen pedagogik perempuan untuk menyampaikan instruksi\ndan pujian yang umum digunakan. Selain itu, agen pedagogik menunjukkan gerakan\ntubuh dan tangan, anggukan kepala, dan perubahan ekspresi wajah. Temuan penelitian\nmenunjukkan bahwa ketiga peserta berhasil memperoleh dan mempertahankan\nkemampuan membaca kata bacaan baru serta menunjukkan kemampuan generalisasi\npembelajaran. Terakhir, peserta tampak menikmati penggunaan perangkat lunak ini.\nSetelah penelitian selesai, mereka melaporkan bahwa permainan tersebut mudah\ndipahami dan mereka senang berinteraksi dengan agen pedagogik.\nPada penelitian yang dilakukan oleh (Gajendran et al. 2023). Penelitian ini\nmengulas penggunaan Realitas Virtual (VR) sebagai intervensi untuk anak dengan\nAutism Spectrum Disorder (ASD). ASD adalah gangguan perkembangan saraf yang\ngejalanya menetap seumur hidup dan didiagnosis pada usia dini. Meskipun belum ada\nobat untuk ASD, berbagai terapi dan intervensi telah dikembangkan untuk membantu\nanak ASD. VR sebagai teknologi yang tergolong baru, menunjukkan potensi yang\nmenjanjikan dalam penanganan ASD. Tinjauan ini membahas penerapan VR pada ASD\nserta studi klinis yang menggunakan VR untuk melatih keterampilan sosial, emosi,\nkomunikasi, dan vokasional pada anak usia 7-18 tahun. Penelitian ini juga menelaah\nefektivitas uji klinis yang dilakukan. Hasil penelitian menunjukkan adanya peningkatan\npada anak autis, namun data secara statistik belum signifikan karena sampel penelitian\nyang berukuran kecil. Selain itu, penelitian belum mempertimbangkan faktor\nheterogenitas populasi ASD yang meliputi budaya, spektrum autisme, dan komorbiditas.\nMemahami heterogenitas ini penting untuk menciptakan solusi penanganan yang lebih\nefektif dan personal untuk anak autis. Pengembangan teknologi VR yang lebih luas, tidak\nhanya mencakup keterampilan sosial-emosional-komunikasi dan vokasional, tetapi juga\nmencakup keterampilan motorik, kognitif, dan visuo-spasial, diharapkan dapat\nmemajukan model penanganan untuk populasi ASD yang heterogen.\nPada penelitian lainnya yang dilakukan oleh (Li et al. 2023). Penelitian ini\nmembahas “FaceMe,” yaitu permainan sosial agen virtual berbasis teknologi augmented\nreality (AR) yang mendukung perkembangan emosi anak. FaceMe menggunakan agen\nvirtual, seperangkat peralatan bantu, dan mekanisme permainan bertingkat untuk\nmengajarkan anak tentang ekspresi wajah dasar dalam skenario sosial dan meningkatkan\nketerampilan emosi dan komunikasi mereka. Hasil penelitian menunjukkan bahwa agen\nvirtual FaceMe memunculkan perilaku sosial aktif pada anak-anak dengan ASD yang\nkemudian meningkatkan kemampuan mereka memahami ekspresi wajah. Peneltian ini\njuga menyajikan panduan desain FaceMe untuk menciptakan agen virtual dalam konteks\nAR, yang membuka ranah menarik untuk permainan AR mendatang guna mendukung\npembelajaran anak.\nPada penelitian sebelumnya oleh (Zhao et al. 2021). Penelitian ini menguji model\npelatihan intervensi dini dan umpan balik cerdas sebagian untuk menganalisis efektivitas\npelatihan kognitif berbasis VR pada anak dengan gangguan spektrum autisme (ASD).\nPenelitian ini menggunakan Autism Behavior Checklist (ABC), Childhood Autism\nRating Scale (CARS), dan Clancy Autism Behavior Scale (CABS) untuk menilai tingkat\nkeparahan gejala dan efektivitas pengobatan dari pelatihan kognitif berbasis VR pada\nanak ASD. Hasil penelitian menunjukkan bahwa pelatihan kognitif berbasis VR sangat\nmenarik bagi anak ASD. Pelatihan ini secara signifikan memperbaiki gejala khas anak\nASD seperti gangguan komunikasi sosial, keterlambatan bicara, minat terbatas, dan\nperilaku kaku. Selain itu, skor pada ABC, CARS, dan CABS juga membaik setelah 4\nminggu pengobatan. Berdasarkan data tersebut, pelatihan kognitif berbasis VR dilihat\nsebagai metode yang menjanjikan untuk pengobatan anak ASD.\nPada penelitian yang dilakukan oleh (Bian & Zhou, 2022). Penelitian ini meneliti\npengaruh kepribadian dan umpan balik dari agen pengajar animasi (APA) pada motivasi\ndan hasil belajar dalam pelatihan virtual. Peneliti mengusulkan model untuk\nmenjelaskan bagaimana dua fitur ini mempengaruhi motivasi belajar, yang dipisahkan\nmenjadi motivasi intrinsik (belajar karena minat) dan motivasi ekstrinsik (belajar karena\nfaktor eksternal).Melalui dua penelitian, peneliti menemukan bahwa kepribadian APA\nlebih memengaruhi motivasi belajar eksternal, misalnya perasaan perlu mengerjakan\nsesuatu untuk mendapatkan penghargaan. Sementara itu, umpan balik dari APA justru\nlebih memengaruhi motivasi belajar internal, yaitu rasa senang dan puas saat belajar.\nHasil penelitian ini mendukung model yang diusulkan dan menunjukkan bahwa\nkepribadian dan umpan balik APA mempengaruhi proses belajar dengan cara yang\nberbeda. Penelitian lebih lanjut diperlukan untuk memahami bagaimana fitur APA yang\nberbeda dapat memaksimalkan motivasi belajar dan hasil belajar peserta didik dalam\npelatihan virtual.\nBerdasarkan penelitian terdahulu, penelitian-penelitian yang telah dikaji\nmenunjukkan bahwa berbagai metode dan media pembelajaran baru memiliki potensi\nuntuk meningkatkan kualitas hidup anak autis. Dan dapat diketahui bahwa beberapa\npenelitian masih menggunakan VR, namun pada penelitian tersebut tidak menggunakan\ninteraksi VR dengan menerapkan Pedagogic Agent, Oleh sebab itu peneliti berinisiasi\nuntuk membuat suatu pembelajaran VR yang tidak lepas dari interaksinya dengan\nmenerapkan pembelajaran berbasis Virtual Reality dengan Gamifikasi dan Pedagogic\nAgent diharapkan dapat meningkatkan pemahaman, kemampuan belajar, dan fokus anak\nautis pada mata pelajaran yang berbeda. Oleh karena itu penulis mengusulkan untuk\nmelakukan penelitian berjudul “ Penerapan Pedagogic Agent dan Virtual Reality\nDalam Pembelajaran Hewan & Bioma Pada Anak Autis “\nPenelitian Terdahulu\nNo. Penulis Keterangan\nMeneliti pengembangan dua paket\npembelajaran berbasis teknologi untuk\nMohammad Naseer Saadatzi\nmembantu anak autis (ASD) dalam membaca\n(Psycho Physiological\nkata lihat (sight words). Terdiri dari perangkat\nAnalysis Of A Pedagogical\n1. biofeedback untuk mencatat aktivitas otonom\nAgent And Robotic Peer For\nmereka selama proses belajar dan algoritma\nIndividuals With Autism\nkomputasi yang dirancang untuk memodelkan\nSpectrum Disorders, 2017)\ntingkat keterlibatan mereka saat berinteraksi\ndengan sistem bimbingan.\nAdharsh Gajendran,\nKrithika Sanjeev, Meneliti penggunaan teknologi VR untuk\nManan Sha. intervensi dan rehabilitasi pendidikan secara\n(The use of Virtual Reality fisik dan psikologis, seperti pada percobaan\n2.\nin Clinical Practice for yang dilakukan untuk melatih keterampilan\nAutism Spectrum Disorder: hidup sehari-hari, kognitif, dan sosial pada\nA Comprehensive Mini- penyandang disabilitas intelektual\nReview, 2023)\nJiaJia Li, Mengimplementasikan “FaceMe,” permainan\nZixia Zheng. sosial augmented reality (AR) yang membantu\nYaqing Chai, anak usia dini dengan ASD meningkatkan\nXi Li, kemampuan mengenali ekspresi wajah dan\nXing Wei. memperoleh keterampilan komunikasi dan\n3. (FaceMe: An agent-based sosial-emosional awal. FaceMe menciptakan\nsocial game using lingkungan virtual yang interaktif secara\naugmented reality for the sosial. Anak-anak menggunakan objek nyata\nemotional development of untuk berinteraksi dengan agen virtual tiga\nchildren with autism dimensi (3D) yang tertanam dalam\nspectrum disorder, 2023) pemandangan sosial nyata.\nMenguji pengaruh pelatihan kognitif berbasis\nJun-Qiang Zhao, Virtual Agent (VA) pada anak dengan\nXin-Xin Zhang, gangguan spektrum autisme (ASD)\nChang-Hong Wang, menggunakan model pelatihan intervensi dini\nJun Yang. dan umpan balik cerdas sebagian. Para\n4.\n(Effect of cognitive training peneliti membangun adegan animasi\nbased on virtual reality on pariwisata (pelatihan kognitif berbasis VA\nthe children with autism untuk identifikasi benda, warna bunga, dan\nspectrum disorder, 2021) tinggi badan hewan) dan video terkait sebagai\npelatihan kontrol.\nYulong BIAN,\nMeneliti tentang pengaruh kepribadian dan\nChao ZHOU.\numpan balik dari agen pengajar animasi\n(Motivation effect of\n(APA) terhadap pembelajaran dalam\nanimated pedagogical\n5. pelatihan virtual. karakter APA membuat\nagent's personality and\npeserta didik merasa perlu belajar untuk\nfeedback strategy types on\nmemenuhi harapan eksternal, sedangkan\nlearning in virtual training\numpan balik APA membuat proses belajar\nenvironment, 2022)\nmenjadi lebih menyenangkan dan memotivasi\npeserta didik untuk belajar secara internal.\nPenelitian ini menggunakan interaksi VR dengan menerapkan Pedagogic Agent\nsebagai karakter virtual yang dapat berinteraksi dengan pengguna yang nantinya menjadi\nkarakter pemandu interaktif di dalam lingkungan VR, berbeda dengan penelitian\nsebelumnya yang masih menggunakan VR namun tidak berfokus dalam penerapan\ninteraksi VR.\nRumusan Penelitian terkait Gamification dan Virtual Reality (VR) dalam pembelajaran anak\nMasalah autis berawal dari kesulitan belajar yang signifikan yang dihadapi anak autis. Kesulitan\nini meliputi kurangnya fokus pada anak autis yang mudah teralihkan perhatiannya dan\nsulit berkonsentrasi pada tugas, hal ini dapat membuat anak autis merasa frustrasi dan\ntertinggal dari teman-teman sekelasnya. Oleh karena itu, penelitian ini membutuhkan\nsuatu metode pembelajaran yang lebih efektif untuk diterapkan dalam pembelajaran\npada anak autis. Penelitian ini didasari oleh keyakinan bahwa pembelajaran berbasis\nVirtual Reality dengan Gamifikasi dan Pedagogic Agent untuk mengajarkan konsep\nhewan dan bioma kepada anak autis dapat meningkatkan motivasi dan keterlibatan anak\nautis dalam proses belajar, serta dapat menciptakan pengalaman belajar yang imersif dan\ninteraktif yang sesuai dengan gaya belajar anak autis yang ingin bebas mengeksplorasi.\nPenelitian ini diharapkan dapat meningkatkan kualitas pembelajaran anak autis dan\nmembantu mereka mencapai potensi penuh mereka.\nMetodologi\nTahap Penelitian :\n1. Perencanaan dan Desain\n1.1 Ide dan Konsep\nPada tahapan awal yang dilakukan adalah perencanaan dan desain, dimana pada\ntahapan ini menyangkut penentuan ide dan konsep awal model, termasuk membuat\nsketsa dan storyboard, bentuk, dimensi dan detailnya. kemudian kita mulai\nmenentukan tujuan pembelajaran seperti apa yang ingin dicapai oleh anak autis\nmelalui pembelajaran VR Gamified. Setelah tujuan telah ditentukan saatnya\nmemilih materi pembelajaran apa yang akan diajarkan melalui VR gamified, seperti\nmateri pengetahuan tentang hewan dan bioma. tahapan tahapan selanjutnya\nmenyangkut perancangan elemen gamification secara umum, pengembangan\nskenario VR, serta pemilihan platform VR yang sesuai dengan target pengguna.\n2. Pengembangan / Modelling 3D\n2.1 Model 3D\nPada tahapan ini 2D image dan model 3D memiliki keterkaitan secara tidak\nlangsung, 2D image dapat digunakan sebagai referensi, tekstur, serta storyboard\nuntuk membuat model 3D. Lalu di tahap inilah kita mulai membuat asset yaitu\nmodel 3D serta 3D Environment, seperti model 3D untuk membangun lingkungan\nVR.\n2.2 Sculpting, Texturing, Rigging\nPada tahapan ini dimulai dengan membuat bentuk dasar objek 3D menggunakan\nprimitive shapes serta menggunakan teknik pemodelan yang sesuai seperti\nsculpting, dan sebagainya. setelah kita menambahkan detail serta memastikan\ntopology model yang rapi dan terstruktur, maka proses selanjutnya adalah\ntexturing. Pada tahap texturing yaitu saatnya untuk memberikan material pada\nmodel untuk memberikan efek seperti kulit, kain, kayu, dan sebagainya. Sebelum\nmasuk ke tahap animasi kita perlu melakukan rigging untuk membuat karakter 3D\ndapat digerakkan dan dianimasikan, dengan cara membuat kerangka digital yang\nterhubung dengan model 3D.\n2.3 Animation\nSelanjutnya dengan menggunakan rig yang sudah dibuat sebelumnya saatnya\nmembuat animasi gerakan pada model 3D sesuai dengan jalan cerita atau\nstoryboard. Animasi ini bisa berupa gerakan sederhana seperti berjalan, berlari,\natau melompat, maupun animasi yang lebih kompleks.\n2.4 Rendering\nTahap berikutnya jika sudah selesai mengatur dan menyiapkan pencahayaan,\nmaterial, dan menentukan sudut pandang kamera yang tepat, maka sudah bisa\nmasuk ke tahap rendering, yaitu proses untuk menghasilkan gambar atau video\nfinal atau proses akhir dari model 3D.\n2.5 Exported 3D Object\nSetelah rendering selesai selanjutnya mengekspor 3D object yang sudah\ndikembangkan ke format file yang compatible dengan Unreal Engine, yang\nnantinya akan menjadi database asset untuk selanjutnya mengembangkan model\n3D dalam membangun Virtual Reality.\n3. Unreal Engine\n3.1 Interaksi VR\nLangkah awal yang dilakukan adalah menentukan interaksi VR yang merupakan\nfondasi yang akan menentukan bagaimana anak autis akan berinteraksi dengan\nlingkungan VR. Contoh interaksi VR yang ingin dibuat yaitu bisa berupa\nmemindahkan objek, memanipulasi objek, memicu peristiwa, berinteraksi dengan\nkarakter, dan sebagainya.\n3.2 Blueprint dan Script\nBlueprint adalah alat visual di Unreal Engine yang digunakan untuk memprogram\ninteraksi VR. Tahap yang dilakukan dalam membuat Blueprint untuk memprogram\ninteraksi VR adalah dengan menuliskan script menggunakan bahasa pemrograman\nyang kita pilih untuk mengontrol interaksi VR. Script ini dapat digunakan untuk\nmendeteksi input dari kontroler VR, memperbarui posisi objek dan memicu\nperistiwa.\n3.3 Elemen Gamification\nSetelah menentukan interaksi VR, langkah selanjutnya dalam pengembangan VR\nadalah menentukan elemen gamification. Beberapa elemen gamification yang\ndapat dipertimbangkan adalah Poin, Lencana, dan Papan Peringkat. Seperti\nmemberikan poin pada pengguna setiap menyelesaikan tugas, memberikan\nlencana kepada pengguna untuk mencapai pencapaian khusus, menampilkan\npapan peringkat yang menunjukkan peringkat pengguna. Selain itu elemen lainnya\ntermasuk menciptakan cerita yang menarik daam memandu pengguna melalui\naplikasi VR serta dapat juga menggunakan narasi untuk memberikan instruksi,\numpan balik, maupun dorongan kepada pengguna.\n4. Virtual Reality\nSetelah berhasil mengembangkan aplikasi VR gamified sebelumnya, maka tahapan\nberikutnya mengimplementasikan interaksi VR dan elemen gamification yang\ntelah dirancang ke dalam aplikasi VR. dilakukan pula pengujian internal untuk\nmemastikan aplikasi VR berfungsi dengan baik serta dilakukan juga pengujian\ndengan pengguna eksternal untuk mendapatkan umpan balik untuk\nmenyempurnakan aplikasi VR. Output yang dihasilkan pada akhir proses\npengembangan VR adalah aplikasi Virtual Reality Gamified untuk mengenalkan\ntentang hewan dan bioma pada anak autis.\nReferensi\nBian, Y., & Zhou, C. (2022). Motivation effect of animated pedagogical agent’s personality and\nfeedback strategy types on learning in virtual training environment. Virtual Reality &\nIntelligent Hardware, 4(2), 153–172. https://doi.org/10.1016/j.vrih.2021.11.001\nDr. Budi Setiawan, M. Pd. (2020). Interaksi Pedagogic Agent dengan Pengguna dalam\nPembelajaran. Jurnal Pendidikan Interaktif.\nDr. Yanti Nurhayati, M. Kom. (2019). Algoritma dan Alur Pembelajaran dalam Pedagogic Agent.\nJurnal Artificial Intelligence in Education.\nEka Sari, F. (2020). Peran Orang Tua dalam Meningkatkan Keterampilan Sosial Anak Autisme\nMelalui Kegiatan Bermain.\nEkawati, R. (2021). Pemahaman Tentang Gangguan Spektrum Autisme pada Orang Tua Anak\nBerkebutuhan Khusus.\nGajendran, A., Sanjeev, K., & Shah, M. (2023). The use of Virtual Reality in Clinical Practice for\nAutism Spectrum Disorder: A Comprehensive Mini-Review. https://doi.org/10.35248/2165-\n7890.23.13.377\nGraesser, A. C., & Person, N. K. (2023). Pedagogic Agents: A Review of the Literature.\nIndrati, R. (2022). Intervensi Perilaku Kognitif untuk Meningkatkan Kemampuan Belajar pada\nAnak Autisme.\nLanier, J. (2011). Virtual Reality as a New Frontier for Human Experience.\nLi, J., Zheng, Z., Chai, Y., Li, X., & Wei, X. (2023). FaceMe: An agent-based social game using\naugmented reality for the emotional development of children with autism spectrum\ndisorder. International Journal of Human-Computer Studies, 175, 103032.\nhttps://doi.org/10.1016/j.ijhcs.2023.103032\nMesa-Gresa, P., Gil-Gómez, H., Lozano-Quilis, J.-A., & Gil-Gómez, J.-A. (2018). Effectiveness\nof Virtual Reality for Children and Adolescents with Autism Spectrum Disorder: An\nEvidence-Based Systematic Review. Sensors (Basel, Switzerland), 18(8).\nhttps://doi.org/10.3390/s18082486\nParsons, S., & Beggiato, M. (2024). Virtual Reality and Pedagogic Agents: Revolutionizing\nEducation for Children with Autism Spectrum Disorder.\nPrasetyo, B. (2017). Strategi Pembelajaran yang Tepat untuk Anak Berkebutuhan Khusus\nAutisme di Sekolah Dasar.\nProf. Dr. Rini Widayati, M. Psi. (2021). Bentuk dan Wujud Pedagogic Agent dalam\nPembelajaran. Jurnal Pendidikan Multimedia.\nS. Weinberg, B. (2010). The Role of Exploration in the Development of Children with Autism\nSpectrum Disorders.\nSaadatzi, M. (2016). Psychophysiological analysis of a pedagogical agent and robotic peer for\nindividuals with autism spectrum disorders. [University of Louisville].\nhttps://doi.org/10.18297/etd/2570\nSari, A. (2019). Diagnosis dan Tatalaksana Gangguan Spektrum Autisme pada Anak.\nSari, D. (2018). Pelatihan Keterampilan Komunikasi bagi Orang Tua Anak Autisme.\nZhao, J.-Q., Zhang, X.-X., Wang, C.-H., & Yang, J. (2021). Effect of cognitive training based on\nvirtual reality on the children with autism spectrum disorder. Current Research in\nBehavioral Sciences, 2, 100013. https://doi.org/10.1016/j.crbeha.2020.100013\nMedan, 14 Mei 2024\nMahasiswa yang mengajukan,\n(Asruri Salwa Asy Syifa)\nNIM. 201402083\nFORM PENGAJUAN JUDUL\nNama : Asruri Salwa Asy Syifa\nNIM : 201402083\nJudul diajukan oleh* : Dosen Foto Terbaru\nMahasiswa\nBidang Ilmu (tulis dua bidang) : M u l tim e d i a , =C omputer Graphics and Vision\nUji Kelayakan Judul** : Diterima Ditolak\nHasil Uji Kelayakan Judul :\nCalon Dosen Pembimbing I: Mohammad Fadly Syah Putra, M.Sc\nParaf Calon Dosen Pembimbing I\n(Jika judul dari dosen maka dosen tersebut berhak menjadi pembimbing I)\nCalon Dosen Pembimbing II: Annisa Fadhillah Pulungan, S.Kom, M.kom\nMedan, 14 Mei 2024\nKa. Laboratorium Penelitian,\n* Centang salah satu atau keduanya (Jos Timanta Tarigan S.Kom., M.Sc.)\n** Pilih salah satu NIP. 198501262015041001\nRINGKASAN JUDUL YANG DIAJUKAN\n*Semua kolom di bawah ini diisi oleh mahasiswa yang sudah mendapat judul\nJudul / Topik Penerapan Pedagogic Agent dan Virtual Reality Dalam Pembelajaran Hewan &\nSkripsi Bioma Pada Anak Autis\nLatar Belakang Latar Belakang\ndan Penelitian\nTerdahulu Autisme, atau Gangguan Spektrum Autisme (ASD), adalah suatu kondisi\ngangguan perkembangan saraf yang memengaruhi cara seseorang dalam berkomunikasi\ndan berinteraksi dengan orang lain di sekitarnya (Eka Sari et al. 2020). Gangguan\nSpektrum Autisme (ASD) yang merupakan gangguan perkembangan saraf ditandai oleh\nkesulitan yang persisten dalam berkomunikasi maupun interaksi sosial di berbagai\nkonteks seperti berteman, mereka mungkin juga memiliki minat yang sangat kuat pada\nhal-hal tertentu, atau aktivitas yang terbatas dan repetitif. Gejala-gejala autisme ini\nbiasanya terlihat pada periode perkembangan awal atau sebelum usia 3 tahun dan dapat\nmenyebabkan gangguan yang signifikan dalam fungsi sosial, pekerjaan, atau bidang-\nbidang penting lainnya dalam kehidupan sehari-hari (Rini Ekawati et al. 2021).\nKarakteristik lain yang mungkin muncul pada penderita autisme adalah kesulitan\nbelajar, kesulitan dengan keterampilan motoric, hipersensitivitas atau hiposensitivitas\nsensorik, dan juga masalah Kesehatan mental (Amalia Sari et al. 2019).\nAnak yang mengidap autisme sering kali menghadapi berbagai rintangan dalam\npembelajaran mereka. Salah satu yang paling umum adalah kesulitan fokus. Mereka\nmudah teralihkan perhatiannya oleh hal-hal di sekitar, sehingga sulit untuk\nberkonsentrasi pada tugas yang sedang dikerjakan. Hal ini dapat membuat mereka sulit\nuntuk mengikuti pelajaran dan menyelesaikan tugas (Rini Indrati et al. 2022).\nTantangan-tantangan ini dapat membuat anak autis merasa frustrasi dan tertinggal dari\nteman-teman sekelasnya. Namun, dengan strategi yang tepat, mereka dapat belajar dan\nberkembang seperti anak-anak lain (Budi Prasetyo et al. 2017).\nProses eksplorasi menjadi salah satu elemen penting bagi anak autis dalam\nmempelajari dunia di sekitarnya dan mengasah kemampuan motorik, sensorik, serta\nkognitif mereka. Penelitian menunjukkan bahwa anak autis yang mendapat kesempatan\nlebih banyak untuk menjelajah menunjukkan perkembangan yang lebih baik dalam\nberbagai aspek, seperti komunikasi, interaksi sosial, dan perilaku (S. Weinberg et al.\n2010). Anak autis memerlukan pendekatan belajar yang berbeda dengan anak-anak pada\numumnya. Mereka mungkin lebih baik dalam belajar dengan cara yang konkret dan\nvisual, sehingga konsep abstrak seperti matematika dan sains dapat menjadi sangat sulit\nbagi mereka (Budi Prasetyo et al. 2017).\nPendekatan ini dikenal sebagai gamification, bertujuan untuk meningkatkan\nmotivasi dan keterlibatan individu dalam berbagai konteks. Gamification dan Virtual\nReality (VR) adalah dua teknologi yang dapat digabungkan dalam terapi anak autis untuk\nmenciptakan pengalaman belajar yang imersif dan interaktif dengan cara permainan\nedukasi VR (Dian Puspita Sari et al. 2018). Dalam konteks pembelajaran anak autis,\npenggabungan teknologi ini merupakan pilihan yang tepat untuk anak autis dapat belajar\nmelalui eksplorasi (Rini Indrati et al. 2022). Teknologi VR dapat menciptakan dunia\nvirtual yang memungkinkan penggunanya bebas untuk mengeksplorasi dan menjelajah\ndengan cara yang baru dan inovatif (J. Lanier, 2011).\nSalah satu pembelajaran yang dapat digunakan dalam penggabungan\nGamification dan Virtual Reality (VR) adalah pembelajaran hewan dan bioma,\nPembelajaran hewan dan bioma merupakan salah satu topik penting dalam pendidikan\nanak usia dini. Dimana pembelajarannya berfokus untuk mengetahui pengetahuan\nmengenai hewan, contohnya seperti mengetahui di habitat mana hewan tersebut tinggal\ndan makanan apa yang dikonsumsi dengan menggunakan konsep gamification yang\nakan diterapkan melalui kuis interaktif dan untuk validasi real-time pada saat mereka\nberinteraksi dengan kartu VR, anak autis dapat memperoleh pengetahuan tentang hewan,\nhabitatnya, dan makanannya dengan cara yang menyenangkan dan imersif (Dini\nAndriani et al. 2023).\nNamun, Virtual Reality saja tidak cukup untuk memberikan pengalaman belajar\nyang optimal bagi anak-anak dengan ASD (Mesa-Gresa et al. 2018). Di sinilah\nPedagogic Agent berperan, Pedagogic Agent adalah karakter virtual yang dapat\nberinteraksi dengan pengguna (Graesser & Person, 2023). Karakter virtual ini berfungsi\nsebagai pemandu interaktif, mentor, dan teman, mengubah lingkungan VR menjadi\nruang belajar yang menarik dan personal. Pedagogic Agent meningkatkan VR dari\nsekadar teknologi menjadi alat pembelajaran yang transformatif, terutama bagi individu\ndengan ASD. Kemampuan mereka untuk mempersonalisasi, membimbing, dan\nmendukung pengguna menjadikan mereka aset berharga dalam lanskap pendidikan\nberbasis VR (Parsons & Beggiato, 2024).\nPedagogic agent hadir dalam dua bentuk utama yaitu 2D dan 3D. Bentuk 2D\nbiasanya berupa karakter animasi kartun yang sederhana dan mudah dipahami,\nsedangkan bentuk 3D menawarkan pengalaman yang lebih realistis dan interaktif. Untuk\nberkomunikasi dengan anak autis, pedagogic agent dapat menggunakan voiceover, teks,\natau kombinasi keduanya (Prof. Dr. Rini Widayati, 2021). Pedagogic agent tidak hanya\nmemberikan informasi secara pasif, tetapi juga dapat berinteraksi dengan anak autis\nsecara aktif. Interaksi ini dapat dilakukan dengan berbagai cara seperti menjawab\npertanyaan, memberikan penjelasan yang mudah dipahami, memberikan umpan balik\npositif, dan memberikan motivasi untuk belajar. Interaksi ini dapat dilakukan secara\nvisual, audio, atau kombinasi keduanya tergantung kebutuhan dan preferensi anak autis\n(Dr. Budi Setiawan, 2020). Agar interaksi dengan anak autis lebih efektif dan personal,\npedagogic agent menggunakan algoritma multimedia dan alur pembelajaran yang\ndirancang khusus untuk berinteraksi dengan anak autis. Algoritma multimedia pada\npedagogic agent bekerja dengan cara menggabungkan berbagai elemen multimedia,\nseperti video, gambar, audio, dan teks, untuk menciptakan pengalaman belajar yang\nimersif dan interaktif. Algoritma ini mempertimbangkan berbagai faktor, seperti\nmenentukan bagaimana mereka berinteraksi dengan anak autis, pengetahuan anak autis,\ngaya belajar anak autis, dan tujuan pembelajaran. (Dr. Yanti Nurhayati, 2019).\nBerdasarkan penelitian yang dilakukan oleh (Saadatzi, 2016). Penelitian ini\nmeneliti penerapan pembelajaran dari agen pedagogik otonom, pengenalan suara\notomatis, dan penundaan waktu konstan untuk mengajarkan bacaan kata pada\npandangan pertama kepada dewasa muda dengan gangguan spektrum autisme. Para\npeneliti menggunakan desain multiple baseline simultan antar partisipan untuk\nmengevaluasi efektivitas intervensi dan melakukan pemeriksaan pasca-perawatan untuk\nmenilai pemeliharaan dan generalisasi pembelajaran. Ruang kelas virtual dan agen\npedagogik ditampilkan di layar komputer. Peserta duduk di kursi dan langsung\nmenghadap layar yang diletakkan di meja dengan ketinggian yang sesuai dengan\npandangan mereka. Kata-kata ditampilkan dengan font Arial 90 poin dan kontras tinggi\nuntuk memastikan keterlihatan. Karena guru siswa berjenis kelamin perempuan, maka\npenelitian ini memprogram agen pedagogik perempuan untuk menyampaikan instruksi\ndan pujian yang umum digunakan. Selain itu, agen pedagogik menunjukkan gerakan\ntubuh dan tangan, anggukan kepala, dan perubahan ekspresi wajah. Temuan penelitian\nmenunjukkan bahwa ketiga peserta berhasil memperoleh dan mempertahankan\nkemampuan membaca kata bacaan baru serta menunjukkan kemampuan generalisasi\npembelajaran. Terakhir, peserta tampak menikmati penggunaan perangkat lunak ini.\nSetelah penelitian selesai, mereka melaporkan bahwa permainan tersebut mudah\ndipahami dan mereka senang berinteraksi dengan agen pedagogik.\nPada penelitian yang dilakukan oleh (Gajendran et al. 2023). Penelitian ini\nmengulas penggunaan Realitas Virtual (VR) sebagai intervensi untuk anak dengan\nAutism Spectrum Disorder (ASD). ASD adalah gangguan perkembangan saraf yang\ngejalanya menetap seumur hidup dan didiagnosis pada usia dini. Meskipun belum ada\nobat untuk ASD, berbagai terapi dan intervensi telah dikembangkan untuk membantu\nanak ASD. VR sebagai teknologi yang tergolong baru, menunjukkan potensi yang\nmenjanjikan dalam penanganan ASD. Tinjauan ini membahas penerapan VR pada ASD\nserta studi klinis yang menggunakan VR untuk melatih keterampilan sosial, emosi,\nkomunikasi, dan vokasional pada anak usia 7-18 tahun. Penelitian ini juga menelaah\nefektivitas uji klinis yang dilakukan. Hasil penelitian menunjukkan adanya peningkatan\npada anak autis, namun data secara statistik belum signifikan karena sampel penelitian\nyang berukuran kecil. Selain itu, penelitian belum mempertimbangkan faktor\nheterogenitas populasi ASD yang meliputi budaya, spektrum autisme, dan komorbiditas.\nMemahami heterogenitas ini penting untuk menciptakan solusi penanganan yang lebih\nefektif dan personal untuk anak autis. Pengembangan teknologi VR yang lebih luas, tidak\nhanya mencakup keterampilan sosial-emosional-komunikasi dan vokasional, tetapi juga\nmencakup keterampilan motorik, kognitif, dan visuo-spasial, diharapkan dapat\nmemajukan model penanganan untuk populasi ASD yang heterogen.\nPada penelitian lainnya yang dilakukan oleh (Li et al. 2023). Penelitian ini\nmembahas “FaceMe,” yaitu permainan sosial agen virtual berbasis teknologi augmented\nreality (AR) yang mendukung perkembangan emosi anak. FaceMe menggunakan agen\nvirtual, seperangkat peralatan bantu, dan mekanisme permainan bertingkat untuk\nmengajarkan anak tentang ekspresi wajah dasar dalam skenario sosial dan meningkatkan\nketerampilan emosi dan komunikasi mereka. Hasil penelitian menunjukkan bahwa agen\nvirtual FaceMe memunculkan perilaku sosial aktif pada anak-anak dengan ASD yang\nkemudian meningkatkan kemampuan mereka memahami ekspresi wajah. Peneltian ini\njuga menyajikan panduan desain FaceMe untuk menciptakan agen virtual dalam konteks\nAR, yang membuka ranah menarik untuk permainan AR mendatang guna mendukung\npembelajaran anak.\nPada penelitian sebelumnya oleh (Zhao et al. 2021). Penelitian ini menguji model\npelatihan intervensi dini dan umpan balik cerdas sebagian untuk menganalisis efektivitas\npelatihan kognitif berbasis VR pada anak dengan gangguan spektrum autisme (ASD).\nPenelitian ini menggunakan Autism Behavior Checklist (ABC), Childhood Autism\nRating Scale (CARS), dan Clancy Autism Behavior Scale (CABS) untuk menilai tingkat\nkeparahan gejala dan efektivitas pengobatan dari pelatihan kognitif berbasis VR pada\nanak ASD. Hasil penelitian menunjukkan bahwa pelatihan kognitif berbasis VR sangat\nmenarik bagi anak ASD. Pelatihan ini secara signifikan memperbaiki gejala khas anak\nASD seperti gangguan komunikasi sosial, keterlambatan bicara, minat terbatas, dan\nperilaku kaku. Selain itu, skor pada ABC, CARS, dan CABS juga membaik setelah 4\nminggu pengobatan. Berdasarkan data tersebut, pelatihan kognitif berbasis VR dilihat\nsebagai metode yang menjanjikan untuk pengobatan anak ASD.\nPada penelitian yang dilakukan oleh (Bian & Zhou, 2022). Penelitian ini meneliti\npengaruh kepribadian dan umpan balik dari agen pengajar animasi (APA) pada motivasi\ndan hasil belajar dalam pelatihan virtual. Peneliti mengusulkan model untuk\nmenjelaskan bagaimana dua fitur ini mempengaruhi motivasi belajar, yang dipisahkan\nmenjadi motivasi intrinsik (belajar karena minat) dan motivasi ekstrinsik (belajar karena\nfaktor eksternal).Melalui dua penelitian, peneliti menemukan bahwa kepribadian APA\nlebih memengaruhi motivasi belajar eksternal, misalnya perasaan perlu mengerjakan\nsesuatu untuk mendapatkan penghargaan. Sementara itu, umpan balik dari APA justru\nlebih memengaruhi motivasi belajar internal, yaitu rasa senang dan puas saat belajar.\nHasil penelitian ini mendukung model yang diusulkan dan menunjukkan bahwa\nkepribadian dan umpan balik APA mempengaruhi proses belajar dengan cara yang\nberbeda. Penelitian lebih lanjut diperlukan untuk memahami bagaimana fitur APA yang\nberbeda dapat memaksimalkan motivasi belajar dan hasil belajar peserta didik dalam\npelatihan virtual.\nBerdasarkan penelitian terdahulu, penelitian-penelitian yang telah dikaji\nmenunjukkan bahwa berbagai metode dan media pembelajaran baru memiliki potensi\nuntuk meningkatkan kualitas hidup anak autis. Dan dapat diketahui bahwa beberapa\npenelitian masih menggunakan VR, namun pada penelitian tersebut tidak menggunakan\ninteraksi VR dengan menerapkan Pedagogic Agent, Oleh sebab itu peneliti berinisiasi\nuntuk membuat suatu pembelajaran VR yang tidak lepas dari interaksinya dengan\nmenerapkan pembelajaran berbasis Virtual Reality dengan Gamifikasi dan Pedagogic\nAgent diharapkan dapat meningkatkan pemahaman, kemampuan belajar, dan fokus anak\nautis pada mata pelajaran yang berbeda. Oleh karena itu penulis mengusulkan untuk\nmelakukan penelitian berjudul “ Penerapan Pedagogic Agent dan Virtual Reality\nDalam Pembelajaran Hewan & Bioma Pada Anak Autis “\nPenelitian Terdahulu\nNo. Penulis Keterangan\nMeneliti pengembangan dua paket\npembelajaran berbasis teknologi untuk\nMohammad Naseer Saadatzi\nmembantu anak autis (ASD) dalam membaca\n(Psycho Physiological\nkata lihat (sight words). Terdiri dari perangkat\nAnalysis Of A Pedagogical\n1. biofeedback untuk mencatat aktivitas otonom\nAgent And Robotic Peer For\nmereka selama proses belajar dan algoritma\nIndividuals With Autism\nkomputasi yang dirancang untuk memodelkan\nSpectrum Disorders, 2017)\ntingkat keterlibatan mereka saat berinteraksi\ndengan sistem bimbingan.\nAdharsh Gajendran,\nKrithika Sanjeev, Meneliti penggunaan teknologi VR untuk\nManan Sha. intervensi dan rehabilitasi pendidikan secara\n(The use of Virtual Reality fisik dan psikologis, seperti pada percobaan\n2.\nin Clinical Practice for yang dilakukan untuk melatih keterampilan\nAutism Spectrum Disorder: hidup sehari-hari, kognitif, dan sosial pada\nA Comprehensive Mini- penyandang disabilitas intelektual\nReview, 2023)\nJiaJia Li, Mengimplementasikan “FaceMe,” permainan\nZixia Zheng. sosial augmented reality (AR) yang membantu\nYaqing Chai, anak usia dini dengan ASD meningkatkan\nXi Li, kemampuan mengenali ekspresi wajah dan\nXing Wei. memperoleh keterampilan komunikasi dan\n3. (FaceMe: An agent-based sosial-emosional awal. FaceMe menciptakan\nsocial game using lingkungan virtual yang interaktif secara\naugmented reality for the sosial. Anak-anak menggunakan objek nyata\nemotional development of untuk berinteraksi dengan agen virtual tiga\nchildren with autism dimensi (3D) yang tertanam dalam\nspectrum disorder, 2023) pemandangan sosial nyata.\nMenguji pengaruh pelatihan kognitif berbasis\nJun-Qiang Zhao, Virtual Agent (VA) pada anak dengan\nXin-Xin Zhang, gangguan spektrum autisme (ASD)\nChang-Hong Wang, menggunakan model pelatihan intervensi dini\nJun Yang. dan umpan balik cerdas sebagian. Para\n4.\n(Effect of cognitive training peneliti membangun adegan animasi\nbased on virtual reality on pariwisata (pelatihan kognitif berbasis VA\nthe children with autism untuk identifikasi benda, warna bunga, dan\nspectrum disorder, 2021) tinggi badan hewan) dan video terkait sebagai\npelatihan kontrol.\nYulong BIAN,\nMeneliti tentang pengaruh kepribadian dan\nChao ZHOU.\numpan balik dari agen pengajar animasi\n(Motivation effect of\n(APA) terhadap pembelajaran dalam\nanimated pedagogical\n5. pelatihan virtual. karakter APA membuat\nagent's personality and\npeserta didik merasa perlu belajar untuk\nfeedback strategy types on\nmemenuhi harapan eksternal, sedangkan\nlearning in virtual training\numpan balik APA membuat proses belajar\nenvironment, 2022)\nmenjadi lebih menyenangkan dan memotivasi\npeserta didik untuk belajar secara internal.\nPenelitian ini menggunakan interaksi VR dengan menerapkan Pedagogic Agent\nsebagai karakter virtual yang dapat berinteraksi dengan pengguna yang nantinya menjadi\nkarakter pemandu interaktif di dalam lingkungan VR, berbeda dengan penelitian\nsebelumnya yang masih menggunakan VR namun tidak berfokus dalam penerapan\ninteraksi VR.\nRumusan Penelitian terkait Gamification dan Virtual Reality (VR) dalam pembelajaran anak\nMasalah autis berawal dari kesulitan belajar yang signifikan yang dihadapi anak autis. Kesulitan\nini meliputi kurangnya fokus pada anak autis yang mudah teralihkan perhatiannya dan\nsulit berkonsentrasi pada tugas, hal ini dapat membuat anak autis merasa frustrasi dan\ntertinggal dari teman-teman sekelasnya. Oleh karena itu, penelitian ini membutuhkan\nsuatu metode pembelajaran yang lebih efektif untuk diterapkan dalam pembelajaran\npada anak autis. Penelitian ini didasari oleh keyakinan bahwa pembelajaran berbasis\nVirtual Reality dengan Gamifikasi dan Pedagogic Agent untuk mengajarkan konsep\nhewan dan bioma kepada anak autis dapat meningkatkan motivasi dan keterlibatan anak\nautis dalam proses belajar, serta dapat menciptakan pengalaman belajar yang imersif dan\ninteraktif yang sesuai dengan gaya belajar anak autis yang ingin bebas mengeksplorasi.\nPenelitian ini diharapkan dapat meningkatkan kualitas pembelajaran anak autis dan\nmembantu mereka mencapai potensi penuh mereka.\nMetodologi\nTahap Penelitian :\n1. Perencanaan dan Desain\n1.1 Ide dan Konsep\nPada tahapan awal yang dilakukan adalah perencanaan dan desain, dimana pada\ntahapan ini menyangkut penentuan ide dan konsep awal model, termasuk membuat\nsketsa dan storyboard, bentuk, dimensi dan detailnya. kemudian kita mulai\nmenentukan tujuan pembelajaran seperti apa yang ingin dicapai oleh anak autis\nmelalui pembelajaran VR Gamified. Setelah tujuan telah ditentukan saatnya\nmemilih materi pembelajaran apa yang akan diajarkan melalui VR gamified, seperti\nmateri pengetahuan tentang hewan dan bioma. tahapan tahapan selanjutnya\nmenyangkut perancangan elemen gamification secara umum, pengembangan\nskenario VR, serta pemilihan platform VR yang sesuai dengan target pengguna.\n2. Pengembangan / Modelling 3D\n2.1 Model 3D\nPada tahapan ini 2D image dan model 3D memiliki keterkaitan secara tidak\nlangsung, 2D image dapat digunakan sebagai referensi, tekstur, serta storyboard\nuntuk membuat model 3D. Lalu di tahap inilah kita mulai membuat asset yaitu\nmodel 3D serta 3D Environment, seperti model 3D untuk membangun lingkungan\nVR.\n2.2 Sculpting, Texturing, Rigging\nPada tahapan ini dimulai dengan membuat bentuk dasar objek 3D menggunakan\nprimitive shapes serta menggunakan teknik pemodelan yang sesuai seperti\nsculpting, dan sebagainya. setelah kita menambahkan detail serta memastikan\ntopology model yang rapi dan terstruktur, maka proses selanjutnya adalah\ntexturing. Pada tahap texturing yaitu saatnya untuk memberikan material pada\nmodel untuk memberikan efek seperti kulit, kain, kayu, dan sebagainya. Sebelum\nmasuk ke tahap animasi kita perlu melakukan rigging untuk membuat karakter 3D\ndapat digerakkan dan dianimasikan, dengan cara membuat kerangka digital yang\nterhubung dengan model 3D.\n2.3 Animation\nSelanjutnya dengan menggunakan rig yang sudah dibuat sebelumnya saatnya\nmembuat animasi gerakan pada model 3D sesuai dengan jalan cerita atau\nstoryboard. Animasi ini bisa berupa gerakan sederhana seperti berjalan, berlari,\natau melompat, maupun animasi yang lebih kompleks.\n2.4 Rendering\nTahap berikutnya jika sudah selesai mengatur dan menyiapkan pencahayaan,\nmaterial, dan menentukan sudut pandang kamera yang tepat, maka sudah bisa\nmasuk ke tahap rendering, yaitu proses untuk menghasilkan gambar atau video\nfinal atau proses akhir dari model 3D.\n2.5 Exported 3D Object\nSetelah rendering selesai selanjutnya mengekspor 3D object yang sudah\ndikembangkan ke format file yang compatible dengan Unreal Engine, yang\nnantinya akan menjadi database asset untuk selanjutnya mengembangkan model\n3D dalam membangun Virtual Reality.\n3. Unreal Engine\n3.1 Interaksi VR\nLangkah awal yang dilakukan adalah menentukan interaksi VR yang merupakan\nfondasi yang akan menentukan bagaimana anak autis akan berinteraksi dengan\nlingkungan VR. Contoh interaksi VR yang ingin dibuat yaitu bisa berupa\nmemindahkan objek, memanipulasi objek, memicu peristiwa, berinteraksi dengan\nkarakter, dan sebagainya.\n3.2 Blueprint dan Script\nBlueprint adalah alat visual di Unreal Engine yang digunakan untuk memprogram\ninteraksi VR. Tahap yang dilakukan dalam membuat Blueprint untuk memprogram\ninteraksi VR adalah dengan menuliskan script menggunakan bahasa pemrograman\nyang kita pilih untuk mengontrol interaksi VR. Script ini dapat digunakan untuk\nmendeteksi input dari kontroler VR, memperbarui posisi objek dan memicu\nperistiwa.\n3.3 Elemen Gamification\nSetelah menentukan interaksi VR, langkah selanjutnya dalam pengembangan VR\nadalah menentukan elemen gamification. Beberapa elemen gamification yang\ndapat dipertimbangkan adalah Poin, Lencana, dan Papan Peringkat. Seperti\nmemberikan poin pada pengguna setiap menyelesaikan tugas, memberikan\nlencana kepada pengguna untuk mencapai pencapaian khusus, menampilkan\npapan peringkat yang menunjukkan peringkat pengguna. Selain itu elemen lainnya\ntermasuk menciptakan cerita yang menarik daam memandu pengguna melalui\naplikasi VR serta dapat juga menggunakan narasi untuk memberikan instruksi,\numpan balik, maupun dorongan kepada pengguna.\n4. Virtual Reality\nSetelah berhasil mengembangkan aplikasi VR gamified sebelumnya, maka tahapan\nberikutnya mengimplementasikan interaksi VR dan elemen gamification yang\ntelah dirancang ke dalam aplikasi VR. dilakukan pula pengujian internal untuk\nmemastikan aplikasi VR berfungsi dengan baik serta dilakukan juga pengujian\ndengan pengguna eksternal untuk mendapatkan umpan balik untuk\nmenyempurnakan aplikasi VR. Output yang dihasilkan pada akhir proses\npengembangan VR adalah aplikasi Virtual Reality Gamified untuk mengenalkan\ntentang hewan dan bioma pada anak autis.\nReferensi\nBian, Y., & Zhou, C. (2022). Motivation effect of animated pedagogical agent’s personality and\nfeedback strategy types on learning in virtual training environment. Virtual Reality &\nIntelligent Hardware, 4(2), 153–172. https://doi.org/10.1016/j.vrih.2021.11.001\nDr. Budi Setiawan, M. Pd. (2020). Interaksi Pedagogic Agent dengan Pengguna dalam\nPembelajaran. Jurnal Pendidikan Interaktif.\nDr. Yanti Nurhayati, M. Kom. (2019). Algoritma dan Alur Pembelajaran dalam Pedagogic Agent.\nJurnal Artificial Intelligence in Education.\nEka Sari, F. (2020). Peran Orang Tua dalam Meningkatkan Keterampilan Sosial Anak Autisme\nMelalui Kegiatan Bermain.\nEkawati, R. (2021). Pemahaman Tentang Gangguan Spektrum Autisme pada Orang Tua Anak\nBerkebutuhan Khusus.\nGajendran, A., Sanjeev, K., & Shah, M. (2023). The use of Virtual Reality in Clinical Practice for\nAutism Spectrum Disorder: A Comprehensive Mini-Review. https://doi.org/10.35248/2165-\n7890.23.13.377\nGraesser, A. C., & Person, N. K. (2023). Pedagogic Agents: A Review of the Literature.\nIndrati, R. (2022). Intervensi Perilaku Kognitif untuk Meningkatkan Kemampuan Belajar pada\nAnak Autisme.\nLanier, J. (2011). Virtual Reality as a New Frontier for Human Experience.\nLi, J., Zheng, Z., Chai, Y., Li, X., & Wei, X. (2023). FaceMe: An agent-based social game using\naugmented reality for the emotional development of children with autism spectrum\ndisorder. International Journal of Human-Computer Studies, 175, 103032.\nhttps://doi.org/10.1016/j.ijhcs.2023.103032\nMesa-Gresa, P., Gil-Gómez, H., Lozano-Quilis, J.-A., & Gil-Gómez, J.-A. (2018). Effectiveness\nof Virtual Reality for Children and Adolescents with Autism Spectrum Disorder: An\nEvidence-Based Systematic Review. Sensors (Basel, Switzerland), 18(8).\nhttps://doi.org/10.3390/s18082486\nParsons, S., & Beggiato, M. (2024). Virtual Reality and Pedagogic Agents: Revolutionizing\nEducation for Children with Autism Spectrum Disorder.\nPrasetyo, B. (2017). Strategi Pembelajaran yang Tepat untuk Anak Berkebutuhan Khusus\nAutisme di Sekolah Dasar.\nProf. Dr. Rini Widayati, M. Psi. (2021). Bentuk dan Wujud Pedagogic Agent dalam\nPembelajaran. Jurnal Pendidikan Multimedia.\nS. Weinberg, B. (2010). The Role of Exploration in the Development of Children with Autism\nSpectrum Disorders.\nSaadatzi, M. (2016). Psychophysiological analysis of a pedagogical agent and robotic peer for\nindividuals with autism spectrum disorders. [University of Louisville].\nhttps://doi.org/10.18297/etd/2570\nSari, A. (2019). Diagnosis dan Tatalaksana Gangguan Spektrum Autisme pada Anak.\nSari, D. (2018). Pelatihan Keterampilan Komunikasi bagi Orang Tua Anak Autisme.\nZhao, J.-Q., Zhang, X.-X., Wang, C.-H., & Yang, J. (2021). Effect of cognitive training based on\nvirtual reality on the children with autism spectrum disorder. Current Research in\nBehavioral Sciences, 2, 100013. https://doi.org/10.1016/j.crbeha.2020.100013\nMedan, 14 Mei 2024\nMahasiswa yang mengajukan,\n(Asruri Salwa Asy Syifa)\nNIM. 201402083",
  "similar_tokens": [
    "and",
    "hewan",
    "guna",
    "tentu",
    "tahap",
    "kognitif",
    "latih",
    "virtual",
    "anak",
    "the",
    "karakter",
    "elemen",
    "tingkat",
    "umpan",
    "teliti",
    "animasi",
    "gamification",
    "bas",
    "motivasi",
    "with",
    "interaktif",
    "ajar",
    "children",
    "judul",
    "cipta",
    "for",
    "ganggu",
    "reality",
    "sosial",
    "mampu",
    "hasil",
    "interaksi",
    "terampil"
  ],
  "filename": "Salinan_Exum_201402083.pdf",
  "user_id": 17
}